{
  "runId": "run1",
  "processedAt": "2025-12-14T21:22:09.437Z",
  "totalArticles": 2,
  "articles": [
    {
      "original": {
        "url": "https://apnews.com/article/australia-shooting-sydney-bondi-beach-31f711f09f677d0f88091ece25f651c1",
        "title": "Gunmen kill at least 15 people in attack on Hanukkah celebration on Sydney’s Bondi Beach",
        "excerpt": "A child is one of at least 15 people killed in an attack in Australia at one of the world’s most famous beaches. One of the gunman was also shot dead. Hundreds of people had gathered at Bondi Beach in Sydney for an event to celebrate the first day of Hanukkah, when gunmen opened fire. At least 15 people are dead and 42 others are in hospital in an attack authorities say was designed to target the Jewish community. New South Wales premier Chris Minns said Monday that those killed included a 10-year-old child. The oldest person killed was 87.",
        "category": "world",
        "body": "SYDNEY (AP) — Two gunmen opened fire during a Hanukkah celebration on Sydney’s Bondi beach, killing 15 people, including a child, officials said Monday, in what Prime Minister Anthony Albanese called an act of antisemitic terrorism that struck at the heart of the nation.\n\nThe massacre at one of Australia’s most popular beaches followed a wave of antisemitic attacks that have roiled the country over the past year, although the authorities didn’t suggest those and the shooting Sunday were connected. It was the deadliest shooting in almost three decades in a country with strict gun control laws.\n\nOne gunman, a 50-year-old man, was fatally shot by police. The other shooter, his 24-year-old son, was wounded and was being treated at a hospital, said the Mal Lanyon, New South Wales police commissioner.\n\nPolice said one gunman was known to security services, but Lanyon said authorities had no indication of a planned attack.\n\nThose killed were aged between 10- and 87-years-old, New South Wales Premier Chris Minns told reporters. At least 38 others were injured in the attack.\n\n“What we saw yesterday was an act of pure evil, an act of antisemitism, an act of terrorism on our shores in an iconic Australian location, Bondi Beach, that is associated with joy, associated with families gathering, associated with celebrations,” Australian Prime Minister Anthony Albanese said Monday.\n\n“It is forever tarnished by what has occurred.”\n\nPolice pledged a “thorough” investigation, Lanyon said. Authorities were not looking for anyone else in connection with the massacre.\n\nThe violence erupted at the end of a summer day when thousands had flocked to Bondi Beach, including hundreds gathered for the Chanukah by the Sea event celebrating the start of the eight-day Hanukkah festival.\n\nChabad, an Orthodox Jewish movement that runs outreach worldwide and sponsors events during major Jewish holidays, identified one of the dead as Rabbi Eli Schlanger, assistant rabbi at Chabad of Bondi and an organizer of the event.\n\nIsrael’s Foreign Ministry confirmed the death of an Israeli citizen, but gave no further details.\n\nPolice said emergency services were called at about 6:45 p.m., responding to reports of shots being fired. Video by onlookers showed people in bathing suits running from the water as shots rang out. Separate footage showed two men in black shirts firing with long guns from a footbridge leading to the beach.\n\nOne dramatic clip broadcast on Australian television showed a man appearing to tackle and disarm one gunman, before pointing the man’s weapon at him, then setting the gun on the ground.\n\nBystanders stay where police cordon off an area at Bondi Beach after a reported shooting in Sydney, Sunday, Dec. 14, 2025. (AP Photo/Mark Baker)\n\nMinns called the man, identified by relatives to Australian media as fruit shop owner Ahmed al Ahmed, a “genuine hero.”\n\nArsen Ostrovsky, a lawyer attending the Hanukkah ceremony with his wife and daughters, was grazed in the head by a bullet. Ostrovsky said he moved from Israel to Australia two weeks ago to work for a Jewish advocacy group.\n\n“What I saw today was pure evil, just an absolute bloodbath. Bodies strewn everywhere,” he told The Associated Press in an email from the hospital. “I never thought would be possible here in Australia.”\n\nLachlan Moran, 32, from Melbourne, told the AP he was waiting for his family when he heard shots.\n\n“I sprinted as quickly as I could,” Moran said. He said he heard shooting off and on for about five minutes. “Everyone just dropped all their possessions and everything and were running and people were crying and it was just horrible.”\n\nPersonal belongings are left on a grassy area in the early morning following a shooting Sunday at Sydney’s Bondi Beach, Monday, Dec. 15, 2025. (AP Photo/Mark Baker)\n\nAlbanese vowed the violence would be met with “a moment of national unity where Australians across the board will embrace their fellow Australians of Jewish faith.”\n\nKing Charles III said he and Queen Camilla were “appalled and saddened by the most dreadful antisemitic terrorist attack.” United Nations Secretary-General António Guterres said on X he was horrified, and his “heart is with the Jewish community worldwide.”\n\nU.S. Secretary of State Marco Rubio said in a post on X: “The United States strongly condemns the terrorist attack in Australia targeting a Jewish celebration. Antisemitism has no place in this world.”\n\nPolice in cities around the world, including London, said they would step up security at Jewish sites.\n\nAustralia, a country of 28 million people, is home to about 117,000 Jews, according to official figures. Antisemitic incidents, including assaults, vandalism, threats and intimidation, surged more than threefold in the country during the year after Hamas attacked Israel on Oct. 7, 2023, and Israel launched a war on Hamas in Gaza in response, the government’s Special Envoy to Combat Antisemitism Jillian Segal reported in July.\n\nLast year, the country was rocked by antisemitic attacks in Sydney and Melbourne. Synagogues and cars were torched, businesses and homes graffitied and Jews attacked in those cities, where 85% of the nation’s Jewish population lives.\n\nAlbanese in August blamed Iran for two of the attacks and cut diplomatic ties to Tehran.\n\nPastor Matt Graham, who was conducting a service at Bondi Anglican Church when panicked people began entering for shelter, said antisemitism has been brewing in Sydney’s eastern suburbs including Bondi, where the Jewish community is centered.\n\n“I’m surrounded by antisemitic graffiti constantly,” Graham told the Australian Broadcasting Corp. “As a Christian, I just want to declare I stand with the people of Israel.”\n\nIsrael urged Australia’s government to address crimes targeting Jews. Prime Minister Benjamin Netanyahu said he warned Australia’s leaders months ago about the dangers of failing to take action against antisemitism. He claimed Australia’s decision — in line with scores of other countries — to recognize a Palestinian state “pours fuel on the antisemitic fire.”\n\n“Your government did nothing to stop the spread of antisemitism in Australia ... and the result is the horrific attacks on Jews we saw today,” Netanyahu said.\n\nHis office released safety recommendations Monday for Israelis traveling abroad, including avoiding large gatherings that don’t have security, especially events at synagogues and Hanukkah gatherings. It also called for heightened awareness at Jewish and Israeli sites.\n\nCandles and flowers are left in the early morning following a shooting Sunday at Sydney’s Bondi Beach, Monday, Dec. 15, 2025. (AP Photo/Mark Baker)\n\nMass shootings in Australia are extremely rare. A 1996 massacre in the Tasmanian town of Port Arthur, where a lone gunman killed 35 people, prompted the government to drastically tighten gun laws, making it much more difficult to acquire firearms.\n\nSignificant mass shootings this century included two murder-suicides with death tolls of five people in 2014 and seven in 2018, in which gunmen killed their own families and themselves.\n\nIn 2022, six people were killed in a shootout between police and Christian extremists at a rural property in Queensland state.\n\n___\n\nMcGuirk reported from Melbourne, Australia, and Graham-McLay from Wellington, New Zealand. Associated Press writers Melanie Lidman in Tel Aviv, Israel, and Mustakim Hasnath in London contributed to this report.",
        "scrapedAt": "2025-12-14T21:20:43.806Z",
        "success": true,
        "origin": "apNewsWorld"
      },
      "processed": {
        "title": "Shooting at Sydney's Bondi Beach Hanukkah Event Leaves 15 Dead",
        "tickerTitle": "Bondi Beach Attack",
        "excerpt": "At least 15 people have been killed in a shooting during a Hanukkah celebration at Bondi Beach in Sydney, including a child. Authorities are investigating.",
        "category": "world",
        "body": "SYDNEY — A shooting incident during a Hanukkah celebration at Bondi Beach in Sydney resulted in the deaths of 15 individuals, including a child, according to officials. Prime Minister Anthony Albanese described the situation as an act of antisemitic terrorism that has struck deeply at the nation’s heart. The violence occurred at a popular event marking the start of the eight-day Hanukkah festival, attracting hundreds to the beach.\n\nThe attack took place as two gunmen fired into the crowd, with one identified as a 50-year-old man killed by police and the other, his 24-year-old son, injured and hospitalized. NSW Police Commissioner Mal Lanyon reported that while one gunman had a history with security services, there was no indication that the shooting was a planned act.\n\nVictims of the shooting ranged in age from 10 to 87, as confirmed by New South Wales Premier Chris Minns. Witness accounts describe chaos as bystanders rushed away from the beach while shots rang out, with several individuals left injured in the aftermath. Emergency services were alerted at approximately 6:45 p.m., responding to reports of gunfire, leading to frantic scenes captured on video.\n\nPrime Minister Albanese vowed that the incident would not divide the nation and expressed his condolences to the victims' families. The event has focused attention on a rising tide of antisemitism in Australia, with calls for enhanced security at Jewish community sites and events in the wake of the tragedy.",
        "imageKeyword": "Bondi",
        "tags": [
          "Australia",
          "Elections",
          "Markets"
        ],
        "image": {
          "url": "https://upload.wikimedia.org/wikipedia/commons/4/4d/Dark_Clouds_over_Bondi.jpg",
          "source": "wikimedia",
          "sourcePageUrl": "https://commons.wikimedia.org/wiki/File%3ADark%20Clouds%20over%20Bondi.jpg",
          "imageDescription": "Dark Clouds over Bondi",
          "artist": "Marc Dalmulder",
          "licenseShortName": "CC BY 2.0",
          "license": "CC BY 2.0",
          "authorName": "Marc Dalmulder"
        }
      }
    },
    {
      "original": {
        "url": "https://www.yahoo.com/news/articles/australia-hanukkah-celebration-targeted-antisemitic-171236656.html",
        "title": "Australia Hanukkah celebration targeted in antisemitic terrorist attack. What to know.",
        "excerpt": "Officials said 16 people were shot and killed Sunday in a targeted attack on a Jewish holiday celebration, to mark the start of Hanukkah, in Australia's...",
        "category": "world",
        "body": "Officials said 16 people are dead after gunmen targeted the attendees of a Jewish community event on Sunday in Australia's Bondi Beach. Another 40 people were hospitalized with injuries, including a child and two officers, according to police. Two of the suspects were identified as a father and a son, according to Mal Lanyon, the police commissioner of New South Wales.\n\nThe 50-year-old father was killed, and the son — identified as 24-year-old Naveed Akram, a Pakistani national based in Sydney, according to a U.S. intelligence briefing and a driver's license provided by Australian police — was in custody in critical but stable condition, Lanyon said.\n\nAustralian officials and international leaders have condemned it as an antisemitic terrorist attack.\n\nPolice said they expect the death toll to climb. Here is what we know so far.\n\nGunfire broke out at a Hanukkah celebration\n\nThe attack took place during a Jewish holiday celebration held to mark the first day of Hanukkah. More than 1,000 people were on the beach, in a suburb of Sydney, when shots rang out, said New South Wales Police Commissioner Mal Lanyon, who officially declared the shooting a \"terrorist incident.\"\n\nNumerous Australian officials have characterized the shooting as targeted. New South Wales Premier Chris Minns said it \"was designed to target Sydney's Jewish community.\"\n\n\"This is a targeted attack on Jewish Australians on the first day of Hanukkah — which should be a day of joy, a celebration of faith — an act of evil antisemitism, terrorism, that has struck the heart of our nation,\" Australian Prime Minister Anthony Albanese said at a news conference.\n\nVideo footage recorded by civilians showed frightened crowds of beachgoers fleeing the area as gunshots went off in the background.\n\nNeither officials nor police have identified the victims of the attack. Chabad, a global organization representing a branch of ultra-Orthodox Judaism, said Rabbi Eli Schlanger, with Chabad of Bondi, was among the dead, the Associated Press reported. Schlanger had been a key organizer of the Hanukkah event on Bondi Beach, according to the organization.\n\n2 suspects identified as father and son\n\nAustralian authorities said two gunmen were suspected of carrying out the deadly mass shooting, a rare occurrence in a country where gun violence is uncommon.\n\nLanyon said the deceased suspect was previously known to the New South Wales police force. In addition to the 50-year-old gunman killed at the scene of the attack, another was hospitalized with serious injuries, he said. The surviving gunman, the 24-year-old son, has been taken into custody. The commissioner later said officers were not looking for an additional suspect.\n\nSix licensed firearms were found at the scene, Lanyon said, adding that they all belong to the father. The police commissioner added that the older suspect had a gun licence for about ten years.\n\n\"We will look at the motives behind this attack and I think it is important as part of the investigation,\" he said.\n\nA man has been lauded as a hero and praised by the police commissioner for tackling one suspect and disarming him in dramatic video footage recorded by a bystander along Campbell Parade, a main street that wraps around Bondi Beach. In the footage, the man could be seen crouched in hiding behind a parked car before wrestling the suspect and taking his weapon.\n\nAustralian news outlets have identified the man seen disarming the suspect as fruit shop owner Ahmed al Ahmed, citing his relatives.\n\nOfficers found explosive devices\n\nShortly after the shooting took place, officers who responded to the scene discovered a vehicle along Campbell Parade and believed there were several improvised explosive devices inside of it, Lanyon said. The vehicle was linked to the deceased gunman, according to the police commissioner. A rescue bomb disposal crew was at the scene.\n\nRising antisemitism in Australia\n\nAlthough Australia rarely experiences mass shootings, after implementing stringent gun reform laws in the wake of a deadly 1996 massacre in Tasmania's Port Arthur, antisemitic incidents have been on the rise in the country since the war in Gaza began in 2023.\n\nThe Australian government appointed special envoys in 2024 to address spiking antisemitism, as well as Islamophobia, in its communities. But attacks still happened this year. One, in July, involved an arsonist who set fire to the door of a synagogue in Melbourne, while worshippers were inside.\n\nWorld leaders react\n\nThe attack on Bondi Beach drew widespread condemnation from leaders across the globe.\n\nIn the U.S., Secretary of State Marco Rubio spoke out against antisemitism in a social media post, which said: \"Antisemitism has no place in this world. Our prayers are with the victims of this horrific attack, the Jewish community, and the people of Australia.\"\n\nRubio joined officials from numerous countries, including the United Kingdom, France, Germany, Finland, New Zealand, India, Qatar and Pakistan, who similarly shared remarks expressing sympathy for the victims and solidarity with Jewish communities, as well as denouncing antisemitism.\n\nIsraeli Prime Minister Benjamin Netanyahu was among the officials in his country who responded publicly to the attack in Australia. In a statement released by his office, Netanyahu criticized Albanese for supporting a Palestinian state and said such support fuels antisemitism.\n\n\"Your call for a Palestinian state pours fuel on the antisemitic fire,\" Netanyahu's statement read, quoting a letter that the Israeli prime minister said he wrote to Albanese in August. \"It rewards Hamas terrorists. It emboldens those who menace Australian Jews and encourages the Jew hatred now stalking your streets.\"\n\nThe American Jewish Committee, an advocacy group and charity organization, said the attack \"comes after repeated warnings, including from the Australian Jewish community itself,\" adding that \"allowing antisemitic rhetoric and demonstrations to go unchecked can—and does—lead to violence and death.\"\n\nA guide to \"Made in America\" holiday gifts, state by state\n\nCBS News Presents: A Town Hall with Erika Kirk\n\nBûche de Noël: A traditional Christmas treat",
        "scrapedAt": "2025-12-14T21:20:46.127Z",
        "success": true,
        "origin": "yahooWorldNews"
      },
      "processed": {
        "title": "Antisemitic Terror Attack During Hanukkah in Australia",
        "tickerTitle": "Hanukkah Attack",
        "excerpt": "A targeted shooting at a Hanukkah celebration in Bondi Beach, Australia, left 16 dead and many injured, leading to widespread condemnation.",
        "category": "world",
        "body": "On Sunday, a shooting at a Jewish holiday celebration in Bondi Beach, Australia, resulted in 16 fatalities and approximately 40 injuries, including a child and two police officers. The attack occurred during the observance of Hanukkah, with over 1,000 attendees present. New South Wales Police Commissioner Mal Lanyon classified the event as a \"terrorist incident\" and noted that two suspects, a father and son, were involved. The father was killed, while the son, Naveed Akram, is in police custody and critically injured.\n\nLeaders at both national and international levels condemned the shooting as an antisemitic act. Prime Minister Anthony Albanese described the incident as an evil act targeting the Jewish community, which should have been a celebratory occasion. Eyewitness videos captured chaos as beachgoers fled the scene amid gunfire. Although the victims have not all been publicly identified, Rabbi Eli Schlanger of Chabad, a key organizer of the event, was reported among those killed. \n\nThis mass shooting marks a rare occurrence in Australia, a country with typically low gun violence. Six firearms belonging to the father were recovered at the crime scene. Authorities suspect the attack was premeditated, as they found a vehicle linked to the deceased suspect containing improvised explosive devices. A local fruit shop owner, Ahmed al Ahmed, has been praised for tackling one of the attackers and disarming him. \n\nThe shooting has triggered global responses, with leaders from multiple countries expressing solidarity with the Jewish community and denouncing rising antisemitism, particularly amidst increased tensions following the 2023 conflict in Gaza. Calls for further protective measures against such hate crimes have gained urgency among Australian officials since a rise in antisemitic incidents has been noted this year.",
        "imageKeyword": "Hanukkah",
        "tags": [
          "Antisemitism",
          "Australia",
          "Elections"
        ],
        "image": {
          "url": "https://upload.wikimedia.org/wikipedia/commons/7/7d/Woman_lighting_the_candles_for_the_Festival_of_Lights_in_India_%28cropped%29.jpg",
          "source": "wikimedia",
          "sourcePageUrl": "https://commons.wikimedia.org/wiki/File%3AWoman%20lighting%20the%20candles%20for%20the%20Festival%20of%20Lights%20in%20India%20(cropped).jpg",
          "imageDescription": "Festival of Lights is one of the festivals of West Bengal and India. On this festival, all the people of West Bengal light up their houses around with lamps, candles and different colored electric lamps.",
          "artist": "Original: AjoyDutta1997 Derivative work: Aristeas",
          "licenseShortName": "CC BY-SA 4.0",
          "license": "CC BY-SA 4.0",
          "authorName": "Original: AjoyDutta1997 Derivative work: Aristeas"
        }
      }
    }
  ]
}