{
  "runId": "run1",
  "collectedAt": "2025-12-15T19:59:22.863Z",
  "totalArticles": 2,
  "articles": [
    {
      "url": "https://apnews.com/article/russia-ukraine-war-berlin-talks-zelenskyy-5b99faff949ee1ba6212433be2d54b88",
      "title": "US officials say Washington has agreed to give Ukraine security guarantees in peace talks",
      "excerpt": "U.S. officials say Washington has agreed to provide unspecified security guarantees to Ukraine as part of a peace deal to end Russia’s nearly four-year war, and more talks are likely this weekend. The officials spoke Monday following the latest discussions with President Volodymyr Zelenskyy in Berlin. European leaders there said they and the U.S. committed to work together to provide “robust security guarantees” including a European-led ”multinational force Ukraine” supported by the U.S. They said the force's work would include operating inside Ukraine. Questions over Ukraine’s postwar security and the fate of occupied territories have been the main obstacles in talks.",
      "category": "world",
      "body": "BERLIN (AP) — The U.S. has agreed to provide unspecified security guarantees to Ukraine as part of a peace deal to end Russia’s nearly four-year war, and more talks are likely this weekend, U.S. officials said Monday following the latest discussions with President Volodymyr Zelenskyy in Berlin.\n\nThe officials said talks with President Donald Trump’s envoys, Steve Witkoff and Jared Kushner, led to narrowing differences on security guarantees that Kyiv said must be provided, as well as on Moscow’s demand that Ukraine concede land in the Donbas region in the country’s east.\n\nTrump was expected to dial into a dinner Monday evening with negotiators and European leaders, with more talks likely this weekend in Miami or elsewhere in the United States, according to the U.S. officials, who spoke on condition of anonymity because they were not authorized to comment publicly by the White House.\n\nThe U.S. officials said the offer of security guarantees won’t be on the table “forever.” They said the Trump administration plans to put forward the agreement on guarantees for Senate approval, although they didn’t specify whether it would be ratified like a treaty, which needs the chamber’s two-thirds approval.\n\nIn a statement, European leaders in Berlin said they and the U.S. committed to work together to provide “robust security guarantees” including a European-led ”multinational force Ukraine” supported by the U.S.\n\nThey said the force’s work would include “operating inside Ukraine” as well as assisting in rebuilding Ukraine’s forces, securing its skies and supporting safer seas. They said Ukrainian forces should remain at a peacetime level of 800,000.\n\nGerman Chancellor Friedrich Merz called it a “truly far-reaching, substantial agreement that we did not have before, namely that both Europe and the U.S. are jointly prepared to do this.”\n\nQuestions over Ukraine’s postwar security and the fate of occupied territories have been the main obstacles in talks. Zelenskyy has emphasized that any Western security assurances would need to be legally binding and supported by the U.S. Congress. Meanwhile, Russia has said it will not accept any troops from NATO countries being based on Ukrainian soil.\n\nZelenskyy on Monday called talks “substantial” and noted that differences remain on the issue of territories.\n\nZelenskyy has expressed readiness to drop Ukraine’s bid to join the NATO military alliance if the U.S. and other Western nations give Kyiv security guarantees similar to those offered to NATO members. But Ukraine’s preference remains NATO membership as the best security guarantee to prevent further Russian aggression.\n\nUkraine has continued to reject the U.S. push for ceding territory to Russia. Russian President Vladimir Putin wants Ukraine to withdraw its forces from the part of Donetsk region still under its control as a key condition for peace.\n\nThe U.S. officials on Monday said there is consensus on about 90% of the U.S.-authored peace plan, and that Russia has indicated it is open to Ukraine joining the European Union, something it previously said it did not object to.\n\nAP Washington correspondent Sagar Meghani reports on U.S. officials citing progress in talks with Ukrainian leaders on ending Russia’s war.\n\nThe Russian president has cast Ukraine’s bid to join NATO, however, as a major threat to Moscow’s security and a reason for launching the full-scale invasion in February 2022. The Kremlin has demanded that Ukraine renounce the bid for alliance membership as part of any prospective peace settlement.\n\nAsked whether the negotiations could be over by Christmas, Kremlin spokesperson Dmitry Peskov said trying to predict a potential time frame for a peace deal was a “thankless task.”\n\n“I can only speak for the Russian side, for President Putin,” Peskov said. “He is open to peace, to a serious peace and serious decisions. He is absolutely not open to any tricks aimed at stalling for time.”\n\nPutin has denied plans to attack any European allies.\n\nRussia fired 153 drones of various types at Ukraine overnight Sunday into Monday, according to Ukraine’s Air Force, which said 133 drones were neutralized, while 17 more hit their targets.\n\nIn Russia, the Defense Ministry on Monday said forces destroyed 130 Ukrainian drones overnight. An additional 16 drones were destroyed between 7 a.m. and 8 a.m. local time.\n\nEighteen drones were shot down over Moscow itself, the defense ministry said. Flights were temporarily halted at the city’s Domodedovo and Zhukovsky airports as part of safety measures, officials said.\n\nDamage details and casualty figures were not immediately available.\n\n___\n\nMadhani reported from Washington. Seung Min Kim in Washington; Pietro De Cristofaro in Berlin; Illia Novikov in Kyiv, Ukraine; and Katie Marie Davies in Manchester, England, contributed to this report.\n\n___\n\nFollow the AP’s coverage of Russia’s war in Ukraine at https://apnews.com/hub/russia-ukraine.",
      "scrapedAt": "2025-12-15T19:59:20.978Z",
      "success": true,
      "origin": "apNewsWorld"
    },
    {
      "url": "https://www.yahoo.com/news/articles/flash-flood-kills-dozens-morocco-115608841.html",
      "title": "Flash flood kills dozens in Morocco town",
      "excerpt": "A flash flood in a Moroccan coastal town has killed at least 37 people, local officials said on Monday, as search and rescue operations continued.Flash...",
      "category": "world",
      "body": "A flash flood in a Moroccan coastal town has killed at least 37 people, local officials said on Monday, as search and rescue operations continued.\n\nDrought-hit Morocco often faces severe weather, but Sunday's flooding in Safi is already the deadliest such disaster in at least a decade.\n\nA muddy torrent swept cars and bins from the streets of the town, which is around 300 kilometres (186 miles) south of the capital Rabat.\n\nNational weather forecaster the General Directorate of Meteorology (DGM) warned that more thunderstorms were likely over the next three days in several areas, including Safi.\n\nSeven survivors were still being treated at the town's Mohammed V hospital, with two of them in intensive care, according to updated figures from local officials.\n\nSchools have been closed for at least three days, as mud and debris clog the streets.\n\n\"The water overwhelmed us. We couldn't sleep all night. We lost everything, even my children's textbooks,\" mother of six Hanane Nasreddine told AFP, her voice trembling.\n\nNezha El Meghouari said she had had only moments to escape her home.\n\n\"I've lost all my clothes. Only my neighbour gave me some to cover myself. I have nothing left. I've lost everything,\" she said.\n\nAt least 70 homes and businesses in the historic town centre were flooded, and 55-year-old shopkeeper Abdelkader Mezraoui said the retail economy had been devastated.\n\n\"Jewellery store owners have lost all their stock... and the same goes for clothing store owners,\" he said, calling for official compensation to save businesses.\n\nSafi is known as a centre for arts and crafts, particularly terracotta pottery, and its streets were left littered with smashed bowls and tajines.\n\nThe Moroccan prosecutor's office announced the opening of an investigation to determine if anyone bore responsibility for the extent of the damage, according to official news agency MAP.\n\n- Intense storms -\n\nSpeaking to parliament, Prime Minister Aziz Akhannouch said \"37 millimetres (1.5 inches) of rain fell in a short period of time and hit the historic Bab Chabaa district (in Safi), which is crossed by a river, causing the deaths of numerous merchants and workers\".\n\nLate on Sunday, rescuer Azzedine Kattane told AFP about the strong \"psychological impact of the tragedy\" in light of the large number of victims.\n\nAs the waters receded, they left behind a landscape of mud and overturned cars. Onlookers watched Civil Protection units and local residents working to clear debris.\n\nMorocco is struggling with a severe drought for the seventh consecutive year, while last year was the North African kingdom's hottest on record.\n\nClimate change has made storms more intense, because a warmer atmosphere holds more moisture and warmer seas can turbocharge weather systems.\n\nFlash floods killed hundreds in Morocco in 1995 and scores in 2002.\n\nstr-kao-anr/fka/dcp/smw",
      "scrapedAt": "2025-12-15T19:59:22.860Z",
      "success": true,
      "origin": "yahooWorldNews"
    }
  ]
}