{
  "runId": "run1",
  "collectedAt": "2025-12-12T22:50:08.159Z",
  "totalArticles": 8,
  "articles": [
    {
      "url": "https://apnews.com/article/poll-economy-inflation-groceries-costs-trump-affordability-d27635d279b27e5e2c19700c006ebb1d",
      "title": "This holiday season isn’t very merry for consumers, an AP-NORC poll finds",
      "excerpt": "A new AP-NORC poll finds this holiday season isn’t quite so merry for American shoppers as large shares of them are dipping into savings, scouring for bargains and feeling like the overall economy is stuck in a rut under President Donald Trump. The vast majority of U.S. adults say they’ve noticed higher than usual prices for groceries, electricity and holiday gifts. Roughly half of Americans say it’s harder than usual to afford the things they want to give as holiday gifts. It’s a sobering assessment for the Republican president, who returned to the White House in large part by promising to lower prices.",
      "category": "us",
      "body": "WASHINGTON (AP) — This holiday season isn’t quite so merry for American shoppers as large shares are dipping into savings, scouring for bargains and feeling like the overall economy is stuck in a rut under President Donald Trump, a new AP-NORC poll finds.\n\nThe vast majority of U.S. adults say they’ve noticed higher than usual prices for groceries, electricity and holiday gifts in recent months, according to the survey from The Associated Press-NORC Center for Public Affairs Research.\n\nRoughly half of Americans say it’s harder than usual to afford the things they want to give as holiday gifts, and similar numbers are delaying big purchases or cutting back on nonessential purchases more than they would normally.\n\nIt’s a sobering assessment for the Republican president, who returned to the White House in large part by promising to lower prices, only to find that inflation remains a threat to his popularity just as it did for Democrat Joe Biden’s presidency. The poll’s findings look very similar to an AP-NORC poll from December 2022, when Biden was president and the country was grappling with higher rates of inflation. Trump’s series of tariffs have added to inflationary pressures and generated anxiety about the stability of the U.S. economy, keeping prices at levels that many Americans find frustrating.\n\nThe president has insisted there is “no” inflation and the U.S. economy is booming, as he expressed frustration that the public feels differently.\n\n“When will people understand what is happening?” Trump said Thursday on Truth Social. “When will Polls reflect the Greatness of America at this point in time, and how bad it was just one year ago?”\n\nMost U.S. adults, 68%, continue to say the country’s economy is “poor,” which is unchanged from December 2024, before Trump returned to the presidency.\n\nWhite House officials plan to send Trump barnstorming across the country in hopes of bucking up people’s faith in the economy before next year’s midterm elections. But the president this week in Pennsylvania defended the price increases tied to his tariffs by suggesting that Americans should buy fewer dolls and pencils for children. His message is a jarring contrast with what respondents expressed in the poll, even among people who backed him in the 2024 election.\n\nSergio Ruiz, 44, of Tucson, Arizona, said he is using more buy now, pay later programs to spread out over time the expense of gifts for his children. He doesn’t put a huge emphasis on politics, but he voted for Trump last year and would like to see lower interest rates to help boost his real estate business. He believes that more Americans having higher incomes would help to manage any affordability issues.\n\n“Prices are up. What can you do? You need to make more money,” Ruiz said.\n\nThe poll found that when they do shop, about half of Americans are finding the lowest price more than they would normally. About 4 in 10 are dipping into their savings more than at other times.\n\nDemocrats are more likely than Republicans to say they’re cutting back on expenses or looking for low prices, but many Republicans are budgeting more than usual as well. About 4 in 10 Republicans are looking for low prices more than they usually would, while a similar share are shopping for nonessential items less than usual.\n\nPeople felt similarly dismal about holiday shopping and the economy when Biden was president in 2022. Inflation had spiked to a four-decade high that summer. Three years later, inflation has eased substantially, but it’s still running at 3%, a full percentage point above the Federal Reserve’s target as the job market appears to have entered a deep freeze.\n\nThe survey indicates that it’s the level of prices — and not just the rate of inflation — that is the point of pain for many families. Roughly 9 in 10 U.S. adults, 87%, say they’ve noticed higher than usual prices for groceries in the past few months, while about two-thirds say they’ve experienced higher prices than usual for electricity and holiday gifts. About half say they’ve seen higher than normal prices for gas recently.\n\nThe findings on groceries and holiday gifts are only slightly lower than in the 2022 poll, despite the slowdown from an inflation rate that hit a four-decade peak in the middle of that year.\n\nConsumer spending has stayed resilient despite the negative sentiments about the economy, yet Trump’s tariffs have caused changes for shoppers such as Andrew Russell.\n\nThe 33-year-old adjunct professor in Arlington Heights, Illinois, said he used to shop for unique gifts from around the globe and buy online. But with the tariffs, he got his gifts locally and “this year, I only bought things that I can pick up in person,” he said.\n\nRussell, who voted Democratic in last year’s election, said he worries about the economy for next year. He thinks the investment in artificial intelligence has become a bubble that could burst, taking down the stock market.\n\nFew people expect the situation to meaningfully improve next year — a sign that Trump has done little to instill much confidence from his mix of tariffs, income tax cuts and foreign trips to attract investments. Trump has maintained that the benefits from his policies will begin to snowball in 2026.\n\nAbout 4 in 10 U.S. adults expect next year will be economically worse for the country. Roughly 3 in 10 say conditions won’t change much. Only about 2 in 10 think things will get better, with Republicans being more optimistic.\n\nThe belief that things will get better has slipped from last year, when about 4 in 10 said that 2025 would be better than 2024.\n\nMillicent Simpson, 56, of Cleveland, Ohio, said she expects the economy to be worse for people like her who rely on Medicaid for health care and the Supplemental Nutrition Assistance Program. Simpson voted Democratic last year and blames Trump for the greater economic pressures that she faces going into the winter.\n\n“He’s making it rough for us,” she said. “He’s messing with the government assistance for everybody, young and old.”\n\n___\n\nThe AP-NORC poll of 1,146 adults was conducted Dec. 4-8 using a sample drawn from NORC’s probability-based AmeriSpeak Panel, which is designed to be representative of the U.S. population. The margin of sampling error for adults overall is plus or minus 4 percentage points.",
      "scrapedAt": "2025-12-12T22:50:01.169Z",
      "success": true,
      "origin": "apNewsUS"
    },
    {
      "url": "https://apnews.com/article/abrego-garcia-el-salvador-deportation-f6d3df5d2315375dea83492858dc91f5",
      "title": "Federal judge issues order to prohibit immigration officials from detaining Kilmar Abrego Garcia",
      "excerpt": "Kilmar Abrego Garcia has walked away after a scheduled appointment at an Immigration and Customs Enforcement field office after a federal judge ordered that officials could not detain him. Abrego Garcia appeared Friday for the appointment at a Maryland ICE office, some 14 hours after he was released from detention in Pennsylvania on a judge’s orders. His lawyers asked the judge to block authorities from detaining him again. The judge says officials cannot re-detain him until the court conducts a hearing on the motion for the temporary restraining order. Abrego Garcia became a flashpoint of the Trump administration’s immigration crackdown earlier this year when he was wrongly deported to a notorious prison in El Salvador.",
      "category": "us",
      "body": "BALTIMORE (AP) — A federal judge blocked U.S. immigration authorities on Friday from re-detaining Kilmar Abrego Garcia, saying she feared they might take him into custody again just hours after she had ordered his release from a detention center.\n\nThe order came as Abrego Garcia appeared at a scheduled appointment at an Immigration and Customs Enforcement field office roughly 14 hours after he walked out of immigration detention facility in Pennsylvania.\n\nHis lawyers had sent an urgent request to the judge, warning that ICE officials could immediately place him back into custody. Instead, Abrego Garcia exited the building after a short appointment, emerging to cheers from supporters who had gathered outside.\n\nSpeaking briefly to the crowd, he urged others to “stand tall” against what he described as injustices carried out by the government.\n\nAbrego Garcia became a flashpoint of the Trump administration’s immigration crackdown earlier this year when he was wrongly deported to a notorious prison in El Salvador. He was last taken into custody in August during a similar check-in.\n\nOfficials cannot re-detain him until the court conducts a hearing on the motion for the temporary restraining order, U.S. District Judge Paula Xinis in Maryland said. She wrote that Abrego Garcia is likely to succeed on the merits of any further request for relief from ICE detention.\n\n“For the public to have any faith in the orderly administration of justice, the Court’s narrowly crafted remedy cannot be so quickly and easily upended without further briefing and consideration,” she wrote.\n\nAbrego Garcia on Friday stopped at a news conference outside the building, escorted by a group of supporters chanting “We are all Kilmar!”\n\n“I stand before you a free man and I want you to remember me this way, with my head held up high,” Abrego Garcia said through a translator. “I come here today with so much hope and I thank God who has been with me since the start with my family.”\n\nHe urged people to keep fighting.\n\nAfter Abrego Garcia spoke, he went through security at the field office, escorted by supporters.\n\nWhen Abrego Garcia’s attorney, Simon Sandoval-Moshenberg, announced to the crowd assembled outside that his client would walk back out the field office’s doors again, he stressed that the legal fight was not over.\n\n“Yesterday’s order from Judge Xinis and now the temporary restraining order this morning represent a victory of law over power,” Sandoval-Moshenberg said.\n\nThe agency freed him just before 5 p.m. on Thursday in response to a ruling from Xinis, who wrote federal authorities detained him after his return to the United States without any legal basis.\n\nAbrego Garcia is a Salvadoran citizen with an American wife and child who has lived in Maryland for years. He immigrated to the U.S. illegally as a teenager to join his brother, who had become a U.S. citizen. In 2019, an immigration judge granted him protection from being deported back to his home country, where he faces danger from a gang that targeted his family.\n\nWhile he was allowed to live and work in the U.S. under ICE supervision, he was not given residency status. Earlier this year, he was mistakenly deported and held in a notoriously brutal Salvadoran prison despite having no criminal record.\n\nFacing mounting public pressure and a court order, President Donald Trump’s Republican administration brought him back to the U.S. in June, but only after issuing an arrest warrant on human smuggling charges in Tennessee. He has pleaded not guilty to those charges and asked a federal judge there to dismiss them.\n\nThe 2019 settlement found he had a “well founded fear” of danger in El Salvador if he was deported there. So instead ICE has been seeking to deport him to a series of African countries. Abrego Garcia has sued, claiming the Trump administration is illegally using the removal process to punish him for the public embarrassment caused by his deportation.\n\nIn her order releasing Abrego Garcia, Xinis wrote that federal authorities “did not just stonewall” the court, “They affirmatively misled the tribunal.” Xinis also rejected the government’s argument that she lacked jurisdiction to intervene on a final removal order for Abrego Garcia, because she found no final order had been filed.\n\nICE freed Abrego Garcia from Moshannon Valley Processing Center, about 115 miles (185 kilometers) northeast of Pittsburgh, on Thursday just before the deadline Xinis gave the government to provide an update on Abrego Garcia’s release.\n\nHe returned home to Maryland a few hours later.\n\nCheck-ins are how ICE keeps track of some people who are released by the government to pursue asylum or other immigration cases as they make their way through a backlogged court system. The appointments were once routine but many people have been detained at their check-ins since the start of Trump’s second term.\n\nThe Department of Homeland Security sharply criticized Xinis’ order and vowed to appeal, calling the ruling “naked judicial activism” by a judge appointed during the Obama administration.\n\n“This order lacks any valid legal basis, and we will continue to fight this tooth and nail in the courts,” said Tricia McLaughlin, the department’s assistant secretary.\n\nSandoval-Moshenberg said the judge made it clear that the government can’t detain someone indefinitely without legal authority.\n\nAbrego Garcia has also applied for asylum in the U.S. in immigration court.\n\nAbrego Garcia was hit with human smuggling and conspiracy to commit human smuggling charges when the U.S. government brought him back from El Salvador. Prosecutors alleged he accepted money to transport within the United States people who were in the country illegally.\n\nThe charges stem from a 2022 traffic stop in Tennessee for speeding. Body camera footage from a Tennessee Highway Patrol officer shows a calm exchange with Abrego Garcia. There were nine passengers in the car, and the officers discussed among themselves their suspicions of smuggling. However, Abrego Garcia was eventually allowed to continue driving with only a warning.\n\nA Department of Homeland Security agent testified at an earlier hearing that he did not begin investigating the traffic stop until after the U.S. Supreme Court said in April that the Trump administration must work to bring back Abrego Garcia.\n\n___\n\nAssociated Press writer Claudia Lauer in Philadelphia contributed to this report.",
      "scrapedAt": "2025-12-12T22:50:01.353Z",
      "success": true,
      "origin": "apNewsUS"
    },
    {
      "url": "https://www.yahoo.com/news/articles/us-invalidates-union-contract-covering-220523734.html",
      "title": "US invalidates union contract covering 47,000 TSA officers",
      "excerpt": "WASHINGTON, Dec 12 (Reuters) - U.S. Homeland Security Secretary Kristi Noem on Friday terminated the collective bargaining agreement covering 47,000...",
      "category": "us",
      "body": "WASHINGTON, Dec 12 (Reuters) - U.S. Homeland Security Secretary ​Kristi Noem on ‌Friday terminated the collective bargaining ‌agreement covering 47,000 Transportation Security Administration officers.\n\nThe American Federation of Government Employees, ⁠which ‌represents the airport screening officers, said it ‍will file suit to challenge the decision.\n\nIn June, a ​U.S. judge issued ‌a preliminary injunction blocking Noem’s March 7 attempt to end the collective bargaining agreement. DHS said ⁠it will ​implement a new ​labor framework on January 11 and will ‍no ⁠longer be collecting union dues from TSA officers' ⁠paychecks.\n\n(Reporting by David Shepardson ‌in Washington; Editing by ‌Chris Reese)",
      "scrapedAt": "2025-12-12T22:50:03.988Z",
      "success": true,
      "origin": "yahooUSNews"
    },
    {
      "url": "https://apnews.com/article/trump-thailand-cambodia-ceasefire-clashes-8c7dd464da0c8914e07c7e1146a9ce8c",
      "title": "Thai and Cambodian leaders agree to renew a ceasefire after days of deadly clashes, Trump says",
      "excerpt": "President Donald Trump says Thai and Cambodian leaders have agreed to renew a truce after days of deadly clashes threatened to undo a ceasefire he helped broker earlier this year. Trump announced the agreement to restart the ceasefire in a social media posting Friday following calls with Thai Prime Minister Anutin Charnvirakul and Cambodian Prime Minister Hun Manet. Thai and Cambodian officials have offered no immediate comment. The original ceasefire in July was brokered by Malaysia and pushed through by pressure from Trump, who threatened to withhold trade privileges unless Thailand and Cambodia agreed. Despite the deal, the two countries carried on a bitter propaganda war and minor cross-border violence continued.",
      "category": "world",
      "body": "WASHINGTON (AP) — President Donald Trump said on Friday that Thai and Cambodian leaders have agreed to renew a truce after days of deadly clashes had threatened to undo a ceasefire the U.S. administration had helped broker earlier this year.\n\nTrump announced the agreement to restart the ceasefire in a social media posting following calls with Thai Prime Minister Anutin Charnvirakul and Cambodian Prime Minister Hun Manet.\n\n“They have agreed to CEASE all shooting effective this evening, and go back to the original Peace Accord made with me, and them, with the help of the Great Prime Minister of Malaysia, Anwar Ibrahim,” Trump said in his Truth Social posting.\n\nThai and Cambodian officials offered no immediate comment following Trump’s announcement. Anutin, after speaking with Trump but before the U.S. president’s social media posting, said he reiterated to Trump that Thailand’s position was to keep fighting until Cambodia no longer poses a threat to its sovereignty.\n\nTrump, a Republican, said that Ibrahim played an important role in helping him push Thailand and Cambodia to once again agree to stop fighting.\n\n“It is my Honor to work with Anutin and Hun in resolving what could have evolved into a major War between two otherwise wonderful and prosperous Countries!” Trump added.\n\nStay up to date with the news and the best of AP by following our WhatsApp channel.\n\nThe original ceasefire in July was brokered by Malaysia and pushed through by pressure from Trump, who threatened to withhold trade privileges unless Thailand and Cambodia agreed. It was formalized in more detail in October at a regional meeting in Malaysia that Trump attended.\n\nDespite the deal, the two countries carried on a bitter propaganda war and minor cross-border violence continued.\n\nThe roots of the Thai-Cambodian border conflict lie in a history of enmity over competing territorial claims. These claims largely stem from a 1907 map created while Cambodia was under French colonial rule, which Thailand maintains is inaccurate. Tensions were exacerbated by a 1962 International Court of Justice ruling that awarded sovereignty to Cambodia, which still riles many Thais.\n\nThailand has deployed jet fighters to carry out airstrikes on what it says are military targets. Cambodia has deployed BM-21 rocket launchers with a range of 30-40 kilometers (19-25 miles).\n\nAccording to data collected by public broadcaster ThaiPBS, at least six of the Thai soldiers who were killed were hit by rocket shrapnel.\n\nThe Thai army’s northeastern regional command said Thursday that some residential areas and homes near the border were damaged by BM-21 rocket launchers from Cambodian forces.\n\nThe Thai army also said it destroyed a tall crane atop a hill held by Cambodia where the centuries-old Preah Vihear temple is located, because it allegedly held electronic and optical devices used for military command and control purposes.\n\nTrump has repeatedly made the exaggerated claim that he has helped solve eight conflicts, including the one between Thailand and Cambodia, since returning to office in January, as evidence of his negotiating prowess. And he’s not been shy about his desire to be recognized with a Nobel Peace Prize.\n\nIn an exchange with reporters on Wednesday, he expressed confidence that he could get the two sides back to a truce.\n\n“Every once in a while,” Trump said, “one will flame up again and I have to put out that little flame.”\n\nAnother ceasefire that Trump takes credit for working out, between the Democratic Republic of Congo and Rwanda, is also under strain — just after the leaders of the African nations traveled to Washington to sign a peace deal.\n\nA joint statement released by the International Contact Group for the Great Lakes expressed “profound concern” over the situation in Congo’s South Kivu region, where new deadly violence blamed on the Rwandan-backed M23 militia group has exploded in recent days.\n\nThe Great Lakes contact group — which includes Belgium, Britain, Denmark, France, Germany, the Netherlands, Sweden, Switzerland, the United States and the European Union — has urged all sides “to uphold their commitments” under the deal signed last week and “immediately de-escalate the situation.”\n\nAnd Trump’s internationally endorsed plan to end the Israel-Hamas war in Gaza is still not finalized and in limbo, with sporadic fighting continuing while a critical second phase remains a work in progress.\n\n___\n\nAP writers Jintamas Saksornchai in Buriram, Thailand, Grant Peck in Bangkok and Matthew Lee contributed reporting.",
      "scrapedAt": "2025-12-12T22:50:04.323Z",
      "success": true,
      "origin": "apNewsWorld"
    },
    {
      "url": "https://www.yahoo.com/news/articles/us-treasury-lifts-sanctions-brazil-214615042.html",
      "title": "US Treasury lifts sanctions on Brazil Supreme Court justice",
      "excerpt": "The US Treasury Department lifted sanctions Friday on Brazil Supreme Court Justice Alexandre de Moraes, who oversaw a trial of his country's jailed former...",
      "category": "world",
      "body": "The US Treasury Department lifted sanctions Friday on Brazil Supreme Court Justice Alexandre de Moraes, who oversaw a trial of his country's jailed former president Jair Bolsonaro.\n\nThe sanctions were part of a series of punitive actions taken against Brazil by the administration of President Donald Trump, a longtime ally of Bolsonaro who had slammed the trial as a \"witch hunt.\"\n\nMoraes was sanctioned in July and Washington took aim at his wife Viviane Barci de Moraes a few months later.\n\nThe sanctions against the couple and a company linked to their family were eased after efforts to repair diplomatic ties between Brazil and the US, in a blow to Bolsonaro and his family who had lobbied hard for the measures.\n\nA senior official from Trump's administration told AFP that \"continued designation is inconsistent with US foreign policy interests.\"\n\nAfter months of animosity, Trump and Brazil's President Luiz Inacio Lula da Silva held their first official meeting in October, leading to a flurry of negotiations between diplomats.\n\nAs ties improved, the Trump administration last month exempted key Brazilian exports from a 40-percent tariff that had been imposed over the trial.\n\n-- Lobbying --\n\nTies between the US and Brazil had soured even before the Bolsonaro trial, as Moraes oversaw efforts to regulate social media platforms and temporarily blocked Elon Musk's X platform and social media accounts popular with conservative voices.\n\nIn imposing the sanctions earlier this year, US Treasury Secretary Scott Bessent said Moraes had \"taken it upon himself to be judge and jury in an unlawful witch hunt against US and Brazilian citizens and companies.\"\n\nBolsonaro began serving a 27-year jail term in November after his conviction for a scheme to stop Lula from taking office after the 2022 elections.\n\nHis son Eduardo, a federal lawmaker, moved to the United States earlier this year after months of jetting back and forth from Brazil to lobby for sanctions against judicial officials.\n\nHe has since been charged for the crime of \"coercion\" for his alleged efforts to sway the outcome of the coup trial against his father.\n\nIn a statement on social media, Eduardo said the decision to lift the sanctions on Moraes was received \"with regret.\"\n\nHe said a \"lack of internal cohesion and the insufficient support for initiatives conducted abroad contributed to the worsening of the current situation.\"\n\n\"We are grateful for the support that President Trump has shown throughout this journey and for the attention he dedicated to the serious crisis of freedoms afflicting Brazil.\"\n\nOn Friday, the senior Trump administration official welcomed the passing of a bill by Brazil's chamber of deputies -- which is dominated by Bolsonaro supporters -- that could slash the former president's prison sentence considerably.\n\nbys/mlm-fb/ksb",
      "scrapedAt": "2025-12-12T22:50:05.889Z",
      "success": true,
      "origin": "yahooWorldNews"
    },
    {
      "url": "https://apnews.com/article/republican-house-health-care-plan-obamacare-subsidies-208b30670d0486c8d27ceb59c59003e0",
      "title": "Speaker Johnson scrambles to find a health care plan as Republicans remain divided",
      "excerpt": "The Senate failed to get anywhere on health care this week. Now it’s the House’s turn. Speaker Mike Johnson is rushing to compile a package of bills to address growing health care costs. The House legislation is not expected to include an extension of enhanced tax credits that make health insurance more affordable in the Affordable Care Act marketplace. Those tax breaks are expiring at the end of this year. Johnson said Republicans' goal is to reduce premiums for all Americans, not just those enrolled in Obamacare plans. But going Johnson’s route has left vulnerable House Republicans representing key battleground districts in a tough spot.",
      "category": "politics",
      "body": "WASHINGTON (AP) — The Senate failed to get anywhere on the health care issue this week. Now it’s the House’s turn to show what it can do.\n\nSpeaker Mike Johnson is in a last-minute sprint to develop a Republican alternative, as his party refuses to extend tax subsidies for those who buy policies through the Affordable Care Act, also called Obamacare, which are expiring at the end of the year. Those subsidies help lower the cost of coverage.\n\nJohnson, R-La., huddled behind closed doors Friday morning — as he did days earlier this week — working to assemble a package for consideration as the House focuses the final days of its 2025 work on health care.\n\n“We’re making final decisions,” said Majority Leader Steve Scalise, R-La. “We have a couple more conversations to have, but we’re getting close.”\n\nTime is running out for Congress to act. Democrats engineered the longest federal government shutdown ever this fall in a failed effort to force Republicans to the negotiating table on health care. But after promising votes, the Senate failed this week to advance both a Republican health care plan and the Democratic-offered bill to extend the tax credits for three years.\n\nNow, with just days to go, Congress is about to wrap up its work with no solution in sight.\n\nPresident Donald Trump, speaking at a holiday party at the White House, said he believes Republicans are going to figure out a better plan than Obamacare — something he has promised for years — but he offered few details beyond his idea for providing Americans with stipends to help buy insurance.\n\n“I really believe we can work on healthcare together and come up with something that’s going to be much better, much less expensive for the people, less expensive for our nation,” Trump said at Thursday night’s reception.\n\nThe president touted his proposal for sending money directly to Americans to help offset the costs of health care policies, rather than extending the tax credits for those buying policies through Obamacare. It’s unclear how much money Trump envisions. The Senate GOP proposal that failed to advance would have provided payments to new health savings accounts of $1,000 a year for adult enrollees, or $1,500 for those ages 50 to 64.\n\n“We make beautiful, big payments directly to the people and they buy their own health insurance,” Trump said.\n\nFinding consensus among rank-and-file Republicans is far from guaranteed, as the health care issue has long split the party.\n\nThe emerging package from the House Republicans is not expected to include an extension of an enhanced tax credit for millions of Americans who get insurance coverage through the Affordable Care Act. Put in place during the COVID-19 crisis, that enhanced subsidy expires Dec. 31, leaving most families in the program facing more than double their current out-of-pocket premiums, and in some cases, much more.\n\nJohnson told reporters the bill Republicans are pursuing would “reduce premiums for all Americans, not just 7% of them,” a reference to the 24 million enrolled in ACA plans.\n\nInstead, the GOP’s legislation would likely expand health savings accounts and association health plans, lawmakers said.\n\nThe latter would allow more small businesses and self-employed individuals to band together and purchase health coverage as part of an association. Proponents say such plans increase the leverage businesses have to negotiate a lower rate. But critics say the plans provide skimpier coverage than what is required under the Affordable Care Act.\n\nScalise said Republicans were also reviewing new restrictions for pharmacy benefit managers, or PBMs, which contract with insurers to administer their prescription drug benefits and help control costs. Critics say PBMs have enacted practices that pad their bottom line but have made it more difficult for independent pharmacists to survive.\n\nGoing Johnson’s route has left vulnerable House Republicans representing key battleground districts in a tough spot.\n\nFrustrated with the delays, a group of more centrist GOP lawmakers is aligning with Democrats to push their own proposals for continuing the tax credits, for now, so that Americans don’t face rising health care costs.\n\nThey are pursuing several paths for passing a temporary ACA subsidy extension, co-sponsoring a handful of bills. They are also signing onto so-called discharge petitions that could force a floor vote if a majority of the House signs on.\n\nSuch petitions are designed to get around the majority’s control and are rarely successful, but this year has proven to be an exception. Lawmakers, for example, were able to use a discharge petition to force a vote on the release of the Jeffrey Epstein files held by the Department of Justice.\n\nOne petition, filed by Rep. Brian Fitzpatrick, R-Pa., had signatures from 12 Republicans and 12 Democrats as of Friday afternoon. It would force a vote on a bill that includes a two-year subsidy extension and contains provisions designed to combat fraud in the ACA marketplace. There are also restrictions for PBMs, among other things.\n\nAnother petition from Rep. Josh Gottheimer, D-N.J., has 39 signatures and is broadly bipartisan. It’s a simpler proposal that would force a vote on a one-year ACA enhanced subsidy extension and would include new income caps limiting who qualifies for the enhanced credit.\n\nBoth discharge petitions have enough Republicans’ support that they would likely succeed if Democratic leader Hakeem Jeffries encouraged his caucus to jump on board. So far, he’s not tipping his hand.\n\n“We’re actively reviewing those two discharge petitions and we’ll have more to say about it early next week,” Jeffries said.\n\nMeanwhile, Jeffries is pushing Democrats’ own discharge petition, which has 214 signatures and would provide for a clean three-year subsidy extension. No Republicans have signed onto that one.\n\nAnd as Republicans made clear in the Senate this week, a three-year extension without changes to the program has no chance of passing their chamber.",
      "scrapedAt": "2025-12-12T22:50:06.979Z",
      "success": true,
      "origin": "apNewsPolitics"
    },
    {
      "url": "https://apnews.com/article/epstein-photos-released-democrats-trump-clinton-andrew-f256bd536bf4d2e63c37e59d50a65304",
      "title": "House Democrats release photos of Trump, Clinton and Andrew from Epstein’s estate",
      "excerpt": "House Democrats on the House Oversight Committee are releasing more photos received from the estate of Jeffrey Epstein. They include images of Epstein taking a bubble bath, a photo of him with a swollen lip, and a photo of him posing with a book about his scandal. The White House is accusing Democrats of “cherry-picking photos\" to create a false narrative about President Donald Trump. Republicans say nothing in the documents the House Oversight Committee has received shows “any wrongdoing” by Trump. The photos are among 95,000 the panel received from the estate of Epstein, who died in a New York jail cell in 2019 while awaiting trial on sex trafficking charges.",
      "category": "politics",
      "body": "WASHINGTON (AP) — House Democrats released a selection of photos from the estate of Jeffrey Epstein on Friday, including some of Donald Trump, Bill Clinton and the former Prince Andrew.\n\nThe 19 photos initially released by Democratic lawmakers on the House Oversight Committee were a small part of more than 95,000 they received from the estate of Epstein, who died in a New York jail cell in 2019 while awaiting trial on sex trafficking charges. They released roughly 70 more photos later Friday, including images of his home, Epstein taking a bath, a photo of him with a swollen lip, and a photo of him posing with a book about the scandal.\n\nThe photos released Friday were separate from the case files that the Department of Justice is now under compulsion to release, but anticipation is growing as the Trump administration faces a deadline next week to produce the Epstein files that have been the source of conspiracy theories and speculation for years.\n\nThe photos were released without captions or context and included a black-and-white image of Trump alongside six women whose faces were blacked out.\n\nRep. Robert Garcia, the top Democrat on the House Oversight Committee, did not say whether any of the women in the photos was a victim of abuse, but he added, “Our commitment from day one has been to redact any photo, any information that could lead to any sort of harm to any of the victims.”\n\nWhite House spokesperson Abigail Jackson accused Democrats of “selectively releasing cherry-picked photos with random redactions to try and create a false narrative” and called it part of a “Democrat hoax against President Trump.”\n\nMany of the photos have already circulated in the public. Democrats pledged to continue to release photos in the days and weeks ahead, as they look to pressure Trump over his Republican administration’s earlier refusal to release documents in the Epstein probe. Garcia said his staff had looked through about a quarter of the images it had received from Epstein’s estate, which included photos that were sent to him or that he had in his possession.\n\n“Donald Trump right now needs to release the files to the American public so that the truth can come out and we can actually get some sense of justice for the survivors,” Garcia added.\n\nTrump, once a close friend of Epstein, has said that he parted ways with him long before he faced the sex trafficking charges. Clinton, too, has minimized his relationship with Epstein, acknowledging that he traveled on Epstein’s private jet but saying through a spokesperson that he had no knowledge of the late financier’s crimes. Clinton also has never been accused of misconduct by Epstein’s known victims. However, Republicans on the House committee are pushing him and Hillary Clinton to testify in their investigation.\n\nA spokesperson for the Republican-controlled committee also said that nothing in the documents the committee has received shows “any wrongdoing” by Trump.\n\nAndrew lost his royal titles and privileges this year amid new revelations of his ties to Epstein, though he has denied wrongdoing.\n\nThe photo release also included images of the right-wing political operative Steve Bannon, billionaires Richard Branson and Bill Gates, filmmaker Woody Allen, former Treasury Secretary Larry Summers and law professor Alan Dershowitz. The men have denied any wrongdoing in their associations with Epstein, who kept many high-profile figures in his circle of friends.\n\nAmid an earlier release of emails between Summers and Epstein, Summers stepped away from his teaching position at Harvard University and faced other fallout to his standing in academic circles.\n\nAllen has faced allegations from his adopted daughter, Dylan Farrow, of molesting her as a child. He has denied the allegations.\n\nSome lawmakers, however, believe that other high-powered figures could be implicated in Epstein’s abuse if the full case files from the Justice Department are released.\n\nRep. Thomas Massie, a Kentucky Republican who was instrumental in passing a bill to require the public release of the files, said it was a good sign that the Department of Justice has sought to have grand jury material released from several courts.\n\n“The grand jury material is just a small fraction of what the DOJ needs to release, because the FBI and DOJ probably has evidence that they chose not to take to the grand jury because the evidence they’re in possession of would implicate other people, not Epstein or Maxwell,” he said.\n\n___\n\nFollow the AP’s coverage of Jeffrey Epstein at https://apnews.com/hub/jeffrey-epstein.",
      "scrapedAt": "2025-12-12T22:50:07.120Z",
      "success": true,
      "origin": "apNewsPolitics"
    },
    {
      "url": "https://apnews.com/article/poll-economy-inflation-groceries-costs-trump-affordability-d27635d279b27e5e2c19700c006ebb1d",
      "title": "This holiday season isn’t very merry for consumers, an AP-NORC poll finds",
      "excerpt": "A new AP-NORC poll finds this holiday season isn’t quite so merry for American shoppers as large shares of them are dipping into savings, scouring for bargains and feeling like the overall economy is stuck in a rut under President Donald Trump. The vast majority of U.S. adults say they’ve noticed higher than usual prices for groceries, electricity and holiday gifts. Roughly half of Americans say it’s harder than usual to afford the things they want to give as holiday gifts. It’s a sobering assessment for the Republican president, who returned to the White House in large part by promising to lower prices.",
      "category": "business",
      "body": "WASHINGTON (AP) — This holiday season isn’t quite so merry for American shoppers as large shares are dipping into savings, scouring for bargains and feeling like the overall economy is stuck in a rut under President Donald Trump, a new AP-NORC poll finds.\n\nThe vast majority of U.S. adults say they’ve noticed higher than usual prices for groceries, electricity and holiday gifts in recent months, according to the survey from The Associated Press-NORC Center for Public Affairs Research.\n\nRoughly half of Americans say it’s harder than usual to afford the things they want to give as holiday gifts, and similar numbers are delaying big purchases or cutting back on nonessential purchases more than they would normally.\n\nIt’s a sobering assessment for the Republican president, who returned to the White House in large part by promising to lower prices, only to find that inflation remains a threat to his popularity just as it did for Democrat Joe Biden’s presidency. The poll’s findings look very similar to an AP-NORC poll from December 2022, when Biden was president and the country was grappling with higher rates of inflation. Trump’s series of tariffs have added to inflationary pressures and generated anxiety about the stability of the U.S. economy, keeping prices at levels that many Americans find frustrating.\n\nThe president has insisted there is “no” inflation and the U.S. economy is booming, as he expressed frustration that the public feels differently.\n\n“When will people understand what is happening?” Trump said Thursday on Truth Social. “When will Polls reflect the Greatness of America at this point in time, and how bad it was just one year ago?”\n\nMost U.S. adults, 68%, continue to say the country’s economy is “poor,” which is unchanged from December 2024, before Trump returned to the presidency.\n\nWhite House officials plan to send Trump barnstorming across the country in hopes of bucking up people’s faith in the economy before next year’s midterm elections. But the president this week in Pennsylvania defended the price increases tied to his tariffs by suggesting that Americans should buy fewer dolls and pencils for children. His message is a jarring contrast with what respondents expressed in the poll, even among people who backed him in the 2024 election.\n\nSergio Ruiz, 44, of Tucson, Arizona, said he is using more buy now, pay later programs to spread out over time the expense of gifts for his children. He doesn’t put a huge emphasis on politics, but he voted for Trump last year and would like to see lower interest rates to help boost his real estate business. He believes that more Americans having higher incomes would help to manage any affordability issues.\n\n“Prices are up. What can you do? You need to make more money,” Ruiz said.\n\nThe poll found that when they do shop, about half of Americans are finding the lowest price more than they would normally. About 4 in 10 are dipping into their savings more than at other times.\n\nDemocrats are more likely than Republicans to say they’re cutting back on expenses or looking for low prices, but many Republicans are budgeting more than usual as well. About 4 in 10 Republicans are looking for low prices more than they usually would, while a similar share are shopping for nonessential items less than usual.\n\nPeople felt similarly dismal about holiday shopping and the economy when Biden was president in 2022. Inflation had spiked to a four-decade high that summer. Three years later, inflation has eased substantially, but it’s still running at 3%, a full percentage point above the Federal Reserve’s target as the job market appears to have entered a deep freeze.\n\nThe survey indicates that it’s the level of prices — and not just the rate of inflation — that is the point of pain for many families. Roughly 9 in 10 U.S. adults, 87%, say they’ve noticed higher than usual prices for groceries in the past few months, while about two-thirds say they’ve experienced higher prices than usual for electricity and holiday gifts. About half say they’ve seen higher than normal prices for gas recently.\n\nThe findings on groceries and holiday gifts are only slightly lower than in the 2022 poll, despite the slowdown from an inflation rate that hit a four-decade peak in the middle of that year.\n\nConsumer spending has stayed resilient despite the negative sentiments about the economy, yet Trump’s tariffs have caused changes for shoppers such as Andrew Russell.\n\nThe 33-year-old adjunct professor in Arlington Heights, Illinois, said he used to shop for unique gifts from around the globe and buy online. But with the tariffs, he got his gifts locally and “this year, I only bought things that I can pick up in person,” he said.\n\nRussell, who voted Democratic in last year’s election, said he worries about the economy for next year. He thinks the investment in artificial intelligence has become a bubble that could burst, taking down the stock market.\n\nFew people expect the situation to meaningfully improve next year — a sign that Trump has done little to instill much confidence from his mix of tariffs, income tax cuts and foreign trips to attract investments. Trump has maintained that the benefits from his policies will begin to snowball in 2026.\n\nAbout 4 in 10 U.S. adults expect next year will be economically worse for the country. Roughly 3 in 10 say conditions won’t change much. Only about 2 in 10 think things will get better, with Republicans being more optimistic.\n\nThe belief that things will get better has slipped from last year, when about 4 in 10 said that 2025 would be better than 2024.\n\nMillicent Simpson, 56, of Cleveland, Ohio, said she expects the economy to be worse for people like her who rely on Medicaid for health care and the Supplemental Nutrition Assistance Program. Simpson voted Democratic last year and blames Trump for the greater economic pressures that she faces going into the winter.\n\n“He’s making it rough for us,” she said. “He’s messing with the government assistance for everybody, young and old.”\n\n___\n\nThe AP-NORC poll of 1,146 adults was conducted Dec. 4-8 using a sample drawn from NORC’s probability-based AmeriSpeak Panel, which is designed to be representative of the U.S. population. The margin of sampling error for adults overall is plus or minus 4 percentage points.",
      "scrapedAt": "2025-12-12T22:50:08.157Z",
      "success": true,
      "origin": "apNewsBusiness"
    }
  ]
}