{
  "runId": "run3",
  "processedAt": "2025-12-15T20:47:53.737Z",
  "totalArticles": 2,
  "articles": [
    {
      "original": {
        "url": "https://apnews.com/article/brown-university-shooting-investigation-b08f1fdf5e71542f6e93bbba05fa043c",
        "title": "Search for the Brown University shooter resumes as questions swirl about campus security",
        "excerpt": "Authorities are again searching for the person seen in grainy video walking away from the Brown University shooting that killed two students and injured nine. Officials said late Sunday that they released a person of interest they had detained earlier in the day, finding no reason to keep him in custody. This setback left law enforcement without a known suspect. The shooting happened Saturday during a busy time on campus, causing chaos and a lockdown. The gunman fired more than 40 rounds inside a classroom. The victims included a sophomore who was vice president of the Brown College Republicans and a freshman whose family immigrated to the U.S. from Uzbekistan.",
        "category": "us",
        "body": "PROVIDENCE, R.I. (AP) — Authorities knocked on doors Monday searching for any video there might be of the Brown University gunman, who could be seen in grainy footage walking away from the weekend attack that killed two students and wounded nine others.\n\nPolice renewed their search after releasing a person of interest Sunday once they determined the evidence pointed in a different direction. Meanwhile, details began to emerge about the students who were killed.\n\nThe abrupt announcement marked a setback in the investigation of Saturday’s attack at the Ivy League school. Questions were mounting about campus security, the apparent lack of video evidence and whether the focus on the person of interest gave the killer more time to escape justice.\n\nPeople hold candles during a vigil, Sunday, Dec. 14, 2025, in Providence, R.I., for those injured or killed during the Saturday shooting on Brown University campus. (AP Photo/Steven Senne)\n\nProvidence residents and students were relieved early Sunday when officials said they had detained a man at a Rhode Island hotel in connection with the attack and lifted the lockdown. But that relief was short-lived, as Mayor Brett Smiley said hours later that investigators didn’t know whether the gunman was still in the area.\n\nColin Moussette, who has friends at Brown and is considering enrolling next fall, said while visiting the campus Monday that he felt uneasy knowing that the suspect has not been caught.\n\nThe United States flag flies at half-staff as a sign of mourning for the victim’s of Saturday’s shooting, on the campus of Brown University, Monday, Dec. 15, 2025, in Providence, R.I. (AP Photo/Robert F. Bukaty)\n\n“How someone got away, like in the middle of the day is, to me, not only heartbreaking but very concerning,” he said. “How they got access to the building is concerning.”\n\nStay up to date with the news and the best of AP by following our WhatsApp channel.\n\nProvidence police on Monday released a second video showing someone dressed in all black walking along a city street minutes after the shooting. The video — like an earlier one released the day of the shooting — did not show the suspect’s face.\n\nIn a neighborhood near the university, a line of officers scraped their feet through a snow-covered yard looking for evidence. Meanwhile, agents identifying themselves as U.S. marshals asked locals if they had security cameras, one resident said.\n\nThe shooting happened in an auditorium-style classroom where students in a study group were preparing for an upcoming exam.\n\nElla Cook, a 19-year-old sophomore who was vice president of the Brown College Republicans and beloved in her church in Birmingham, Alabama, was one of the students killed, according to her pastor at home.\n\nIn announcing her death Sunday, the Rev. R. Craig Smalley described Cook as “an incredible grounded, faithful, bright light” who encouraged and “lifted up those around her.”\n\nPeople gather at near makeshift memorial on the campus of Brown University, not far from the scene of the shooting, Monday, Dec. 15, 2025, in Providence, R.I. (AP Photo/Robert F. Bukaty)\n\n“Ella was known for her bold, brave, and kind heart as she served her chapter and her fellow classmates,” Martin Bertao, the president of the club, said in a message posted on X.\n\nThe other student who was killed was MukhammadAziz Umurzokov, an 18-year-old freshman majoring in biochemistry and neuroscience. He was helping a friend at a review session for an economics final when he was fatally shot, his sister said.\n\nAs a child, Umurzokov suffered a neurological condition that required surgery, and he later wore a back brace because of scoliosis, said Samira Umurzokova, noting that the family immigrated to the U.S. from Uzbekistan when she, her brother and sister were young.\n\n“He had so many hardships in his life, and he got into this amazing school and tried so hard to follow through with the promise he made when was 7 years old,” she told the AP by phone Monday.\n\nPassers-by walk past crime scene tape at an entrance to Brown University, Sunday, Dec. 14, 2025, in Providence, R.I., following the Saturday, Dec. 13, shooting at the university. (AP Photo/Steven Senne)\n\nThe release of the person of interest, who was taken into custody early Sunday at a hotel outside of Providence, left law enforcement without a known suspect.\n\n“We have a murderer out there,” state Attorney General Peter Neronha said.\n\nA police vehicle is parked at an intersection near crime scene tape at Brown University, Sunday, Dec. 14, 2025, in Providence, R.I., following a Saturday shooting at the university. (AP Photo/Steven Senne)\n\nAuthorities said one of the reasons they lacked video of the shooter was because Brown’s engineering building doesn’t have many cameras.\n\nProvidence was no longer on lockdown and the city’s schools were open Monday. But some colleges and universities, including in Rhode Island and some Ivy League schools, were increasing security in light of the attack. Yale said extra security would be in place for Hanukkah celebrations.\n\nProvidence and Brown University community members gather during a vigil at Lippitt Memorial Park, a day after a shooting occurred on Brown University campus. Sunday, Dec. 14, 2025, in Providence, R.I. (Lily Speredelozzi/The Sun Chronicle via AP)\n\nThe shooting occurred as final exams were underway at Brown, one of the nation’s oldest and most prestigious schools.\n\nInvestigators were not immediately sure how the shooter got inside the first-floor classroom.\n\nThe attack set off hours of chaos on campus and in the surrounding neighborhoods, as hundreds of officers searched for the shooter. Many students barricaded their rooms and hid behind furniture and bookshelves.\n\nLi Ding, a Rhode Island School of Design student who is on a dance team at Brown, was upset that there wasn’t better security on campus.\n\n“The fact that we’re in such a surveillance state but that wasn’t used correctly at all is just so deeply frustrating,” Ding said.\n\nOne of the nine wounded students was released from the hospital, Brown President Christina Paxson said Sunday. Seven others were in critical but stable condition, and one was in critical condition.\n\nA makeshift memorial is seen on the campus of Brown University, close to from the scene of the shooting, Monday, Dec. 15, 2025, in Providence, R.I. (AP Photo/Robert F. Bukaty)\n\nThe mayor said he visited some wounded students and was inspired by their courage. “The resilience that these survivors showed and shared with me, is frankly pretty overwhelming,” Smiley said.\n\nA bouquet of flowers rests on snow, Sunday, Dec. 14, 2025, on the campus of Brown University not far from where a shooting took place, in Providence, R.I. (AP Photo/Steven Senne)\n\n___\n\nContributing were Associated Press journalists Jennifer McDermott and Matt O’Brien in Providence; Michael Casey in Boston; Patrick Whittle in Portland, Maine; John Seewer in Toledo, Ohio; Kathy McCormack in Concord, New Hampshire; and Heather Hollingsworth in Mission, Kansas.",
        "scrapedAt": "2025-12-15T20:46:31.968Z",
        "success": true,
        "origin": "apNewsUS"
      },
      "processed": {
        "title": "Search for Brown University Shooter Continues Amid Campus Security Concerns",
        "tickerTitle": "Brown University",
        "excerpt": "Authorities are actively seeking the individual captured in footage walking away from a shooting at Brown University that resulted in two fatalities and nine…",
        "category": "us",
        "body": "Providence, R.I. - Police continued their investigation Monday, asking for any available video footage related to the Brown University shooting that occurred over the weekend, which left two students dead and nine others injured. This renewed search came after authorities released a previously detained person of interest, determining that further evidence suggested a different direction in the case. The incident has raised significant concerns regarding campus security and the availability of surveillance footage, as witnesses expressed fears about how the shooter managed to flee amidst the chaos.\n\nThe shooting took place in a classroom setting during a busy Saturday afternoon, with more than 40 rounds fired. Among the deceased were Ella Cook, a sophomore and vice president of the Brown College Republicans, and MukhammadAziz Umurzokov, an 18-year-old freshman studying biochemistry and neuroscience.\n\nThe investigation is further complicated by a lack of video recordings within the engineering facility, which has prompted criticisms regarding safety measures in place at the university. As the immediate lockdown was lifted, some surrounding institutions boosted their security protocols, while students and community members expressed unease about the events that had unfolded, questioning how such violence could occur in broad daylight without the assailant being apprehended.",
        "imageKeyword": "Brown University",
        "tags": [
          "Elections",
          "Economy",
          "Congress"
        ],
        "image": {
          "url": "https://upload.wikimedia.org/wikipedia/commons/e/ed/Providence_looking_west_from_Brown_University_Sciences_Library.jpg",
          "source": "wikimedia",
          "sourcePageUrl": "https://commons.wikimedia.org/wiki/File:Providence_looking_west_from_Brown_University_Sciences_Library.jpg",
          "imageDescription": "A view of Providence from the west side of the 13th floor of the Sciences Library at Brown University.",
          "artist": "4300streetcar",
          "attribution": "Wikimedia Commons",
          "licenseShortName": "CC BY 4.0",
          "license": "CC BY 4.0",
          "authorName": "4300streetcar",
          "width": 8256,
          "height": 5504
        }
      }
    },
    {
      "original": {
        "url": "https://www.cbsnews.com/news/bondi-beach-shooting-victim-reuven-morrison-daughter-australia-no-home-for-jews/",
        "title": "Woman says dad died a hero throwing bricks at Bondi Beach attacker, and \"Australia's not a home for Jews anymore.\"",
        "excerpt": "Sheina Gutnick&#039;s dad came to Australia to escape persecution for his Jewish faith, and his murder in Bondi has left her feeling &quot;betrayed by the government.&quot;",
        "category": "world",
        "body": "Updated on:  December 15, 2025 / 1:27 PM EST\n            / CBS News\n\nThe daughter of one of the victims of Sunday's Bondi Beach terror attack told CBS News on Monday that her father was \"shot dead for being Jewish,\" and she now believes Australia is not a safe home for Jewish people.\n\nSheina Gutnick said that her father, Reuven Morrison, a 62-year-old Soviet-born member of the ultra-orthodox Jewish community in Australia, was killed while attempting to stop one of the two gunmen during Sunday's mass shooting, which Australian authorities have called an antisemitic terror attack.\n\n\"From my sources and understanding, he had jumped up the second the shooting started. He managed to throw bricks at the terrorist,\" Gutnick told CBS News in Bondi on Monday, referencing an attempt to stop one of the gunmen that was caught on camera during the attack the previous day.\n\nShe said it was her father seen trying to stop one of the assailants after another man, later identified as 43-year-old fruit seller Ahmed al Ahmed, confronted the suspect and wrestled a gun away from him.\n\n\"I believe after Ahmed managed to get the gun off the terrorist, my father had then gone to try and unjam the gun, to try and attempt shooting. He was screaming at the terrorist,\" she said. \"My dear father, Reuven Morrison was shot dead for being Jewish at a Hanukkah event on Bondi Beach while protecting lives, while jumping up, putting his own life at risk to save his fellow Jewish community members.\"\n\nDramatic social media video verified by CBS News Confirmed shows Morrison throwing objects at one of the suspected shooters after another man, confirmed by Australian authorities as Ahmed, tackled and disarmed him.\n\nGutnick recalled the devastating moment that she found out her father had been killed in the attack.\n\n\"As my family was exiting a Hanukkah event in Melbourne we heard news from a friend that there was a shooting happening in Sydney. I immediately felt the biggest pit in my stomach and tried calling my father who did not pick up the phone. I then called my mother and I heard screaming, shouting. She was screaming that there's an active shooter,\" Gutnick said. \"I called her back and she was yelling that he's running, he's running, and then that he has been shot. After a few more attempts of hanging up and calling back, my mother was yelling for medical assistance, screaming for an ambulance, screaming for help, asking for help ... she then advised that he's getting oxygen and hung up the phone.\"\n\nShe said she managed to get her mother back on the phone, \"and she was screaming that they had stopped working on him and that he had been covered by a sheet. I was hoping in her hysterical state that she was just being delusional and that wasn't the case.\"\n\nGutnick said that she believes Australia is no longer a safe country for the Jewish community, and she blamed the country's government, accusing leaders of failing to address a rising tide of antisemitism.\n\nAustralian police, \"lay on the ground in the grass covering their heads, untrained for this massacre, untrained for what's to come, untrained for what the Jewish community has been telling the Australian government is inevitable,\" Gutnick said, adding her voice to a chorus of criticism after a documented rise in hate attacks aimed at Australia's Jewish residents.\n\n\"Australia's not a home for Jews anymore. It can't be. If we are shot dead while celebrating our religious festival of lights, of pride, of celebrating who we are, and if we can't do that, Australia is not a house for us anymore. We can't be here,\" she added\n\nMorrison had fled the Soviet Union to escape antisemitic persecution five decades ago, Gutnick said, and said she was left with a sense of \"betrayal\" due to the manner of her father's death.\n\n\"He came to Australia because he thought that this would be safe,\" she said. \"This is where he was going to have a family, where he is going to live a life away from persecution.\"\n\n\"And for many years, he did do that — he lived a wonderful, free life —   until Australia turned on him.\"\n\n\"I feel betrayed by the government. I feel the signs were coming for a long, long time. The warning bells were there, and the government sat doing nothing.\"\n\n\"The Jewish community are hurting today,\" Australian Prime Minister Anthony Albanese told reporters Monday at a memorial on Bondi Beach. \"Today, all Australians wrap our arms around them and say, we stand with you. We will do whatever is necessary to stamp out antisemitism. It is a scourge, and we will eradicate it together.\"\n\nOne of the suspects, a father and son, was killed on Sunday, and the younger man —   who was investigated in 2019 over suspected links to extremism but deemed to not represent a threat —   remained hospitalized in a coma on Monday, Albanese said.\n\n\"People's circumstances can change,\" he told reporters before a cabinet meeting on Monday. \"People can be radicalized over a period of time. [Gun] Licences should not be in perpetuity.\"\n\n\"We are very much working through the background of both persons. At this stage, we know very little about them,\" New South Wales Police Commissioner Mal Lanyon said Monday.\n\nGutnick said that she would remember her father as a hero who \"went down fighting.\"\n\n\"He added so much light into the world. There was no human on Earth you could compare him to. If there was one way for him to go from this Earth, he would be fighting a terrorist. There was no other way he would have been taken from us,\" Gutnick said.\n\n© 2025 CBS Interactive Inc. All Rights Reserved.",
        "scrapedAt": "2025-12-15T20:46:33.270Z",
        "success": true,
        "origin": "cbsWorld"
      },
      "processed": {
        "title": "Daughter of Bondi Beach shooting victim claims father died a hero while confronting attacker",
        "tickerTitle": "Bondi Beach Attack",
        "excerpt": "Sheina Gutnick's father, a Jewish community member, was killed during a recent Bondi Beach terror attack, prompting her to question safety for Jews in…",
        "category": "world",
        "body": "Sheina Gutnick, the daughter of a victim of the Bondi Beach terror attack, stated in a CBS News interview that her father, Reuven Morrison, was 'shot dead for being Jewish.' Morrison, a 62-year-old from the ultra-orthodox Jewish community, was killed while bravely trying to thwart one of the gunmen. Australian authorities have classified the incident as an antisemitic terror attack. Gutnick recounted how her father leaped into action as the shooting began, reportedly throwing bricks at the attacker in an attempt to protect others. A video verified by CBS News supports her claim, showing Morrison confronting one of the assailants after another individual, identified as fruit seller Ahmed al Ahmed, disarmed the suspect. \n\nGutnick spoke about the traumatic moment she learned of her father's death. She described receiving a call from her mother during the incident, who was in distress, leading Sheina to fear the worst when she could not reach her father. After a series of calls, she was devastated to hear that medical assistance was no longer being provided. She expressed her belief that Australia has become unsafe for Jewish people, attributing this to governmental inaction regarding escalating antisemitism. \n\nThe outpouring of grief and outrage has sparked a national conversation about safety and the rise of hate crimes against Jewish individuals in Australia. Prime Minister Anthony Albanese addressed the situation, pledging support and action against antisemitism. One of the suspects in the incident has died, while another remains hospitalized, raising questions about their backgrounds and potential extremism. Gutnick honored her father as a hero and lamented the betrayal felt by her community, having believed Australia to be a safe haven from persecution.",
        "imageKeyword": "Bondi Beach",
        "tags": [
          "Australia",
          "Jewish",
          "Terrorism"
        ],
        "image": {
          "url": "https://upload.wikimedia.org/wikipedia/commons/f/f3/Bondi_Beach%2C_southwest_view_20230224_2.jpg",
          "source": "wikimedia",
          "sourcePageUrl": "https://commons.wikimedia.org/wiki/File:Bondi_Beach,_southwest_view_20230224_2.jpg",
          "imageDescription": "A southwest view of Bondi Beach",
          "artist": "DXR",
          "attribution": "Wikimedia Commons",
          "licenseShortName": "CC BY-SA 4.0",
          "license": "CC BY-SA 4.0",
          "authorName": "DXR",
          "width": 8021,
          "height": 4512
        }
      }
    }
  ]
}