{
  "runId": "run2",
  "collectedAt": "2025-12-03T21:02:15.733Z",
  "totalArticles": 9,
  "articles": [
    {
      "url": "https://apnews.com/article/new-orleans-louisiana-immigration-d0e4de8cd5bf9c7ca59ae38d803f93f2",
      "title": "Federal agents launch immigration crackdown in New Orleans",
      "excerpt": "The Department of Homeland Security is launching a new immigration crackdown in New Orleans. A Homeland Security official says the operation that got underway Wednesday targets violent criminals. The crackdown is the latest expansion of the Trump administration’s immigration sweeps that have unfolded in other U.S. cities. Immigration officials have blanketed big cities and small towns across the nation since January while carrying out President Donald Trump’s aggressive mass deportation efforts. In New Orleans, immigration lawyers say they have been inundated with calls and some businesses have posted signs barring federal agents from entry. Louisiana's Republican governor welcomes the crackdown.",
      "category": "us",
      "body": "NEW ORLEANS (AP) — Federal agents began hitting the streets of New Orleans on Wednesday in the Trump administration’s latest immigration crackdown across the U.S., looking to round up immigrants accused of violent crimes, a Homeland Security official said.\n\nThe operation is targeting immigrants who were released after arrests for crimes such as home invasion, armed robbery and rape, Homeland Security Department Assistant Secretary Tricia McLaughlin said in a statement.\n\nImmigration officials have blanketed big cities and small towns across the nation since January while carrying out Republican President Donald Trump ’s aggressive mass deportation efforts.\n\nFederal agents have launched high-profile immigration crackdowns in cities including Chicago and Charlotte, North Carolina. Another operation is expected in the coming days in Minnesota, targeting Somali immigrants. The enforcement tactics have been met with protests and lawsuits.\n\nThere are more than 200 Customs and Border Protection and U.S. Immigration and Customs Enforcement officials working on the New Orleans operation, according to a U.S. official who was not authorized to discuss the matter publicly. The objective is to make as many arrests as possible over at least 60 days.\n\nThe operation is being called “Catahoula Crunch,” continuing Homeland Security’s pattern of assigning region-specific names to the crackdowns. Planning documents obtained by the AP referred to the Louisiana operation as “Swamp Sweep.” The Catahoula leopard dog is Louisiana’s official state dog.\n\nFear and uncertainty have weighed heavy on the immigrant community in New Orleans — a one-of-a-kind American city known as the birthplace of jazz and for its Mardi Gras celebrations and rich blend of French, Spanish, African and Native American cultures.\n\nA witness saw federal agents chase down and arrest people in the parking lot of a New Orleans home improvement store Wednesday morning. “They tried to run across the street but they caught them,” said Jody Styles, who was at a gas station near the Lowe’s when authorities converged.\n\nSome businesses in heavily-Hispanic areas have shuttered, saying they will remain closed until the operation is over. Others businesses have signs on their doors barring federal immigration agents from entering.\n\nPosted on the door of Los Hondureños, a restaurant in nearby Kenner, was a handwritten note saying it was closing until further notice. It ended: “Thank you, The Hondurans.”\n\nTwenty years ago, New Orleans relied on thousands of Latino workers who helped rebuild after Hurricane Katrina. But it has not escaped the escalating tensions over immigration.\n\nEarlier this week, dozens of people took to the streets, despite rain and chilly temperatures, to protest the imminent crackdown. On Tuesday, more than 200 people filled a local church for a training on their legal rights and how to safely record federal immigration agents’ activity, including anticipated arrests.\n\nSome immigration lawyers say they have been inundated with calls from people trying to prepare for the federal crackdown.\n\nAs the operation began, residents took to social media, posting in neighborhood groups about the crackdown, including photos and addresses of possible sightings. Some desperately tried to decipher what information was accurate.\n\nLouisiana Gov. Republican Gov. Jeff Landry has singled out crimes in which the suspect’s immigration status is in question, such as the killing of a French Quarter tour guide by a group that included a Honduran man who entered the country illegally.\n\nThe Trump administration also has taken aim at the city’s immigration policies.\n\n“Sanctuary policies endanger American communities by releasing illegal criminal aliens and forcing DHS law enforcement to risk their lives to remove criminal illegal aliens that should have never been put back on the streets,” McLaughlin said.\n\nAttorney General Pam Bondi has accused New Orleans of undermining federal immigration enforcement. The Department of Justice includes New Orleans in a list of 18 cities it considers to be providing sanctuary to immigrants without legal status.\n\nNew Orleans officials deny the city’s policies thwart federal immigration enforcement. City police Chief Anne Kirkpatrick has said she considers immigration enforcement to be a civil matter outside her jurisdiction.\n\nLouisiana has been preparing for weeks for an immigration crackdown. The governor, a close Trump ally who has moved to align state policy with the White House’s enforcement agenda, said Wednesday that the crackdown will target the “worst of the worst, criminal illegal aliens that have broken the law.”\n\n“It started today and it’s going to run until we get them all off the street,” Landry said during an interview on the Walton & Johnson radio show.\n\nIn addition to the deployment of federal immigration agents, Landry said he expects National Guard members to arrive in New Orleans before Christmas to join the efforts to combat crime.\n\nThe immigration operation’s planning documents showed border agents intended to launch a monthslong crackdown in southeast Louisiana and into Mississippi.\n\nThe deployment, which aims to arrest 5,000 people, was expected to be led by the Border Patrol, whose agents have drawn scrutiny for aggressive tactics in other cities, including Chicago and Los Angeles.\n\nLouisiana State Police troopers and local FBI agents will work together to protect federal officers and stop attempts to block law enforcement actions during the crackdown, both agencies announced.\n\n___\n\nCline reported from Baton Rouge. Associated Press journalists Elliot Spagat in San Diego; John Seewer in Toledo, Ohio; and Stephen Smith in Kenner, Louisiana, contributed.\n\n___\n\nBrook is a corps member for The Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues.",
      "articleItem": {
        "title": "Federal agents launch immigration crackdown in New Orleans",
        "url": "https://apnews.com/article/new-orleans-louisiana-immigration-d0e4de8cd5bf9c7ca59ae38d803f93f2",
        "imageUrl": "https://dims.apnews.com/dims4/default/eca7b3f/2147483647/strip/true/crop/8640x5760+0+0/resize/567x378!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9b%2F83%2F0d01f5faf177b3e183c219f66d1b%2Fdd8e8c88f3ad4a5aac40b2da4338803e"
      },
      "scrapedAt": "2025-12-03T21:02:02.634Z",
      "success": true,
      "origin": "apNewsUS"
    },
    {
      "url": "https://www.cbsnews.com/news/trump-new-fuel-economy-standards-mpg-biden/",
      "title": "Trump administration moves to roll back fuel economy standards set under Biden",
      "excerpt": "The Trump administration proposed rules that would weaken fuel economy standards for vehicles set under President Biden in 2024.",
      "category": "us",
      "body": "Updated on:  December 3, 2025 / 3:59 PM EST\n            / CBS News\n\nThe Trump administration is proposing new fuel economy standards for vehicles that would roll back efficiency rules implemented under former President Biden.\n\nUnder the Transportation Department proposal, which was unveiled at a White House event on Wednesday, automakers would need to meet less stringent vehicle mileage requirements.\n\nFederal fuel economy rules are overseen by the National Highway Traffic Safety Administration (NHTSA) under what's known as the CAFE (Corporate Average Fuel Economy) Standards. Enacted by Congress in 1975, the regulations stipulate how many miles vehicles must be able to drive on a gallon of fuel, with specific standards for light-duty vehicles, as well as medium- and heavy-duty trucks.\n\nThe rules aim to reduce greenhouse gas emissions and help consumers save money on gas, according to the Transportation Department. Critics of the fuel standards have long argued they are costly for automakers, which must make technological improvements to reduce fuel usage, raising vehicle prices.\n\nIf finalized, the plan would relax fuel economy standards by setting the industry average for light-duty vehicles at roughly 34.5 miles per gallon through the 2031 model year, lower than the 50 miles per gallon outlined by a Biden-era rule.\n\n\"We're making it easier for every family to afford high-quality cars,\" President Trump said from the Oval Office.\n\nOn Wednesday, Transportation Secretary Sean Duffy said the previous rules drove up the cost of new cars and were \"completely unattainable\" for automakers. He initially directed NHTSA to review the CAFE regulations in January.\n\nMr. Trump was joined at Wednesday's event by senior auto industry executives. In a statement shared with CBS News, Stellantis CEO Antonioa Filosa expressed support for the proposed fuel efficiency rules, saying the initiative would realign the CAFE standards \"with real-world market conditions as part of its wider vision for a growing U.S. automotive industry.\"\n\nGeneral Motors also backed the proposed fuel economy standards, which would need to undergo an official rulemaking process before being adopted.\n\n\"GM supports the goals of NHTSA's proposed CAFE rule and its intention to better align fuel economy standards with market realities. We have long advocated for one national standard that upholds customer choice and provides the auto industry long-term stability,\" a spokesperson for the automaker said in a statement.\n\nThe fuel economy proposal would roll back a rule finalized in June 2024 under the Biden administration aimed at raising the minimum gas mileage for passenger cars and light trucks by model year 2031.\n\nAt the time, NHTSA said the new regulations would save Americans $23 billion at the gas pump and reduce pollution. Burning gas for vehicles is a major contributor to carbon emissions, which scientists have linked to climate change.\n\nThe rules were also intended to spur automakers to produce more electric vehicles, a key Biden administration priority for the nation's transportation sector.\n\nThe Center for Biological Diversity, a nonprofit organization that works to protect endangered species, said the Transportation Department proposal will increase the country's oil consumption and undermine the competitiveness of U.S. automakers.\n\n\"Trump's action will feed America's destructive use of oil, while hamstringing us in the green tech race against Chinese and other foreign carmakers,\" said Dan Becker, director of the Center for Biological Diversity's Safe Climate Transport Campaign.\n\nEdited by\n                                        \n                                  Alain  Sherter\n\nThe Associated  Press\n                  \n        contributed to this report.\n\n© 2025 CBS Interactive Inc. All Rights Reserved.",
      "articleItem": {
        "title": "Trump moves to roll back fuel economy standards set under Biden",
        "url": "https://www.cbsnews.com/news/trump-new-fuel-economy-standards-mpg-biden/",
        "imageUrl": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/12/03/1d0f2fc1-693c-4769-8b78-4c32e0856ef7/thumbnail/640x360/066e51b225e26308bc38da0f2e6ac212/gettyimages-2248020840.jpg#"
      },
      "scrapedAt": "2025-12-03T21:02:04.319Z",
      "success": true,
      "origin": "cbsUS"
    },
    {
      "url": "https://apnews.com/article/israel-palestinians-west-bank-gaza-hamas-hostages-1daaa29f923993fe794460309e73da80",
      "title": "Israel launches airstrike in southern Gaza after earlier attack by militants wounded 5 soldiers",
      "excerpt": "Israel says it launched an airstrike in southern Gaza in retaliation for an attack by militants earlier in the day that wounded five Israeli soldiers. Israel also has received remains in Gaza of a possible hostage and says it will begin allowing Palestinians to leave the war-torn territory through a border crossing with Egypt. The remains will be examined to determine whether they belong to either of the two last hostages in Gaza. It was not immediately clear when the Gaza border crossing would be opened. Egypt wants Palestinians to immediately be able to return to Gaza through the crossing. Israel says it won't allow two-way crossings until all the Gaza hostages are returned.",
      "category": "world",
      "body": "JERUSALEM (AP) — Israel said it launched an airstrike in southern Gaza late Wednesday in retaliation for an attack by militants earlier in the day that wounded five Israeli soldiers.\n\nThe airstrikes were the latest test for a fragile ceasefire that has mostly held up since early October, despite claims of violations by both Israel and Hamas.\n\nEarlier Wednesday, Israel received remains of what could be one of the last hostages in Gaza and said it would begin allowing Palestinians to leave the war-torn territory through a border crossing with Egypt.\n\nIsrael has accused Hamas of ceasefire violations before launching previous waves of airstrikes. Strikes killed 104 people in late October and 33 people in late November, according to local health officials.\n\nTHIS IS A BREAKING NEWS UPDATE. AP’s earlier story follows below.\n\nJERUSALEM (AP) — Israel received remains of what could be one of the last hostages in Gaza on Wednesday and said it will begin allowing Palestinians to leave the war-torn territory through a border crossing with Egypt.\n\nIsraeli Prime Minister Benjamin Netanyahu said an attack by militants earlier in the day that wounded four Israeli soldiers in southern Gaza was a violation of the ceasefire and that Israel “will respond accordingly.”\n\nThe remains found by militants in northern Gaza were returned to Israel, where they will be examined by forensics experts. Remains militants handed over on Tuesday did not match either of the last two hostages in Gaza.\n\nThe return of all the hostages taken on the Oct. 7, 2023, attack that started the war is a key element of the first phase of the ceasefire that began in October. In exchange, Israel has been releasing Palestinian prisoners.\n\nUnder the terms of the ceasefire, the long-closed Rafah crossing is to be opened for medical evacuations and travel to and from Gaza. The World Health Organization says there are more than 16,500 sick and wounded people who need to leave Gaza for medical care.\n\nIsrael says it will open the Rafah crossing in coming days to allow Palestinians to exit from Gaza to Egypt. AP correspondent Naeun Kim reports.\n\nIt was not immediately clear when the border crossing would be opened, however.\n\nEgypt wants Palestinians to be able to return to Gaza through the crossing and says it would only be opened if movement is allowed both ways. Israel says Palestinians will not be able to return to Gaza through the crossing until the last hostages’ remains are returned from Gaza.\n\nOnce the last hostages’ remains are returned and Israel releases more Palestinian prisoners in exchange, the U.S.-backed ceasefire plan is supposed to advance to the next phases, which call for creating an international stabilization force, forming a technocratic Palestinian government and disarming Hamas.\n\nEarlier on Wednesday, Prime Minister Benjamin Netanyahu said forensic testing showed that partial remains returned by militants on Tuesday did not match either of the hostages still in Gaza. Palestinian militants later said they had found more remains in northern Gaza and turned them over to the Red Cross, which is acting as an intermediary.\n\nThe two hostage bodies still in Gaza are Israeli Ran Gvili and Thai national Sudthisak Rinthalak. Gvili was an Israeli police officer who helped people escape from the Nova music festival during the Oct. 7 attack and was killed fighting at another location. Sudthisak Rinthalak was an agricultural worker from Thailand who had been employed at Kibbutz Be’eri, one of the hardest-hit communities in the attack.\n\nA total of 31 workers from Thailand were abducted, the largest group of foreigners to be held in captivity. Most of them were released in the first and second ceasefires. The Thai Foreign Ministry has said in addition to the hostages, 46 Thais have been killed during the war.\n\nThe Israeli military body charged with facilitating aid to Gaza, COGAT, said Israel would coordinate with Egypt on the exit of Palestinians, under the supervision of a mission from the European Union.\n\nThose wishing to leave Gaza will require “Israeli security approval,” COGAT said.\n\nThe U.S. State Department’s Bureau of Near-Eastern Affairs, writing on X, cast the opening of the crossing as a measure that would afford “the most vulnerable Gazans” access to better medical care.\n\nPalestinians who want to leave Gaza will be able to move through Rafah if Egypt agrees to receive them, Israeli government spokesperson Shosh Bedrosian said. But the crossing won’t be open for Palestinians seeking to return to Gaza until all of the hostages in the territory are returned to Israel, she said.\n\nCiting an unnamed Egyptian official, Egypt’s State Information Service said, if an agreement is reached, the crossing will be opened for travel in both directions in accordance with the ceasefire plan advanced by U.S. President Donald Trump.\n\nEgypt fears that Palestinians allowed to leave Gaza might not be able to return.\n\nEgyptian President Abdel-Fattah el-Sissi has warned that Israel might prompt an exodus from Gaza as a way to permanently expel people and “eliminate the Palestinian cause” for statehood. More than 100,000 Palestinians that left Gaza after the war started, including those wounded in the conflict, have been living in Egypt, according to Egyptian authorities.\n\nThe Rafah crossing was sealed off in May 2024 when Israel’s military invaded the area. It was briefly opened in February this year as part of a previous ceasefire for the evacuation of sick and wounded Palestinians.\n\nIn the southern city of Rafah, four Israeli soldiers were injured, one seriously, after being attacked by militants who emerged from an underground tunnel, the Israeli military said. The military called the attack in an area under its control a violation of the ceasefire, and said it responded by returning fire.\n\nIn Gaza City, a Palestinian man was killed by Israeli fire, a hospital said, marking the latest reported Palestinian fatality in the territory.\n\nIsraeli forces shot the 46-year-old man in the Zeitoun neighborhood, according to the Al-Ahli hospital, which received the body. Israel’s military did not immediately respond to a request for comment.\n\nThe hospital said the man was shot while in the “safe zone,” which, under the terms of the ceasefire, is not controlled by the Israeli military. The Gaza Health Ministry says more than 360 Palestinians have been killed across Gaza since the ceasefire took effect on Oct. 11.\n\nTwenty living hostages and the remains of 26 others have been returned to Israel since the ceasefire began in early October.\n\nIsrael has been releasing 15 Palestinian bodies for the remains of each hostage as part of the ceasefire agreement. The Gaza Health Ministry said the total number of remains received so far is 330. Health officials in Gaza have said they have only been able to identify a fraction of the bodies handed over by Israel, and the process is complicated by a lack of DNA testing kits.\n\nThe exchanges have gone ahead even as Israel and Hamas have accused each other of violating other terms of the deal. Israeli officials have accused Hamas of handing over partial remains in some instances and staging the discovery of bodies in others.\n\nHamas has accused Israel of opening fire on civilians and restricting the flow of humanitarian aid into the territory.\n\nThe ceasefire aims to wind down the war that was triggered by the Hamas-led attack on southern Israel, which killed about 1,200 people and saw 251 taken hostage.\n\nThe Gaza Health ministry says the total Palestinian death toll from the war is over 70,100. The ministry does not distinguish between militants and civilians, though it says roughly half of those killed have been women and children. The ministry operates under the Hamas-run government. It is staffed by medical professionals and maintains detailed records viewed as generally reliable by the international community.\n\n___\n\nMagdy reported from Cairo. Abby Sewell contributed from Beirut.",
      "articleItem": {
        "title": "Israel launches airstrike in southern Gaza after earlier attack by militants wounded 5 soldiers",
        "url": "https://apnews.com/article/israel-palestinians-west-bank-gaza-hamas-hostages-1daaa29f923993fe794460309e73da80",
        "imageUrl": "https://dims.apnews.com/dims4/default/c0e660b/2147483647/strip/true/crop/8640x5760+0+0/resize/567x378!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F64%2Fb9%2F4d400def61c90686ea71b080c70a%2F7a90858f7250487d8daeb0ca233b5e80"
      },
      "scrapedAt": "2025-12-03T21:02:05.934Z",
      "success": true,
      "origin": "apNewsWorld"
    },
    {
      "url": "https://www.yahoo.com/news/articles/pentagon-watchdog-finds-hegseth-signal-184806181.html",
      "title": "Pentagon watchdog finds Hegseth’s use of Signal posed risk to US personnel, AP sources say",
      "excerpt": "The Pentagon’s watchdog found that Defense Secretary Pete Hegseth put U.S. personnel and their mission at risk when he used the Signal messaging app to...",
      "category": "world",
      "body": "WASHINGTON (AP) — The Pentagon’s watchdog found that Defense Secretary Pete Hegseth put U.S. personnel and their mission at risk when he used the Signal messaging app to convey sensitive information about a military strike against Yemen's Houthi militants, two people familiar with the findings said Wednesday.\n\nHegseth, however, has the ability to declassify material and the report did not find he did so improperly, according to one of the people familiar with the findings who spoke on condition of anonymity to discuss the information. That person also said the report concluded that Hegseth violated Pentagon policy by using his personal device for official business and it recommended better training for all Pentagon officials.\n\nHegseth declined to sit for an interview with the Pentagon's inspector general but provided a written statement, that person said. The defense secretary asserted that he was permitted to declassify information as he saw fit and only communicated details he thought would not endanger the mission.\n\nThe initial findings ramp up the pressure on the former Fox News Channel host after lawmakers had called for the independent inquiry into his use of the commercially available app. Lawmakers also just opened investigations into a news report that a follow-up strike on an alleged drug-smuggling boat in the Caribbean Sea in September killed survivors after Hegseth issued a verbal order to “kill everybody.\"\n\nHegseth defended the strike as emerging in the “fog of war,” saying he didn’t see any survivors but also “didn’t stick around” for the rest of the mission and that the admiral in charge “made the right call” in ordering the second strike. He also did not admit fault following the revelations that he discussed sensitive military plans on Signal, asserting that the information was unclassified.\n\nJournalist was added to a chat where sensitive plans were shared\n\nIn at least two separate Signal chats, Hegseth provided the exact timings of warplane launches and when bombs would drop — before the men and women carrying out those attacks on behalf of the United States were airborne.\n\nHegseth’s use of the app came to light when a journalist, Jeffrey Goldberg of The Atlantic, was inadvertently added to a Signal text chain by then-national security adviser Mike Waltz. It included Vice President JD Vance, Secretary of State Marco Rubio, Director of National Intelligence Tulsi Gabbard and others, brought together to discuss March 15 military operations against the Iran-backed Houthis.\n\nHegseth had created another Signal chat with 13 people that included his wife and brother where he shared similar details of the same strike, The Associated Press reported.\n\nSignal is encrypted but is not authorized for carrying classified information and is not part of the Pentagon’s secure communications network.\n\nHegseth previously has said none of the information shared in the chats was classified. Multiple current and former military officials have told the AP there was no way details with that specificity, especially before a strike took place, would have been OK to share on an unsecured device.\n\nThe review was delivered to lawmakers, who were able to review the report in a classified facility at the Capitol. A partially redacted version of the report was expected to be released publicly later this week.\n\nHegseth said he viewed the investigation as a partisan exercise and did not trust the inspector general, according to one of the people familiar with the report’s findings. The review had to rely on screenshots of the Signal chat published by the Atlantic because Hegseth could not provide more than a small handful of his Signal messages, the person said.\n\nWhen asked about the investigation in August, Pentagon press secretary Kingsley Wilson told reporters that \"we believe that this is a witch hunt and a total sham and being conducted in bad faith.”\n\nThe Pentagon did not immediately respond Wednesday to a request for comment.\n\nLawmakers had called for inspector general to investigate\n\nThe revelations sparked intense scrutiny, with Democratic lawmakers and a small number of Republicans saying Hegseth posting the information to the Signal chats before the military jets had reached their targets potentially put those pilots’ lives at risk. They said lower-ranking members of the military would have been fired for such a lapse.\n\nThe inspector general opened its investigation into Hegseth at the request of the Republican chairman of the Senate Armed Services Committee, Sen. Roger Wicker of Mississippi, and the committee’s top Democrat, Sen. Jack Reed of Rhode Island.\n\nSome veterans and military families also raised concerns, citing the strict security protocols they must follow to protect sensitive information.\n\nIt all ties back to the campaign against Yemen’s Houthis\n\nThe Houthi rebels had started launching missile and drone attacks against commercial and military ships in late 2023 in what their leadership had described as an effort to end Israel’s offensive against Hamas in the Gaza Strip. Their campaign greatly reduced the flow of trade through the Red Sea corridor, which typically sees $1 trillion of goods move through it annually.\n\nThe U.S.-led campaign against the Houthis in 2024 turned into the most intense running sea battle the Navy had faced since World War II.\n\nA ceasefire in the Israel-Hamas war had begun in January before falling apart in March. The U.S. then launched a broad assault against the Houthis that ended weeks later when Trump said they pledged to stop attacking ships. The latest Gaza ceasefire began in October.\n\nFollowing the disclosure of Hegseth’s Signal chat that included the Atlantic’s editor, the magazine released the entire thread in late March. Hegseth had posted multiple details about an impending strike, using military language and laying out when a “strike window” starts, where a “target terrorist” was located, the time elements around the attack and when various weapons and aircraft would be used in the strike. He mentioned that the U.S. was “currently clean” on operational security.\n\nHegseth told Fox News Channel in April that what he shared over Signal was “informal, unclassified coordinations, for media coordinations and other things.”\n\nDuring a congressional hearing in June, Hegseth was pressed multiple times by lawmakers over whether he shared classified information and if he should face accountability if he did.\n\nRep. Seth Moulton, a Massachusetts Democrat and Marine veteran, asked Hegseth whether he would hold himself accountable if the inspector general found that he placed classified information on Signal.\n\nHegseth would not directly say, only noting that he serves “at the pleasure of the president.”\n\n___\n\nAssociated Press writer Stephen Groves and Konstantin Toropin contributed to this report.",
      "articleItem": {
        "title": "WorldAssociated Press836Pentagon watchdog finds Hegseth’s use of Signal posed risk to US personnel, AP sources say",
        "url": "https://www.yahoo.com/news/articles/pentagon-watchdog-finds-hegseth-signal-184806181.html",
        "imageUrl": "https://s.yimg.com/lo/mysterio/api/B6FE17870C2149A2A1F7DE6AFE63C448C30D9F36455B2CDAAEBEF92F35B44784/subgraphmysterio/smartcrop_w1000_h562_faces;quality_95/https:%2F%2Fmedia.zenfs.com%2Fen%2Fap.org%2F943a14e0b1e97048687909967296a870"
      },
      "scrapedAt": "2025-12-03T21:02:06.888Z",
      "success": true,
      "origin": "yahooWorldNews"
    },
    {
      "url": "https://www.cbsnews.com/news/charles-shay-dies-d-day-veteran-saved-lives-dead-age-101/",
      "title": "Charles Shay, D-Day veteran who saved lives on Omaha Beach as a 19-year-old U.S. Army medic, dies at 101",
      "excerpt": "Charles Shay Shay was awarded the Silver Star for repeatedly plunging into the sea and carrying critically wounded soldiers to relative safety.",
      "category": "world",
      "body": "December 3, 2025 / 1:34 PM EST\n            / CBS/AP\n\nCharles Shay, a decorated Native American veteran who was a 19-year-old U.S. Army medic when he landed on Omaha Beach on D-Day and helped save lives, died on Wednesday. He was 101.\n\nShay died at his home in Bretteville-L'Orgueilleuse in France's Normandy region, his longtime friend and carer Marie-Pascale Legrand said.\n\nShay, of the Penobscot tribe and from Indian Island in the U.S. state of Maine, was awarded the Silver Star for repeatedly plunging into the sea and carrying critically wounded soldiers to relative safety, saving them from drowning. He also received France's highest award, the Legion of Honor, in 2007.\n\nShay had been living in France since 2018, not far from the shores of Normandy where nearly 160,000 troops from Britain, the U.S., Canada and other nations landed on D-Day on June 6, 1944. The Battle of Normandy hastened Germany's defeat, which came less than a year later.\n\n\"He passed away peacefully surrounded by his loved ones,\" Legrand told The Associated Press.\n\nShay told CBS News in 2019 that he moved to France to be close to his fallen brothers.\n\n\"I will die here,\" Shay told CBS News at the time. \"I believe that I can talk with the souls of the men that are still wandering on the beach here. And I just tried to assure them that they are not forgotten.\"\n\nThe Charles Shay Memorial group, which honors the memory of about 500 Native Americans who landed on the Normandy beaches, said in a statement posted on Facebook that \"our hearts are deeply saddened as we share that our beloved Charles Norman Shay … has returned home to the Creator and the Spirit World.\"\n\n\"He was an incredibly loving father, grandfather, father-in-law, and uncle, a hero to many, and an overall amazing human being,\" the statement said. \"Charles leaves a legacy of love, service, courage, spirit, duty and family that continues to shine brightly.\"\n\nOn D-Day, 4,414 Allied troops lost their lives — 2,501 of them Americans. More than 5,000 were wounded. On the German side, several thousand were killed or wounded.\n\n\"Mortars and artillery coming at us,\" Shay told CBS News in 2019. \"When the ramp went down, the men that were standing in the front, some of them were killed immediately.\"\n\nOthers were so badly hurt, they couldn't drag themselves out of the surf.\n\n\"Many men that had been wounded were laying and could not help themselves in the tide,\" Shay told CBS News.\n\nShay survived.\n\n\"I guess I was prepared to give my life if I had to. Fortunately, I did not have to,\" Shay said in a 2024 interview with The Associated Press.\n\n\"I had been given a job, and the way I looked at it, it was up to me to complete my job,\" he recalled. \"I did not have time to worry about my situation of being there and perhaps losing my life. There was no time for this.\"\n\nOn that night, exhausted, he eventually fell asleep in a grove above the beach.\n\n\"When I woke up in the morning, it was like I was sleeping in a graveyard because there were dead Americans and Germans surrounding me,\" he recalled. \"I stayed there for not very long and I continued on my way.\"\n\nShay then pursued his mission in Normandy for several weeks, rescuing those wounded, before heading with American troops to eastern France and Germany, where he was taken prisoner in March 1945 and liberated a few weeks later.\n\nAfter World War II, Shay reenlisted in the military because the situation of Native Americans in his home state of Maine was too precarious due to poverty and discrimination.\n\nMaine would not allow individuals living on Native American reservations to vote until 1954.\n\nShay continued to witness history — returning to combat as a medic during the Korean War, participating in U.S. nuclear testing in the Marshall Islands and later working at the International Atomic Energy Agency in Vienna, Austria.\n\nFor over 60 years, he did not talk about his WWII experience.\n\nBut he began attending D-Day commemorations in 2007 and in recent years, he has seized many occasions to give his powerful testimony and spread a message of peace.\n\nDuring the COVID-19 pandemic in 2020-2021, Shay's lone presence marked commemoration ceremonies as travel restrictions prevented other veterans or families of fallen soldiers from the U.S., Britain and other allied countries from making the trip to France.\n\nFor years, Shay used to perform a sage-burning ceremony, in homage to those who died, on a bluff overlooking Omaha Beach, where the monument bearing his name now stands.\n\nOn June 6, 2022, he handed over the remembrance task to another Native American, Julia Kelly, a Gulf War veteran from the Crow tribe. That was just over three months after Russia's full-scale invasion of Ukraine in what was to become the worst war on the continent since 1945.\n\nShay then expressed his sadness at seeing war back on the continent.\n\n\"Ukraine is a very sad situation. I feel sorry for the people there and I don't know why this war had to come,\" he said. \"In 1944, I landed on these beaches and we thought we'd bring peace to the world. But it's not possible.\"\n\n© 2025 CBS Interactive Inc. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed. The Associated Press contributed to this report.",
      "articleItem": {
        "title": "Charles Shay, who saved lives on D-Day as a teen medic, dies at 101",
        "url": "https://www.cbsnews.com/news/charles-shay-dies-d-day-veteran-saved-lives-dead-age-101/",
        "imageUrl": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/12/03/d9b3dbf6-7add-43be-93b1-08f2a3871c49/thumbnail/640x360/2d9a037717175e4d48f68169b09d78cf/ap24124314708528.jpg#"
      },
      "scrapedAt": "2025-12-03T21:02:07.883Z",
      "success": true,
      "origin": "cbsWorld"
    },
    {
      "url": "https://apnews.com/article/hegseth-signal-war-plans-inspector-general-5a315349f428e22e5bf6a424287738eb",
      "title": "Pentagon watchdog finds Hegseth’s use of Signal posed risk to US personnel, AP sources say",
      "excerpt": "The Pentagon’s watchdog has found that Defense Secretary Pete Hegseth put U.S. personnel and their mission at risk when he used the Signal messaging app to convey sensitive information about a military strike against Houthi militants in Yemen. That's according to two people familiar with the findings on Wednesday. One of the people says Hegseth, however, has the ability to declassify material and the report did not find he did so improperly. Hegseth denied posting classified information regarding plans for a military strike against Houthi militants in Yemen in March. The review by the Pentagon inspector general’s office was delivered to lawmakers, who were able to review the report in a classified facility at the Capitol.",
      "category": "politics",
      "body": "WASHINGTON (AP) — The Pentagon’s watchdog found that Defense Secretary Pete Hegseth put U.S. personnel and their mission at risk when he used the Signal messaging app to convey sensitive information about a military strike against Yemen’s Houthi militants, two people familiar with the findings said Wednesday.\n\nHegseth, however, has the ability to declassify material and the report did not find he did so improperly, according to one of the people familiar with the findings who spoke on condition of anonymity to discuss the information. That person also said the report concluded that Hegseth violated Pentagon policy by using his personal device for official business and it recommended better training for all Pentagon officials.\n\nFrom AP’s Standards and Stylebook teams: The AP is using anonymous sourcing to provide information for this story. Click here to hear Washington Bureau Chief Anna Johnson explain AP’s policy on the use of anonymous sources.\n\nHegseth declined to sit for an interview with the Pentagon’s inspector general but provided a written statement, that person said. The defense secretary asserted that he was permitted to declassify information as he saw fit and only communicated details he thought would not endanger the mission.\n\nThe initial findings ramp up the pressure on the former Fox News Channel host after lawmakers had called for the independent inquiry into his use of the commercially available app. Lawmakers also just opened investigations into a news report that a follow-up strike on an alleged drug-smuggling boat in the Caribbean Sea in September killed survivors after Hegseth issued a verbal order to “kill everybody.”\n\nHegseth defended the strike as emerging in the “fog of war,” saying he didn’t see any survivors but also “didn’t stick around” for the rest of the mission and that the admiral in charge “made the right call” in ordering the second strike. He also did not admit fault following the revelations that he discussed sensitive military plans on Signal, asserting that the information was unclassified.\n\nIn at least two separate Signal chats, Hegseth provided the exact timings of warplane launches and when bombs would drop — before the men and women carrying out those attacks on behalf of the United States were airborne.\n\nHegseth’s use of the app came to light when a journalist, Jeffrey Goldberg of The Atlantic, was inadvertently added to a Signal text chain by then-national security adviser Mike Waltz. It included Vice President JD Vance, Secretary of State Marco Rubio, Director of National Intelligence Tulsi Gabbard and others, brought together to discuss March 15 military operations against the Iran-backed Houthis.\n\nHegseth had created another Signal chat with 13 people that included his wife and brother where he shared similar details of the same strike, The Associated Press reported.\n\nSignal is encrypted but is not authorized for carrying classified information and is not part of the Pentagon’s secure communications network.\n\nHegseth previously has said none of the information shared in the chats was classified. Multiple current and former military officials have told the AP there was no way details with that specificity, especially before a strike took place, would have been OK to share on an unsecured device.\n\nThe review was delivered to lawmakers, who were able to review the report in a classified facility at the Capitol. A partially redacted version of the report was expected to be released publicly later this week.\n\nHegseth said he viewed the investigation as a partisan exercise and did not trust the inspector general, according to one of the people familiar with the report’s findings. The review had to rely on screenshots of the Signal chat published by the Atlantic because Hegseth could not provide more than a small handful of his Signal messages, the person said.\n\nWhen asked about the investigation in August, Pentagon press secretary Kingsley Wilson told reporters that “we believe that this is a witch hunt and a total sham and being conducted in bad faith.”\n\nThe Pentagon did not immediately respond Wednesday to a request for comment.\n\nThe revelations sparked intense scrutiny, with Democratic lawmakers and a small number of Republicans saying Hegseth posting the information to the Signal chats before the military jets had reached their targets potentially put those pilots’ lives at risk. They said lower-ranking members of the military would have been fired for such a lapse.\n\nThe inspector general opened its investigation into Hegseth at the request of the Republican chairman of the Senate Armed Services Committee, Sen. Roger Wicker of Mississippi, and the committee’s top Democrat, Sen. Jack Reed of Rhode Island.\n\nSome veterans and military families also raised concerns, citing the strict security protocols they must follow to protect sensitive information.\n\nThe Houthi rebels had started launching missile and drone attacks against commercial and military ships in late 2023 in what their leadership had described as an effort to end Israel’s offensive against Hamas in the Gaza Strip. Their campaign greatly reduced the flow of trade through the Red Sea corridor, which typically sees $1 trillion of goods move through it annually.\n\nThe U.S.-led campaign against the Houthis in 2024 turned into the most intense running sea battle the Navy had faced since World War II.\n\nA ceasefire in the Israel-Hamas war had begun in January before falling apart in March. The U.S. then launched a broad assault against the Houthis that ended weeks later when Trump said they pledged to stop attacking ships. The latest Gaza ceasefire began in October.\n\nFollowing the disclosure of Hegseth’s Signal chat that included the Atlantic’s editor, the magazine released the entire thread in late March. Hegseth had posted multiple details about an impending strike, using military language and laying out when a “strike window” starts, where a “target terrorist” was located, the time elements around the attack and when various weapons and aircraft would be used in the strike. He mentioned that the U.S. was “currently clean” on operational security.\n\nHegseth told Fox News Channel in April that what he shared over Signal was “informal, unclassified coordinations, for media coordinations and other things.”\n\nDuring a congressional hearing in June, Hegseth was pressed multiple times by lawmakers over whether he shared classified information and if he should face accountability if he did.\n\nRep. Seth Moulton, a Massachusetts Democrat and Marine veteran, asked Hegseth whether he would hold himself accountable if the inspector general found that he placed classified information on Signal.\n\nHegseth would not directly say, only noting that he serves “at the pleasure of the president.”\n\n___\n\nAssociated Press writer Stephen Groves and Konstantin Toropin contributed to this report.",
      "articleItem": {
        "title": "Pentagon watchdog finds Hegseth’s use of Signal posed risk to US personnel, AP sources say",
        "url": "https://apnews.com/article/hegseth-signal-war-plans-inspector-general-5a315349f428e22e5bf6a424287738eb"
      },
      "scrapedAt": "2025-12-03T21:02:08.315Z",
      "success": true,
      "origin": "apNewsPolitics"
    },
    {
      "url": "https://www.yahoo.com/news/articles/japanese-american-draft-dodgers-wwii-205458268.html",
      "title": "The Japanese American ‘draft dodgers’ of WWII",
      "excerpt": "In 1944, a few hundred U.S.-born Japanese Americans defied their draft orders, citing the constitutional rights of the interned Nisei.",
      "category": "politics",
      "body": "In the wake of the Dec. 7, 1941, attack on Pearl Harbor, President Franklin D. Roosevelt authorized the mass removal from the West Coast of “all persons deemed a threat to national security.”\n\nThe policy, Executive Order 9066, was incited by widespread anti-Japanese American discrimination and set the stage for mass eviction, evacuation and incarceration of 120,000 first-generation Japanese immigrants, known as Issei, and Nisei, who were U.S. citizens by birthright.\n\nThey were penned into camps across desolate regions in California, Arizona, Wyoming and Colorado, among other states.\n\nTo add to the degradation, Americans of Japanese descent were initially denied the opportunity to serve their country. That changed, however, in 1944, as the United States — pulled into a world war — needed increasing manpower.\n\nDespite the betrayal by their own country, nearly 33,000 Japanese Americans served in the armed forces, making up the 442nd Regimental Combat Team — a formation that, to this day, remains the most decorated Army combat unit.\n\nThe 442nd’s story, including that of Medal of Honor recipient and eventual Hawaii state Senator Daniel Inouye, is known. Less so, however, is the tale of a few hundred Nisei who defied the order to report for military duty.\n\nDozens were jailed for their actions but ultimately freed either by court order or presidential pardon.\n\nA small group of resistors, led by Frank Emi and Kiyoshi Okamoto at Heart Mountain Relocation Center in Wyoming, argued that they could not, and would not, serve until the status of their citizenship had been clarified, according to the National Archives.\n\nAt first, Emi, like many others, accepted internment.\n\n“Shikata ga nai” — or “it cannot be helped” — was a phrase often bandied about the camp.\n\nHowever, after several years of scorching summer heat, dust storms and bitter winters, all while under armed guard, the arrival of draft orders in 1944 sent men like Emi and Okamoto to the brink.\n\n“We could either tuck our tails between our legs like a beaten dog or stand up like free men, [imbued] with American ideals, and fight for justice,” Emi told the Los Angeles Times in 1993.\n\nIn response, the men began the Fair Play Committee to support the constitutional rights of interned Nisei. The group, made up of several hundred men, refused to serve as soldiers while their families were imprisoned in horse stables and tar paper barracks.\n\nEarly questionnaires sent by the U.S. government in 1943 had already drawn the ire of men like Emi, who resented such questions as: “Are you willing to serve in the armed forces of the United States on combat duty, wherever ordered?” and “Will you swear unqualified allegiance to the United States of America and faithfully defend the United States from any or all attack…?”\n\nAccording to the Los Angeles Times, Emi’s response to both questions was the same.\n\n“Under the present conditions and circumstances, I am unable to answer this question,” he stated.\n\nEmi and his brother, Art, urged other interned Nisei to answer similarly, but were often derided as “no-no boys,” with many fearing this open rebellion would further damage the reputation of Japanese Americans.\n\nStill, some 300 men across 10 camps refused induction — with one in nine Heart Mountain men shunning the order.\n\n“We were very angry and frustrated at the injustice of what the government did to us. For a person raised in the American tradition — not the Japanese tradition of bowing to authority — we felt we had to speak out,” Emi told the Times.\n\nAnd speak out they did.\n\n“I believe this draft law was not intended for me,” Okamoto wrote in a draft letter. “I was evacuated without due process of law; I am concentrated without due process of law; I was deported from my home state without due process of law; I am detained within barbed wire fences by force of military threat without due process of law; I exist within this militarily guarded enclosure as a Citizen without a Country without due process of law; the whole transaction effecting me is based upon unconstitutional interpretations without due process of law.”\n\nEmi and Okamoto quoted the Constitution and Abraham Lincoln in subsequent bulletins posted around the camp.\n\nThe third bulletin, dated March 1, 1944, opened with the words of the Bill of Rights:\n\n“No person shall be deprived of life, liberty, or property, without due process of law, nor private property be taken for public use without just compensation.” —Article V of the U.S. Bill of Rights.\n\n“Neither slavery nor involuntary solitude, except as punishment for crime whereof the party shall have been duly convicted, shall exist within the United States, or any place subject to their jurisdiction.” —Article XIII of the U.S. Bill of Rights.\n\nNational Archives\n\nThe men then ended the bulletin by stating their protest was an act of just civil disobedience due to the denial of their inalienable rights as U.S. citizens:\n\nThus, the members of the FPC unanimously decided at their last open meeting that until we are restored all our rights, all discriminatory features of the Selective Service abolished, and measures are taken to remedy the past injustices thru Judicial pronouncement or Congressional act, we feel that the present program of drafting us from this concentration camp is unjust, unconstitutional, and against all principles of civilized usage. Therefore, WE MEMBERS OF THE FAIR PLAY COMMITTEE HEREBY REFUSE TO GO TO THE PHYSICAL EXAMINATION OR TO THE INDUCTION IF OR WHEN WE ARE CALLED IN ORDER TO CONTEST THE ISSUE.\n\nNational Archives\n\nAt the time, only one journalist, James Omura, from the Denver-based outlet Rocky Shimpo, reported on the protests and subsequent arrests.\n\nOn June 12, 1944, 63 resisters from Heart Mountain were tried for draft evasion. Twenty-two more would later resist.\n\nAt the mass trial, all of the men were convicted and sentenced to three years in federal prison. They were also denied a hearing before the Supreme Court.\n\nIn 1945, the 10th Circuit Court of Appeals overturned the convictions of seven FPC leaders, according to the National Archives. The court ruled their jury improperly ignored civil disobedience as a defense.\n\nOmura, himself a Japanese American, was indicted for conspiracy to counsel draft evasion. He was eventually acquitted under First Amendment rights of the press.\n\nSome of the remaining men were released in 1946, with the rest set free during the Christmas season of 1947, when President Harry Truman signed Proclamation 2762, pardoning 1,523 individuals convicted of violating the Selective Training and Service Act of 1940.\n\nThe resistance, however, divided Japanese Americans, with many, especially Nisei World War II veterans, calling it shameful or traitorous.\n\n“I always thought those guys were a bunch of chickens,” veteran George Yoshinaga said in a 1993 interview, adding that if all of the Japanese Americans had refused, most Americans would have called them “disloyal.”\n\nEmi and the other resistors, though, remained steadfast in their beliefs, according to fellow prisoner Yosh Kuromiya.\n\n“[Emi] was quite adamant about it to the very end,” Kuromiya told the Los Angeles Times in 2010. “It was a matter of principle.”",
      "articleItem": {
        "title": "Military TimesThe Japanese American ‘draft dodgers’ of WWII",
        "url": "https://www.yahoo.com/news/articles/japanese-american-draft-dodgers-wwii-205458268.html",
        "imageUrl": "https://s.yimg.com/lo/mysterio/api/98E0B9A18913E92C0379A7C7D246C6AA1E127E28383406C63EBF58BABE0AA85E/subgraphmysterio/smartcrop_w1000_h562_faces;quality_95/https:%2F%2Fmedia.zenfs.com%2Fen%2Fmilitary_times_968%2F587dfc95769e7de8774d35cad4862408"
      },
      "scrapedAt": "2025-12-03T21:02:10.781Z",
      "success": true,
      "origin": "yahooPoliticsNews"
    },
    {
      "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-rise-as-surprise-adp-jobs-decline-reinforces-fed-rate-cut-bets-000151602.html",
      "title": "Stock market today: Dow, S&P 500, Nasdaq rise as surprise ADP jobs decline reinforces Fed rate cut bets",
      "excerpt": "Doubts over AI demand put pressure on tech and a surprise fall in private-sector employment revealed cracks in the job market.",
      "category": "finance",
      "body": "US stocks shook off early losses on Wednesday as a surprise decline in private-sector employment revealed cracks in the job market, but also reinforced bets on a Fed rate cut next week.\n\nThe Dow Jones Industrial Average (^DJI) rose 0.7%, while the S&P 500 (^GSPC) added 0.3%. The tech-heavy Nasdaq Composite (^IXIC) climbed 0.2% after the major gauges finished Tuesday with gains across the board.\n\nInvestors digested the ADP report, which could add fuel to the rate-cut fire, as nearly 90% of bets sit on a quarter-point reduction from the Federal Reserve next week. Private employers shed 32,000 jobs in November, compared with expectations for a modest gain. ADP said the decline was driven by a sharp pullback from small businesses.\n\nMeanwhile, from the Institute for Supply Management showed US services activity expanded slightly in November to a reading of 52.6%, while the index for prices paid eased to a seven-month low in a potentially positive sign for inflation. The next official update on consumer prices — the PCE print due Friday — is playing catch-up on September.\n\nElsewhere, bitcoin (BTC-USD) extended its bid to bounce back from a deep, weeks-long slump that pulled the token below $83,000 in recent days. The leading cryptocurrency rose to a two-week high above $93,000 on Wednesday before retracing some of its gains.\n\nMicrosoft (MSFT) helped spur an early decline in tech stocks, with its shares down over 1% after The Information reported that the software giant is lowering its AI sales quotas. That appeared to reignite investor skepticism that AI demand may not be as high as projected by Big Tech. Leading semiconductor stocks retreated, with Nvidia (NVDA), Broadcom (AVGO), and TSMC (TSM) dropping.\n\nOn the earnings front, Marvell Technology (MRVL) stock climbed 6% after the US chipmaker's upbeat sales outlook and deal to buy Celestial AI. Shares of American Eagle Outfitters (AEO) surged 14% after the retailer's strong start to the holiday shopping season. But Macy's (M) shares slipped after the retailer posted a surprise profit but underwhelmed with its sales outlook amid an ongoing overhaul.\n\nSalesforce (CRM) results are on Wednesday's docket after the bell.\n\nYahoo Finance's David Hollerith reports:\n\nRead more here.\n\nYahoo Finance's Ines Ferré reports:\n\nRead more here.\n\nUS stocks broadly turned higher in midday trading, but small-cap stocks shone as investors increased bets on a Federal Reserve rate cut in December.\n\nThe Russell 2000 (^RUT) rose over 1%, outperforming the gains in the Dow Jones Industrial Average (^DJI), S&P 500 (^GSPC), and Nasdaq Composite (^IXIC).\n\nPart of the rally in small caps may be chalked up to seasonality. \"We're seeing the seasonal stirrings of the small-cap outperformance,\" Stock Trader's Almanac editor, Jeff Hirsch, told Yahoo Finance on Wednesday.\n\nHirsch pointed to the \"January effect,\" the tendency for small caps to outperform large caps between mid-December and March. The name comes from the month that typically sees the greatest small-cap outperformance, January.\n\n\"Low interest rates definitely help,\" Hirsch said. \"I think we've been waiting for more than a year for small caps to wake up, and .... we're seeing it just across the board.\"\n\nAlthough some strategists expect stocks to break from some of their seasonal patterns this year, Hirsch remained confident that traders will see the January effect and small caps rally into the end of the year.\n\nNvidia (NVDA) released a report on Wednesday showing how its Blackwell AI systems can scale up artificial intelligence more efficiently, just as Big Tech's data center buildout faces a massive power shortage.\n\nUnlike previous models that use all their parameters to generate answers for AI tools — requiring enormous computing power — Nvidia noted that leading frontier AI models use what's called a \"Mixture of Experts\" architecture that's more efficient. Examples include OpenAI’s gpt-oss-120B model, DeepSeek's R1, and Mistral AI’s Mistral Large 3.\n\nIn a so-called MoE model, many specialized “experts” are trained for different types of tasks. Instead of activating the entire model for every query, the model selects only the experts best suited to respond, reducing the computing power required for AI tasks while still improving performance.\n\nBut today's MoE models have some limitations — they require a lot of memory and the use of multiple AI chips at once.\n\nNvidia said its GB200 NVL72 AI server racks — which include 72 Blackwell GPUs, or graphics processing units (aka AI chips), and are equipped with its coveted networking technology — resolve bottlenecks to scaling MoE systems in order to improve the energy efficiency and lower the cost of AI.\n\nNvidia said its Blackwell system is \"transforming the economics of AI at scale in power- and cost-constrained data centers\" because it \"unlocks\" the potential of MoE models that are \"moving the industry toward a future where massive capability, efficiency and scale coexist.\"\n\nNatural gas futures (NG=F) continued a significant tear higher Wednesday, hitting a three-year high of $4.996 around 8 a.m. ET.\n\nPrices have surged by more than 20% in the past month. If the commodity crosses the $5 mark, it will be the first time it has done so since December 2022.\n\nPrices on natural gas have spent the past several months spiking as supply has shrunk and demand has grown substantially. Not only has a cold winter pushed prices up on expectations of incoming consumer demand, but the boom in data centers seeking immense loads of power has also begun to draw on natural gas.\n\nGetting connected to the US power grid can take years, and renewables are largely unable at their current levels to meet the high demands of data centers. Natural gas infrastructure has filled that gap, acting as a backstop while Big Tech works out permanent solutions to its power shortfall.\n\nThe US has also spent 2025 increasing its exports of liquified natural gas (LNG) as global demand has risen, reducing the amount of gas available for storage and tightening the supply side.\n\nNetflix (NFLX) shares dropped more than 6% Wednesday morning as the streaming giant attempted to preempt regulatory concerns that its proposed acquisition of Warner Bros Discovery's (WBD) studios and streaming unit would raise prices for consumers.\n\nThe company argued that the acquisition would reduce streaming costs by bundling Netflix and HBO Max, Reuters reported.\n\nThat argument appeared to do the opposite of its intention, with Netflix shares reversing gains from the previous four trading sessions on Wednesday morning.\n\nAdding pressure to the stock, Netflix co-founder Reed Hastings reported selling $40.7 million worth of shares on Dec. 1. Hastings also sold roughly $126 million worth of shares in the streaming giant in September and October, according to the latest SEC filing.\n\nBig-name chip stocks sank in early trading after The Information reported that Microsoft (MSFT) is cutting sales quotas for some AI products.\n\nAI chip giant Nvidia (NVDA) fell nearly 1%, while rival chipmaker Broadcom (AVGO) dropped 2.4% and leading contract chip manufacturer TSMC (TSM) sank nearly 1.9%. Micron (MU) — which supplies high-bandwidth memory to Nvidia for its AI systems — led the decline in chip stocks, falling 3.7%.\n\nThe Information's report appeared to reignite investor skepticism over whether AI demand is large enough to sustain AI hardware stocks' high valuations.\n\nUS stocks wobbled at the market open on Wednesday, partly recovering from steeper declines in premarket trading.\n\nThe Dow Jones Industrial Average (^DJI) and the S&P 500 (^GSPC) both dipped below the flatline. The tech-heavy Nasdaq Composite (^IXIC) fell around 0.3%.\n\nThe declines for tech came after The Information reported that Microsoft (MSFT) is lowering its quota for AI software sales. That appeared to fuel doubts over broader AI demand, with big-name chip stocks sinking in early trading. Also pressuring stocks, the ADP jobs update showed a surprise decline in private-sector employment in November.\n\nThe market action on Wednesday comes after the major indexes finished Tuesday with gains across the board.\n\nMicrosoft (MSFT) stock fell nearly 2% in premarket trade on Wednesday after The Information reported the company had cut sales quotas for some AI products.\n\nThese full-year cuts come after some sales goals were also missed in the first half of the year.\n\nThis report sent the entire market lower, with Nasdaq futures falling as much as 0.5% before the open.\n\nThe market reaction on Wednesday shows this report being seen as another sign AI products might not yet be ready for the kind of mass customer adoption — whether that be consumers or enterprise customers — that hype around the AI trade depends on.\n\nOn the other hand, this softening of what were almost certainly aggressive targets also has a people management aspect, too, as a company doesn't want to punish a salesforce on the leading edge of an industrywide change if those same salespeople will be needed in the future to continue leading these efforts as AI products improve.\n\nBut given the state of this market, where investors have an increasing number of doubts about the stability of the AI trade against the backdrop of a slowing white collar labor market, this news does not appear to be getting the benefit of the doubt.\n\nUS private employers shed 32,000 jobs in November, ADP reported Wednesday, marking an unexpected decline in the labor market after October's revised 47,000 jobs gained.\n\nThe manufacturing, professional services, information, and construction sectors led the job losses. Hiring also deteriorated in small businesses, which lost 120,000 jobs during the month.\n\n“Hiring has been choppy of late as employers weather cautious consumers and an uncertain macroeconomic environment,” ADP chief economist Nela Richardson said. “And while November's slowdown was broad-based, it was led by a pullback among small businesses.”\n\nADP's labor market update was viewed as a crucial piece of labor market data, as the Bureau of Labor Statistics canceled its October jobs report due to the government shutdown.\n\nStocks were relatively unchanged following the report. Prospects of Fed interest rate cuts likely offset concerns about weakness in the labor market. On Wednesday morning, traders assigned an 88% chance that the Fed would cut rates at its December meeting, compared to 83% the previous week.\n\nRead more here.\n\nEconomic data: MBA mortgage applications (week ended Nov. 28) ADP employment change (November); Import price index (September); Export price index (September) Industrial production (September); S&P Global US services PMI (November), final reading; S&P Global US composite PMI (November); ISM services index (November)\n\nEarnings: Salesforce (CRM), Royal Bank of Canada (RY), Snowflake (SNOW), Dollar Tree (DLTR), Five Below (FIVE), Macy's (M), Uranium Energy Corp. (UEC), C3.ai (AI)\n\nHere are some of the biggest stories you may have missed overnight and early this morning:\n\nMacy's posts surprise Q3 profit as overhaul resonates\n\nBets jump on rate cuts from Trump-led Fed\n\nApple's leadership shift marks a 'major reset' in AI strategy\n\nAnthropic plans an IPO as early as 2026, FT reports\n\nSalesforce stock historically cheap as AI risk takes a toll\n\nBitcoin hits 2-week high in cautious crypto recovery\n\nWomen are just guessing how much they'll need to retire\n\nFed data suggests central bank has stopped losing money\n\nMacy's (M) stock fell over 7% before the bell on Wednesday as its elevated sales guidance fell below last year's annual sales numbers. But the retailer posted a surprise third quarter profit and its strongest comparable sales in three years. It also raised its financial guidance for the year.\n\nThe AP reports:\n\nRead more here.\n\nYahoo Finance's Hamza Shaban writes in today's Morning Brief newsletter:\n\nRead more here.\n\nMarvell Technology (MRVL) shares climbed over 10% in premarket after its quarterly earnings beat and news the US chipmaker plans to buy Celestial ​AI.\n\nReuters reports:\n\nRead more here.\n\nGitLab (GTLB) stock fell 8% before the bell on Wednesday after reporting a loss in its latest quarter despite posting double-digit sales.\n\nOkta (OKTA) stock dropped 4% during premarket trading on Wednesday. The cybersecurity company forecast fourth-quarter revenue above Wall Street estimates on Tuesday.\n\nAcadia Healthcare (ACHC) fell 30% before the bell on Wednesday. The company lowered its full-year outlook, citing higher-than-expected costs from patient-related litigation.\n\nBitcoin (BTC-USD) continued its tentative recovery on Wednesday, tapping its highest level in two weeks as cryptocurrencies more broadly look to bounce back from a weeks-long slump.\n\nThe leading token rose to about $93,965, its highest intraday level since Nov. 17. It since has pared gains to trade below $93,000.\n\nBloomberg reports:\n\nRead more here.\n\nAmerican Eagle Outfitters (AEO) stock surged over 12% in premarket after the apparel retailer noted that its crucial holiday season was off to a strong start, boding well for the fourth quarter.\n\n“Strong momentum has continued into the fourth quarter, including an excellent start to the holiday season,\" CEO Jay Schottenstein said in the release late Tuesday. \"We delivered a record-breaking Thanksgiving weekend, led by an acceleration in demand across brands and channels and underscored by outstanding growth at Aerie and Offline.\"\n\nFor the third quarter, ended Nov. 1, American Eagle reported profit per share of $0.53, surpassing estimates of $0.43 per share. Revenue for the quarter was $1.36 billion, a 6% increase year over year and slightly better than estimates.\n\nOverall, same-store sales increased 4%, led by an 11% increase in Aerie comparable sales, while American Eagle comparable sales grew 1%.\n\nFor the fourth quarter, American Eagle expects same-store sales to grow 8% to 9% year over year. Comparable sales are expected to increase by low single digits for the full year.\n\nBloomberg reports:\n\nRead more here.\n\nReuters reports:\n\nRead more here.",
      "articleItem": {
        "title": "Stocks swing higher as ADP surprise fuels Fed bets",
        "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-rise-as-surprise-adp-jobs-decline-reinforces-fed-rate-cut-bets-000151602.html",
        "imageUrl": "https://s.yimg.com/uu/api/res/1.2/VKc9p6Mn8nC8Ms9WLRCEyQ--~B/Zmk9c3RyaW07aD02MztxPTgwO3c9ODQ7YXBwaWQ9eXRhY2h5b24-/https://s.yimg.com/os/creatr-uploaded-images/2025-12/c9290ab0-cfd1-11f0-8fd6-d0e33b07e534.cf.webp"
      },
      "scrapedAt": "2025-12-03T21:02:13.091Z",
      "success": true,
      "origin": "yahooFinanceNews"
    },
    {
      "url": "https://www.yahoo.com/entertainment/tv/articles/landman-duo-ali-larter-michelle-222755480.html",
      "title": "‘Landman’ Duo Ali Larter and Michelle Randolph Know They Are the Heart of the Show",
      "excerpt": "Despite the eye rolls from the rest of the ensemble, both women know \"exactly who they are\" as they cast a fiery orbit around Billy Bob Thornton's oil fixer ...",
      "category": "entertainment",
      "body": "Like a tornado of energy, Ali Larter and Michelle Randolph know how to make an entrance on Landman. After making her debut over FaceTime in the first season of the Billy Bob Thornton-starring Taylor Sheridan co-created series, Larter’s Angela — the formerly estranged and now-reconciled wife to Thornton’s oil fixer, Tommy Norris — runs the house in season two. And no matter how many oil men fill up their hallways, her second-in-command is always her daughter Ainsley, played by Randolph.\n\nOnly three episodes have released so far in season two, and already the fiery mother-daughter-duo is doing more of what viewers love, and what the rest of the ensemble loves to roll their eyes at. But Randolph says there’s one new character who sees them for who they are, and that’s Sam Elliott, the Sheridan alum of Yellowstone prequel 1883 who joined the cast this season as T.L., father to Tommy.\n\nMore from The Hollywood Reporter\n\n'Yellowstone' Spinoff 'Y: Marshals' Returns Luke Grimes as a Tortured Kayce Dutton in First Look\n\n'Landman' Star Andy Garcia Can't Say Much About His Elusive Cartel Boss in Season 2\n\nSpencer Lofranco, 'Gotti' and 'Unbroken' Actor, Dies at 33\n\n“T.L. sees them for who they really are, which is joy. It’s refreshing to see us through his eyes,” Randolph tells The Hollywood Reporter. In the below conversation with Larter, the close co-stars dive into playing Angela and Ainsley, dish about their lightning-in-a-bottle success with the hit Paramount+ series, share their hopes for a long future and tease more heartbreaking and heartwarming episodes ahead.\n\n***\n\nDid you feel pressure around season two since season one was a mega-success? Were you able to block out that noise and stick to the work?\n\nMICHELLE RANDOLPH I actually felt calmer going into season two. I was trying to figure out the show in season one — the tone, how my character fit in, my accent. There were so many things I was worried about. Then seeing how the show was received and how it all pieced together, I was really excited to go back and settle into the character. I still had my moments, but it was overall a better season for me.\n\nALI LARTER I agree. The first season was incredibly challenging in so many ways, and the second season was like an old pair of Wranglers. We built our house. We all spent a tremendous amount of time together the first year figuring out the chemistry between everyone — how the family fit together, the different tones of the show, which there are so many. Once we understood who we were coming into the second season, we were just excited to be back with the cast and our crew. We’re all really close. You can feel the work and the time everyone commits to the show when you watch it.\n\nBilly Bob Thornton recently said he signed a four- or five-year contract with Landman. Are you hoping for that many seasons, or more?\n\nRANDOLPH Definitely. Even by the end of season two, there’s so much story still left to tell; so much for these characters. I could see the show going for a long time. We wouldn’t run out of things.\n\nLARTER It’s masterful how Taylor [Sheridan] writes. My character came in on FaceTime, so the whole audience thought I was coming in as a guest role and didn’t realize that the family was the heartbeat of the show. That’s what he knew and what we knew, since we had the first 10 episodes [ahead of time for season one]. Then we really do dig into that now. This is a heartbreaking and heartwarming season. We dig into some of the complexities and real-life moments that happened to this family, and how we react to them. So we’re only on season two, but I agree. There’s so far for these stories to go.\n\nThe first season when Billy and I started working together, there was a lot of vitriol on the page of us barking at each other. We realized this isn’t a movie; this is a show. If this is something we want to have legs, there has to be a real depth to our relationship that doesn’t have an ending. We are always keeping their relationship incredibly alive.\n\nRANDOLPH I always forget the first season took place over 10 days. It’s such a short amount of time. You can’t have a character arc within 10 days. I mean, you can, but subtly. So there’s so much more story.\n\nAli, we did see you back on FaceTime in episode two this season. Was that a wink to the early response to your character?\n\nLARTER No. (Laughs.) Part of that is that when the audience knows they like something [you lean in], like the family dinners. That’s part of how Taylor writes; you’re going to repeat certain things because it feels good. Within the world of Tommy and Angela, there’s always this banter and heightened reality. But there are moments in every scene that are incredibly truthful that show the level of depth they have in their relationship. In that scene, there’s one you can find. There are different moments within all of these scenes where, as Tommy and Angela, we really drop in. You see the shenanigans around them, and then there’s a purity.\n\nYour showrunner Christian Wallace said both of you snapped back into your characters once you got to set for season two. Ali, you said Taylor encouraged you to keep your foot on the gas in season one, like a “tornado of energy.” How did you keep that pace?\n\nLARTER Easily, because I know who she is now. We didn’t have the entire season going into season two. We only had a couple episodes. But because we know these characters and the chemistry and dynamics within the family, you could drop us anywhere and we can land on our feet. We did the work the first season. And we definitely get stretched this year. I mean, there’s an episode that’s farce; some of the comedy goes close to satire. Taylor writes whatever he wants, and then me and Billy just play ball; we can dig in. And working with an actor as extraordinary as Billy is always authentic; we can always find it. I’m just so excited he’s my partner in this.\n\nRANDOLPH I really played with the comedy this year, because that’s what was written on the page. I felt a lot more confident because I knew how important it was to the show. The college interview, for example, read like a sitcom, so I tried to find the moments where I could ground it. Ainsley is so sincere, which is why she’s the best. She never tries to act like she knows more than she does. She knows exactly who she is and she knows her role in the family, and there’s something refreshing about that; she has so much room to grow. I have fun playing with her.\n\nAli, Tommy is elevated this season — both financially and with power, which created tension in the beginning between Tommy and Angela. Will this bring up old demons for them, and will they continue to work through it in their own way?\n\nLARTER It’s interesting this season digging into the family. There’s a loss, and Angela makes Tommy step up into being a good man within their marriage. Whether he’s going to or not has yet to be seen. But there are all these real-life things we start grappling with. She’s not allowing her daughter to move to Fort Worth without her. She’s absolutely going, but also Angela doesn’t think before she jumps. So her daughter’s going, well then, “OK, we’re going. We’re getting the house. We’re decorating the house. What are we having to drink?” It’s very fast; everything she feels is very deep and true. So if that’s the direction it’s going, then Tommy’s going to hop on board.\n\nWhat can you say about upcoming scenes between your characters and the new and elevated actors this season — Sam Elliot, Andy Garcia and Demi Moore?\n\nRANDOLPH We have some great stuff with Sam. Ainsley doesn’t know a whole lot about her dad. He’s such a mystery to her, so having his dad now come into the story help her to start to understand him a little bit more. Working with Sam is a dream. I still can’t believe he joined our cast.\n\nLARTER Sam is such an icon. Watching him in the house with us with these soulful eyes and the depth he brings with our characters in this world is really beautiful. I’m excited for everyone to get to see that. We had an amazing scene in episode three with Andy and Demi and Billy and Stefania [Spampinato, who plays the wife to Andy Garcia’s Gallino] where we really dig in. At the end of season one, Tommy said to Angela, “There are things I can’t tell you about this business.” Then this season, she’s creeping deeper into his life and it can cause a lot of conflict. But to get to work with those actors was such a joy, to see what they brought to the table. That was an incredible scene.\n\nRANDOLPH I feel like we are viewed in the show through the lens of people always thinking that our characters are ridiculous. Like, “OK, here the girls come again.” Tommy, Cooper [Jacob Lofland], Dale [James Jordan], Nathan [Colm Feore] — are all [rolling their eyes]. But T.L, Sam’s character, sees them for who they really are, which is joy. It’s refreshing to see us through his eyes.\n\nLARTER And getting to work with Andy Garcia, another icon; he’s incredibly charismatic on screen. So suave. He brings so much to Gallino and these complexities. All these actors and characters are so unique. It’s really exciting to be part of a show that has space for that much depth.\n\nTaylor Sheridan was recently in the news about his eventual jump from Paramount to NBCUniversal with his new mega-deal to keep creating content. How did you react when you saw that, and what do you think about the future of the Sheridan-verse?\n\nRANDOLPH I just hope we get to keep shooting Landman for as long as possible. But I don’t think that [deal is] directly going to affect our show.\n\nLARTER You’d have to ask Taylor how he feels, but we love our show, and we love the cast and the crew and everyone down in Fort Worth.\n\nWas Taylor as available on set for season two as season one?\n\nRANDOLPH He’s always a phone call away. If you need him, he will be there. If you have a question, he’s there. He didn’t direct any of the episodes this year, but that’s because he started the season off last year and then handed it over. But I’m so grateful that any time I said, “I need to speak with you,” he is responsive. No matter how busy that man is, he cares deeply.\n\nLARTER He cares deeply. This season, Stephen Kay directed all 10 episodes. To have that throughline for the actors is really great; it also holds the show. We are all right there together when you have one director. Taylor spent a tremendous amount of time the first season teeing us up. He got it where he wanted it, and now the train’s on its way, barreling ahead.\n\nWould you say the ending to season two sets up a third season?\n\nLARTER In a huge way. I think I know where the third season is going.\n\nRANDOLPH I want to know!\n\nLARTER We should write [our predictions] on a piece of paper!\n\nHave you heard any rumblings? Are you feeling good about a third season?\n\nRANDOLPH I just don’t see how it wouldn’t go another season.\n\nLARTER I’ve been in this business long enough to know how lucky it is to have a show on this kind of cycle. It’s extraordinarily rare to be on a show you love to make that’s received by audiences in this way, and the fact that we’re starting again. We’re coming out the same time as last year. I just know that we’re part of something really special, and I’m really grateful for it.\n\n***\n\nLandman season two releases new episodes Sundays on Paramount+.\n\nBest of The Hollywood Reporter\n\n'The Studio': 30 Famous Faces Who Play (a Version of) Themselves in the Hollywood-Based Series\n\n22 of the Most Shocking Character Deaths in Television History\n\nA 'Star Wars' Timeline: All the Movies and TV Shows in the Franchise\n\nSign up for THR's Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram.",
      "articleItem": {
        "title": "Why Ali Larter and Michelle Randolph are the heart of 'Landman'",
        "url": "https://www.yahoo.com/entertainment/tv/articles/landman-duo-ali-larter-michelle-222755480.html",
        "imageUrl": "https://s.yimg.com/uu/api/res/1.2/QLOC_gO_9gR_IZOntIUIUw--~B/Zmk9Zml0O2g9ODA7cHlvZmY9MDt3PTgwO2FwcGlkPXl0YWNoeW9u/https://s.yimg.com/os/creatr-uploaded-images/2022-01/08517870-7870-11ec-aff4-320344d7e9d8.cf.webp"
      },
      "scrapedAt": "2025-12-03T21:02:15.711Z",
      "success": true,
      "origin": "yahooEntertainmentNews"
    }
  ]
}