{
  "runId": "run3",
  "collectedAt": "2025-12-03T21:02:10.957Z",
  "totalArticles": 7,
  "articles": [
    {
      "url": "https://abcnews.go.com/US/airtag-helps-locate-labrador-swept-sea-lifeguards-pull/story?id=128072858",
      "title": "AirTag helps locate Labrador swept out to sea as lifeguards pull off miraculous rescue",
      "excerpt": "A black lab-mix who disappeared in San Diego was rescued after authorities found her swept out to sea by a rip current Sunday.",
      "category": "us",
      "body": "The search had just been called off when Sadie was spotted treading water.\n\nA black lab-mix who disappeared in San Diego was rescued after authorities found her swept out to sea by a rip current.\n\nA surfer at Ocean Beach alerted the San Diego Fire Department lifeguards Sunday that he saw a dog in the Mission Bay channel, launching an hour long search with jet skis to get her back to shore, the San Diego Fire Department said in a Facebook video.\n\nAccording to a social media post, Sadie, 5, escaped from a house in San Diego during a football game, where her parents tracked her to Ocean Beach with the AirTag on her collar.\n\nLifeguard Garrett Smerdon, who assisted in the rescue, said in the video that emergency responders at the beach were determined to find and save Sadie.\n\n\"We kind of huddled up and said that, you know, there's a good chance that Sadie was still alive. Just a five-year-old lab. They're fighters,\" Smerdon said.\n\nThe hour-long search for Sadie had just been called off when rescuers spotted her in the water, according to the fire department.\n\n\"After an extensive search with no sightings, lifeguards began making their way back in—until a miracle happened. Jet Ski 2 spotted the dog about a half-mile offshore near South Mission Beach. Lifeguards raced out to get her, transferring the frightened pup to a surf boat crew that brought her back to Lifeguard HQ, where she was reunited with her very relieved owners,\" the Facebook post reads.\n\nSadie was then tearfully reunited on the beach with her owners.\n\nLifeguard Jack Alldredge, who saw Sadie in the water, said he was glad Sadie was safely saved.\n\n\"We got closer and closer, and we realized it was her. And we were pretty excited,\" Alldredge said in the fire department's video. \"We just really wanted a happy ending, and we're glad that Sadie got to go back home and, you know, survive this pretty traumatic event.\"\n\n24/7 coverage of breaking news and live events",
      "articleItem": {
        "title": "AirTag helps locate dog swept out to sea as lifeguards pull off miraculous rescue",
        "url": "https://abcnews.go.com/US/airtag-helps-locate-labrador-swept-sea-lifeguards-pull/story?id=128072858",
        "imageUrl": "https://s.abcnews.com/images/US/sadie-3-ht-er-251203_1764792832188_hpMain_16x9_608.jpg"
      },
      "scrapedAt": "2025-12-03T21:02:01.731Z",
      "success": true,
      "origin": "abcNewsUS"
    },
    {
      "url": "https://apnews.com/article/new-orleans-louisiana-immigration-d0e4de8cd5bf9c7ca59ae38d803f93f2",
      "title": "Federal agents launch immigration crackdown in New Orleans",
      "excerpt": "The Department of Homeland Security is launching a new immigration crackdown in New Orleans. A Homeland Security official says the operation that got underway Wednesday targets violent criminals. The crackdown is the latest expansion of the Trump administration’s immigration sweeps that have unfolded in other U.S. cities. Immigration officials have blanketed big cities and small towns across the nation since January while carrying out President Donald Trump’s aggressive mass deportation efforts. In New Orleans, immigration lawyers say they have been inundated with calls and some businesses have posted signs barring federal agents from entry. Louisiana's Republican governor welcomes the crackdown.",
      "category": "us",
      "body": "NEW ORLEANS (AP) — Federal agents began hitting the streets of New Orleans on Wednesday in the Trump administration’s latest immigration crackdown across the U.S., looking to round up immigrants accused of violent crimes, a Homeland Security official said.\n\nThe operation is targeting immigrants who were released after arrests for crimes such as home invasion, armed robbery and rape, Homeland Security Department Assistant Secretary Tricia McLaughlin said in a statement.\n\nImmigration officials have blanketed big cities and small towns across the nation since January while carrying out Republican President Donald Trump ’s aggressive mass deportation efforts.\n\nFederal agents have launched high-profile immigration crackdowns in cities including Chicago and Charlotte, North Carolina. Another operation is expected in the coming days in Minnesota, targeting Somali immigrants. The enforcement tactics have been met with protests and lawsuits.\n\nThere are more than 200 Customs and Border Protection and U.S. Immigration and Customs Enforcement officials working on the New Orleans operation, according to a U.S. official who was not authorized to discuss the matter publicly. The objective is to make as many arrests as possible over at least 60 days.\n\nThe operation is being called “Catahoula Crunch,” continuing Homeland Security’s pattern of assigning region-specific names to the crackdowns. Planning documents obtained by the AP referred to the Louisiana operation as “Swamp Sweep.” The Catahoula leopard dog is Louisiana’s official state dog.\n\nFear and uncertainty have weighed heavy on the immigrant community in New Orleans — a one-of-a-kind American city known as the birthplace of jazz and for its Mardi Gras celebrations and rich blend of French, Spanish, African and Native American cultures.\n\nA witness saw federal agents chase down and arrest people in the parking lot of a New Orleans home improvement store Wednesday morning. “They tried to run across the street but they caught them,” said Jody Styles, who was at a gas station near the Lowe’s when authorities converged.\n\nSome businesses in heavily-Hispanic areas have shuttered, saying they will remain closed until the operation is over. Others businesses have signs on their doors barring federal immigration agents from entering.\n\nPosted on the door of Los Hondureños, a restaurant in nearby Kenner, was a handwritten note saying it was closing until further notice. It ended: “Thank you, The Hondurans.”\n\nTwenty years ago, New Orleans relied on thousands of Latino workers who helped rebuild after Hurricane Katrina. But it has not escaped the escalating tensions over immigration.\n\nEarlier this week, dozens of people took to the streets, despite rain and chilly temperatures, to protest the imminent crackdown. On Tuesday, more than 200 people filled a local church for a training on their legal rights and how to safely record federal immigration agents’ activity, including anticipated arrests.\n\nSome immigration lawyers say they have been inundated with calls from people trying to prepare for the federal crackdown.\n\nAs the operation began, residents took to social media, posting in neighborhood groups about the crackdown, including photos and addresses of possible sightings. Some desperately tried to decipher what information was accurate.\n\nLouisiana Gov. Republican Gov. Jeff Landry has singled out crimes in which the suspect’s immigration status is in question, such as the killing of a French Quarter tour guide by a group that included a Honduran man who entered the country illegally.\n\nThe Trump administration also has taken aim at the city’s immigration policies.\n\n“Sanctuary policies endanger American communities by releasing illegal criminal aliens and forcing DHS law enforcement to risk their lives to remove criminal illegal aliens that should have never been put back on the streets,” McLaughlin said.\n\nAttorney General Pam Bondi has accused New Orleans of undermining federal immigration enforcement. The Department of Justice includes New Orleans in a list of 18 cities it considers to be providing sanctuary to immigrants without legal status.\n\nNew Orleans officials deny the city’s policies thwart federal immigration enforcement. City police Chief Anne Kirkpatrick has said she considers immigration enforcement to be a civil matter outside her jurisdiction.\n\nLouisiana has been preparing for weeks for an immigration crackdown. The governor, a close Trump ally who has moved to align state policy with the White House’s enforcement agenda, said Wednesday that the crackdown will target the “worst of the worst, criminal illegal aliens that have broken the law.”\n\n“It started today and it’s going to run until we get them all off the street,” Landry said during an interview on the Walton & Johnson radio show.\n\nIn addition to the deployment of federal immigration agents, Landry said he expects National Guard members to arrive in New Orleans before Christmas to join the efforts to combat crime.\n\nThe immigration operation’s planning documents showed border agents intended to launch a monthslong crackdown in southeast Louisiana and into Mississippi.\n\nThe deployment, which aims to arrest 5,000 people, was expected to be led by the Border Patrol, whose agents have drawn scrutiny for aggressive tactics in other cities, including Chicago and Los Angeles.\n\nLouisiana State Police troopers and local FBI agents will work together to protect federal officers and stop attempts to block law enforcement actions during the crackdown, both agencies announced.\n\n___\n\nCline reported from Baton Rouge. Associated Press journalists Elliot Spagat in San Diego; John Seewer in Toledo, Ohio; and Stephen Smith in Kenner, Louisiana, contributed.\n\n___\n\nBrook is a corps member for The Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues.",
      "articleItem": {
        "title": "Federal agents launch immigration crackdown in New Orleans",
        "url": "https://apnews.com/article/new-orleans-louisiana-immigration-d0e4de8cd5bf9c7ca59ae38d803f93f2",
        "imageUrl": "https://dims.apnews.com/dims4/default/eca7b3f/2147483647/strip/true/crop/8640x5760+0+0/resize/567x378!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9b%2F83%2F0d01f5faf177b3e183c219f66d1b%2Fdd8e8c88f3ad4a5aac40b2da4338803e"
      },
      "scrapedAt": "2025-12-03T21:02:02.634Z",
      "success": true,
      "origin": "apNewsUS"
    },
    {
      "url": "https://abcnews.go.com/International/south-koreas-president-denies-nuclear-ambitions-amid-submarine/story?id=128065097",
      "title": "South Korea's president denies nuclear ambitions amid submarine deal",
      "excerpt": "South Korean President Lee Jae Myung sought to ease international concerns over the country’s nuclear ambitions on Monday.",
      "category": "world",
      "body": "Lee says nuclear-powered submarines is not a subject of non-proliferation.\n\nSEOUL -- South Korean President Lee Jae Myung sought to ease international concerns over the country’s nuclear ambitions on Monday, drawing a clear line between pursuing nuclear-powered submarines and any intent to develop nuclear weapons during a foreign press briefing at the presidential office in Seoul.\n\nThe briefing marked the one-year anniversary of South Korea’s return to democratic rule after former President Yoon Suk Yeol’s short-lived martial law attempt last year.\n\nLee and U.S. President Donald Trump reached a $350 billion investment and security agreement last month that included U.S. approval for South Korea to build nuclear-powered submarines.\n\nReflecting on the negotiations, Lee described Trump as “interesting and entertaining” and called the deal a “remarkable outcome” that provides South Korea with greater strategic flexibility.\n\nAsked by ABC News whether he is aware of nuclear proliferation concerns in Washington, Lee said “nuclear nonproliferation is an international principle we must respect,” stressing that the treaty restricts the spread of nuclear weapons but not all nuclear technologies.\n\nAny move toward nuclear armament would be “unrealistic and unwise,” Lee continued, adding that uranium enrichment for power generation and spent fuel reprocessing are “not directly related to nonproliferation.”\n\nMeanwhile, Trump has praised the agreement as a boost for American shipbuilding, saying it would create jobs in the United States. “South Korea will build the nuclear-powered submarines right here, at the Philly Shipyard in the United States. The U.S. shipbuilding industry will soon regain its vigor,” Trump wrote Oct. 30 on X.\n\nBut Lee pushed back on that characterization, saying South Korea -- which has one of the world’s most efficient shipbuilding industries -- intends to build the submarines domestically using homegrown technology.\n\n“We’re not asking for construction or tech transfer. Just approval for fuel supply,” he said.\n\n24/7 coverage of breaking news and live events",
      "articleItem": {
        "title": "South Korea's president denies nuclear ambitions amid submarine deal",
        "url": "https://abcnews.go.com/International/south-koreas-president-denies-nuclear-ambitions-amid-submarine/story?id=128065097",
        "imageUrl": "https://s.abcnews.com/images/International/seoul-nuclear-ambitions_1764767861718_hpMain_16x9_608.jpg"
      },
      "scrapedAt": "2025-12-03T21:02:05.519Z",
      "success": true,
      "origin": "abcNewsInternational"
    },
    {
      "url": "https://apnews.com/article/israel-palestinians-west-bank-gaza-hamas-hostages-1daaa29f923993fe794460309e73da80",
      "title": "Israel launches airstrike in southern Gaza after earlier attack by militants wounded 5 soldiers",
      "excerpt": "Israel says it launched an airstrike in southern Gaza in retaliation for an attack by militants earlier in the day that wounded five Israeli soldiers. Israel also has received remains in Gaza of a possible hostage and says it will begin allowing Palestinians to leave the war-torn territory through a border crossing with Egypt. The remains will be examined to determine whether they belong to either of the two last hostages in Gaza. It was not immediately clear when the Gaza border crossing would be opened. Egypt wants Palestinians to immediately be able to return to Gaza through the crossing. Israel says it won't allow two-way crossings until all the Gaza hostages are returned.",
      "category": "world",
      "body": "JERUSALEM (AP) — Israel said it launched an airstrike in southern Gaza late Wednesday in retaliation for an attack by militants earlier in the day that wounded five Israeli soldiers.\n\nThe airstrikes were the latest test for a fragile ceasefire that has mostly held up since early October, despite claims of violations by both Israel and Hamas.\n\nEarlier Wednesday, Israel received remains of what could be one of the last hostages in Gaza and said it would begin allowing Palestinians to leave the war-torn territory through a border crossing with Egypt.\n\nIsrael has accused Hamas of ceasefire violations before launching previous waves of airstrikes. Strikes killed 104 people in late October and 33 people in late November, according to local health officials.\n\nTHIS IS A BREAKING NEWS UPDATE. AP’s earlier story follows below.\n\nJERUSALEM (AP) — Israel received remains of what could be one of the last hostages in Gaza on Wednesday and said it will begin allowing Palestinians to leave the war-torn territory through a border crossing with Egypt.\n\nIsraeli Prime Minister Benjamin Netanyahu said an attack by militants earlier in the day that wounded four Israeli soldiers in southern Gaza was a violation of the ceasefire and that Israel “will respond accordingly.”\n\nThe remains found by militants in northern Gaza were returned to Israel, where they will be examined by forensics experts. Remains militants handed over on Tuesday did not match either of the last two hostages in Gaza.\n\nThe return of all the hostages taken on the Oct. 7, 2023, attack that started the war is a key element of the first phase of the ceasefire that began in October. In exchange, Israel has been releasing Palestinian prisoners.\n\nUnder the terms of the ceasefire, the long-closed Rafah crossing is to be opened for medical evacuations and travel to and from Gaza. The World Health Organization says there are more than 16,500 sick and wounded people who need to leave Gaza for medical care.\n\nIsrael says it will open the Rafah crossing in coming days to allow Palestinians to exit from Gaza to Egypt. AP correspondent Naeun Kim reports.\n\nIt was not immediately clear when the border crossing would be opened, however.\n\nEgypt wants Palestinians to be able to return to Gaza through the crossing and says it would only be opened if movement is allowed both ways. Israel says Palestinians will not be able to return to Gaza through the crossing until the last hostages’ remains are returned from Gaza.\n\nOnce the last hostages’ remains are returned and Israel releases more Palestinian prisoners in exchange, the U.S.-backed ceasefire plan is supposed to advance to the next phases, which call for creating an international stabilization force, forming a technocratic Palestinian government and disarming Hamas.\n\nEarlier on Wednesday, Prime Minister Benjamin Netanyahu said forensic testing showed that partial remains returned by militants on Tuesday did not match either of the hostages still in Gaza. Palestinian militants later said they had found more remains in northern Gaza and turned them over to the Red Cross, which is acting as an intermediary.\n\nThe two hostage bodies still in Gaza are Israeli Ran Gvili and Thai national Sudthisak Rinthalak. Gvili was an Israeli police officer who helped people escape from the Nova music festival during the Oct. 7 attack and was killed fighting at another location. Sudthisak Rinthalak was an agricultural worker from Thailand who had been employed at Kibbutz Be’eri, one of the hardest-hit communities in the attack.\n\nA total of 31 workers from Thailand were abducted, the largest group of foreigners to be held in captivity. Most of them were released in the first and second ceasefires. The Thai Foreign Ministry has said in addition to the hostages, 46 Thais have been killed during the war.\n\nThe Israeli military body charged with facilitating aid to Gaza, COGAT, said Israel would coordinate with Egypt on the exit of Palestinians, under the supervision of a mission from the European Union.\n\nThose wishing to leave Gaza will require “Israeli security approval,” COGAT said.\n\nThe U.S. State Department’s Bureau of Near-Eastern Affairs, writing on X, cast the opening of the crossing as a measure that would afford “the most vulnerable Gazans” access to better medical care.\n\nPalestinians who want to leave Gaza will be able to move through Rafah if Egypt agrees to receive them, Israeli government spokesperson Shosh Bedrosian said. But the crossing won’t be open for Palestinians seeking to return to Gaza until all of the hostages in the territory are returned to Israel, she said.\n\nCiting an unnamed Egyptian official, Egypt’s State Information Service said, if an agreement is reached, the crossing will be opened for travel in both directions in accordance with the ceasefire plan advanced by U.S. President Donald Trump.\n\nEgypt fears that Palestinians allowed to leave Gaza might not be able to return.\n\nEgyptian President Abdel-Fattah el-Sissi has warned that Israel might prompt an exodus from Gaza as a way to permanently expel people and “eliminate the Palestinian cause” for statehood. More than 100,000 Palestinians that left Gaza after the war started, including those wounded in the conflict, have been living in Egypt, according to Egyptian authorities.\n\nThe Rafah crossing was sealed off in May 2024 when Israel’s military invaded the area. It was briefly opened in February this year as part of a previous ceasefire for the evacuation of sick and wounded Palestinians.\n\nIn the southern city of Rafah, four Israeli soldiers were injured, one seriously, after being attacked by militants who emerged from an underground tunnel, the Israeli military said. The military called the attack in an area under its control a violation of the ceasefire, and said it responded by returning fire.\n\nIn Gaza City, a Palestinian man was killed by Israeli fire, a hospital said, marking the latest reported Palestinian fatality in the territory.\n\nIsraeli forces shot the 46-year-old man in the Zeitoun neighborhood, according to the Al-Ahli hospital, which received the body. Israel’s military did not immediately respond to a request for comment.\n\nThe hospital said the man was shot while in the “safe zone,” which, under the terms of the ceasefire, is not controlled by the Israeli military. The Gaza Health Ministry says more than 360 Palestinians have been killed across Gaza since the ceasefire took effect on Oct. 11.\n\nTwenty living hostages and the remains of 26 others have been returned to Israel since the ceasefire began in early October.\n\nIsrael has been releasing 15 Palestinian bodies for the remains of each hostage as part of the ceasefire agreement. The Gaza Health Ministry said the total number of remains received so far is 330. Health officials in Gaza have said they have only been able to identify a fraction of the bodies handed over by Israel, and the process is complicated by a lack of DNA testing kits.\n\nThe exchanges have gone ahead even as Israel and Hamas have accused each other of violating other terms of the deal. Israeli officials have accused Hamas of handing over partial remains in some instances and staging the discovery of bodies in others.\n\nHamas has accused Israel of opening fire on civilians and restricting the flow of humanitarian aid into the territory.\n\nThe ceasefire aims to wind down the war that was triggered by the Hamas-led attack on southern Israel, which killed about 1,200 people and saw 251 taken hostage.\n\nThe Gaza Health ministry says the total Palestinian death toll from the war is over 70,100. The ministry does not distinguish between militants and civilians, though it says roughly half of those killed have been women and children. The ministry operates under the Hamas-run government. It is staffed by medical professionals and maintains detailed records viewed as generally reliable by the international community.\n\n___\n\nMagdy reported from Cairo. Abby Sewell contributed from Beirut.",
      "articleItem": {
        "title": "Israel launches airstrike in southern Gaza after earlier attack by militants wounded 5 soldiers",
        "url": "https://apnews.com/article/israel-palestinians-west-bank-gaza-hamas-hostages-1daaa29f923993fe794460309e73da80",
        "imageUrl": "https://dims.apnews.com/dims4/default/c0e660b/2147483647/strip/true/crop/8640x5760+0+0/resize/567x378!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F64%2Fb9%2F4d400def61c90686ea71b080c70a%2F7a90858f7250487d8daeb0ca233b5e80"
      },
      "scrapedAt": "2025-12-03T21:02:05.934Z",
      "success": true,
      "origin": "apNewsWorld"
    },
    {
      "url": "https://www.cbsnews.com/news/trump-new-fuel-economy-standards-mpg-biden/",
      "title": "Trump administration moves to roll back fuel economy standards set under Biden",
      "excerpt": "The Trump administration proposed rules that would weaken fuel economy standards for vehicles set under President Biden in 2024.",
      "category": "politics",
      "body": "Updated on:  December 3, 2025 / 3:59 PM EST\n            / CBS News\n\nThe Trump administration is proposing new fuel economy standards for vehicles that would roll back efficiency rules implemented under former President Biden.\n\nUnder the Transportation Department proposal, which was unveiled at a White House event on Wednesday, automakers would need to meet less stringent vehicle mileage requirements.\n\nFederal fuel economy rules are overseen by the National Highway Traffic Safety Administration (NHTSA) under what's known as the CAFE (Corporate Average Fuel Economy) Standards. Enacted by Congress in 1975, the regulations stipulate how many miles vehicles must be able to drive on a gallon of fuel, with specific standards for light-duty vehicles, as well as medium- and heavy-duty trucks.\n\nThe rules aim to reduce greenhouse gas emissions and help consumers save money on gas, according to the Transportation Department. Critics of the fuel standards have long argued they are costly for automakers, which must make technological improvements to reduce fuel usage, raising vehicle prices.\n\nIf finalized, the plan would relax fuel economy standards by setting the industry average for light-duty vehicles at roughly 34.5 miles per gallon through the 2031 model year, lower than the 50 miles per gallon outlined by a Biden-era rule.\n\n\"We're making it easier for every family to afford high-quality cars,\" President Trump said from the Oval Office.\n\nOn Wednesday, Transportation Secretary Sean Duffy said the previous rules drove up the cost of new cars and were \"completely unattainable\" for automakers. He initially directed NHTSA to review the CAFE regulations in January.\n\nMr. Trump was joined at Wednesday's event by senior auto industry executives. In a statement shared with CBS News, Stellantis CEO Antonioa Filosa expressed support for the proposed fuel efficiency rules, saying the initiative would realign the CAFE standards \"with real-world market conditions as part of its wider vision for a growing U.S. automotive industry.\"\n\nGeneral Motors also backed the proposed fuel economy standards, which would need to undergo an official rulemaking process before being adopted.\n\n\"GM supports the goals of NHTSA's proposed CAFE rule and its intention to better align fuel economy standards with market realities. We have long advocated for one national standard that upholds customer choice and provides the auto industry long-term stability,\" a spokesperson for the automaker said in a statement.\n\nThe fuel economy proposal would roll back a rule finalized in June 2024 under the Biden administration aimed at raising the minimum gas mileage for passenger cars and light trucks by model year 2031.\n\nAt the time, NHTSA said the new regulations would save Americans $23 billion at the gas pump and reduce pollution. Burning gas for vehicles is a major contributor to carbon emissions, which scientists have linked to climate change.\n\nThe rules were also intended to spur automakers to produce more electric vehicles, a key Biden administration priority for the nation's transportation sector.\n\nThe Center for Biological Diversity, a nonprofit organization that works to protect endangered species, said the Transportation Department proposal will increase the country's oil consumption and undermine the competitiveness of U.S. automakers.\n\n\"Trump's action will feed America's destructive use of oil, while hamstringing us in the green tech race against Chinese and other foreign carmakers,\" said Dan Becker, director of the Center for Biological Diversity's Safe Climate Transport Campaign.\n\nEdited by\n                                        \n                                  Alain  Sherter\n\nThe Associated  Press\n                  \n        contributed to this report.\n\n© 2025 CBS Interactive Inc. All Rights Reserved.",
      "articleItem": {
        "title": "Trump moves to roll back fuel economy standards set under Biden",
        "url": "https://www.cbsnews.com/news/trump-new-fuel-economy-standards-mpg-biden/",
        "imageUrl": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/12/03/1d0f2fc1-693c-4769-8b78-4c32e0856ef7/thumbnail/640x360/066e51b225e26308bc38da0f2e6ac212/gettyimages-2248020840.jpg#"
      },
      "scrapedAt": "2025-12-03T21:02:06.503Z",
      "success": true,
      "origin": "cbsPolitics"
    },
    {
      "url": "https://www.yahoo.com/news/articles/japanese-american-draft-dodgers-wwii-205458268.html",
      "title": "The Japanese American ‘draft dodgers’ of WWII",
      "excerpt": "In 1944, a few hundred U.S.-born Japanese Americans defied their draft orders, citing the constitutional rights of the interned Nisei.",
      "category": "politics",
      "body": "In the wake of the Dec. 7, 1941, attack on Pearl Harbor, President Franklin D. Roosevelt authorized the mass removal from the West Coast of “all persons deemed a threat to national security.”\n\nThe policy, Executive Order 9066, was incited by widespread anti-Japanese American discrimination and set the stage for mass eviction, evacuation and incarceration of 120,000 first-generation Japanese immigrants, known as Issei, and Nisei, who were U.S. citizens by birthright.\n\nThey were penned into camps across desolate regions in California, Arizona, Wyoming and Colorado, among other states.\n\nTo add to the degradation, Americans of Japanese descent were initially denied the opportunity to serve their country. That changed, however, in 1944, as the United States — pulled into a world war — needed increasing manpower.\n\nDespite the betrayal by their own country, nearly 33,000 Japanese Americans served in the armed forces, making up the 442nd Regimental Combat Team — a formation that, to this day, remains the most decorated Army combat unit.\n\nThe 442nd’s story, including that of Medal of Honor recipient and eventual Hawaii state Senator Daniel Inouye, is known. Less so, however, is the tale of a few hundred Nisei who defied the order to report for military duty.\n\nDozens were jailed for their actions but ultimately freed either by court order or presidential pardon.\n\nA small group of resistors, led by Frank Emi and Kiyoshi Okamoto at Heart Mountain Relocation Center in Wyoming, argued that they could not, and would not, serve until the status of their citizenship had been clarified, according to the National Archives.\n\nAt first, Emi, like many others, accepted internment.\n\n“Shikata ga nai” — or “it cannot be helped” — was a phrase often bandied about the camp.\n\nHowever, after several years of scorching summer heat, dust storms and bitter winters, all while under armed guard, the arrival of draft orders in 1944 sent men like Emi and Okamoto to the brink.\n\n“We could either tuck our tails between our legs like a beaten dog or stand up like free men, [imbued] with American ideals, and fight for justice,” Emi told the Los Angeles Times in 1993.\n\nIn response, the men began the Fair Play Committee to support the constitutional rights of interned Nisei. The group, made up of several hundred men, refused to serve as soldiers while their families were imprisoned in horse stables and tar paper barracks.\n\nEarly questionnaires sent by the U.S. government in 1943 had already drawn the ire of men like Emi, who resented such questions as: “Are you willing to serve in the armed forces of the United States on combat duty, wherever ordered?” and “Will you swear unqualified allegiance to the United States of America and faithfully defend the United States from any or all attack…?”\n\nAccording to the Los Angeles Times, Emi’s response to both questions was the same.\n\n“Under the present conditions and circumstances, I am unable to answer this question,” he stated.\n\nEmi and his brother, Art, urged other interned Nisei to answer similarly, but were often derided as “no-no boys,” with many fearing this open rebellion would further damage the reputation of Japanese Americans.\n\nStill, some 300 men across 10 camps refused induction — with one in nine Heart Mountain men shunning the order.\n\n“We were very angry and frustrated at the injustice of what the government did to us. For a person raised in the American tradition — not the Japanese tradition of bowing to authority — we felt we had to speak out,” Emi told the Times.\n\nAnd speak out they did.\n\n“I believe this draft law was not intended for me,” Okamoto wrote in a draft letter. “I was evacuated without due process of law; I am concentrated without due process of law; I was deported from my home state without due process of law; I am detained within barbed wire fences by force of military threat without due process of law; I exist within this militarily guarded enclosure as a Citizen without a Country without due process of law; the whole transaction effecting me is based upon unconstitutional interpretations without due process of law.”\n\nEmi and Okamoto quoted the Constitution and Abraham Lincoln in subsequent bulletins posted around the camp.\n\nThe third bulletin, dated March 1, 1944, opened with the words of the Bill of Rights:\n\n“No person shall be deprived of life, liberty, or property, without due process of law, nor private property be taken for public use without just compensation.” —Article V of the U.S. Bill of Rights.\n\n“Neither slavery nor involuntary solitude, except as punishment for crime whereof the party shall have been duly convicted, shall exist within the United States, or any place subject to their jurisdiction.” —Article XIII of the U.S. Bill of Rights.\n\nNational Archives\n\nThe men then ended the bulletin by stating their protest was an act of just civil disobedience due to the denial of their inalienable rights as U.S. citizens:\n\nThus, the members of the FPC unanimously decided at their last open meeting that until we are restored all our rights, all discriminatory features of the Selective Service abolished, and measures are taken to remedy the past injustices thru Judicial pronouncement or Congressional act, we feel that the present program of drafting us from this concentration camp is unjust, unconstitutional, and against all principles of civilized usage. Therefore, WE MEMBERS OF THE FAIR PLAY COMMITTEE HEREBY REFUSE TO GO TO THE PHYSICAL EXAMINATION OR TO THE INDUCTION IF OR WHEN WE ARE CALLED IN ORDER TO CONTEST THE ISSUE.\n\nNational Archives\n\nAt the time, only one journalist, James Omura, from the Denver-based outlet Rocky Shimpo, reported on the protests and subsequent arrests.\n\nOn June 12, 1944, 63 resisters from Heart Mountain were tried for draft evasion. Twenty-two more would later resist.\n\nAt the mass trial, all of the men were convicted and sentenced to three years in federal prison. They were also denied a hearing before the Supreme Court.\n\nIn 1945, the 10th Circuit Court of Appeals overturned the convictions of seven FPC leaders, according to the National Archives. The court ruled their jury improperly ignored civil disobedience as a defense.\n\nOmura, himself a Japanese American, was indicted for conspiracy to counsel draft evasion. He was eventually acquitted under First Amendment rights of the press.\n\nSome of the remaining men were released in 1946, with the rest set free during the Christmas season of 1947, when President Harry Truman signed Proclamation 2762, pardoning 1,523 individuals convicted of violating the Selective Training and Service Act of 1940.\n\nThe resistance, however, divided Japanese Americans, with many, especially Nisei World War II veterans, calling it shameful or traitorous.\n\n“I always thought those guys were a bunch of chickens,” veteran George Yoshinaga said in a 1993 interview, adding that if all of the Japanese Americans had refused, most Americans would have called them “disloyal.”\n\nEmi and the other resistors, though, remained steadfast in their beliefs, according to fellow prisoner Yosh Kuromiya.\n\n“[Emi] was quite adamant about it to the very end,” Kuromiya told the Los Angeles Times in 2010. “It was a matter of principle.”",
      "articleItem": {
        "title": "Military TimesThe Japanese American ‘draft dodgers’ of WWII",
        "url": "https://www.yahoo.com/news/articles/japanese-american-draft-dodgers-wwii-205458268.html",
        "imageUrl": "https://s.yimg.com/lo/mysterio/api/98E0B9A18913E92C0379A7C7D246C6AA1E127E28383406C63EBF58BABE0AA85E/subgraphmysterio/smartcrop_w1000_h562_faces;quality_95/https:%2F%2Fmedia.zenfs.com%2Fen%2Fmilitary_times_968%2F587dfc95769e7de8774d35cad4862408"
      },
      "scrapedAt": "2025-12-03T21:02:10.781Z",
      "success": true,
      "origin": "yahooPoliticsNews"
    },
    {
      "url": "https://techcrunch.com/2025/12/02/amazon-challenges-competitors-with-on-premises-nvidia-ai-factories/",
      "title": "Amazon challenges competitors with on-premises Nvidia ‘AI Factories’",
      "excerpt": "If the product name sounds familiar, it should. It's a collab with Nvidia that combines AWS tech with the chip maker's tech.",
      "category": "tech",
      "body": "Amazon announced a new product Tuesday called “AI Factories” that allows big corporations and governments to run its AI systems in their own data centers. Or as AWS puts it: Customers supply the power and the data center, and AWS plunks in the AI system, manages it, and can tie it into other AWS cloud services.\n\nThe idea is to cater to companies and governments concerned with data sovereignty, or absolute control over their data so it can’t wind up in a competitor’s or foreign adversary’s hands. An on-prem AI Factory means not sending their data to a model maker and not even sharing the hardware.\n\nIf that product name sounds familiar, it should. That’s what Nvidia calls its hardware systems that are chock-full of tools needed to run AI, from its GPU chips to its networking tech. This AWS AI Factory is, in fact, a collaboration with Nvidia, both companies say.\n\nIn this case, the AWS Factory will use a combination of AWS and Nvidia technology. Companies that deploy these systems can opt for Nvidia’s latest Blackwell GPUs or Amazon’s new Trainium3 chip. It uses AWS’ homegrown networking, storage, databases, and security and can tap into Amazon Bedrock — the AI model selection and management service, and AWS SageMaker AI, the model building and training tool.\n\nInterestingly, AWS is far from the only giant cloud provider installing Nvidia AI Factories. In October, Microsoft showed off its first of many-to-come AI Factories rolling out into its global data centers to run OpenAI workloads. Microsoft didn’t announce at the time that these extreme machines would be available for private clouds. Instead, Microsoft highlighted how it was leaning on a host of Nvidia AI Factory data center tech to build and connect its new “AI Superfactories,” aka new state-of-the-art data centers being built in Wisconsin and Georgia.\n\nLast month, Microsoft also outlined the data centers and cloud services that would be built in local countries to address the data sovereignty issue. To be fair, its options also include “Azure Local,” Microsoft’s own managed hardware that could be installed on customer sites.\n\nStill, it is a bit ironic that AI is causing the biggest cloud providers to invest so heavily in corporate private data centers and hybrid clouds like it’s 2009 all over again.\n\nCheck out the latest reveals on everything from agentic AI and cloud infrastructure to security and much more from the flagship Amazon Web Services event in Las Vegas. This video is brought to you in partnership with AWS.\n\nTopics\n\nVenture Editor\n\nTonight! StrictlyVC concludes its 2025 series with an exclusive event featuring deep tech insights from leading backers builders such as Pat Gelsinger, Max Hodak, Nicholas Kelez, and more. Plus, opportunities for high-quality networking.Last chance to get front row access to fresh, candid insights on the future of deep tech. Don’t miss it!\n\nTonight, the future of deep tech will be explained to you at StrictlyVC Palo Alto\n\nAmazon releases an impressive new AI chip and teases an Nvidia-friendly roadmap\n\nApple just named a new AI chief with Google and Microsoft expertise, as John Giannandrea steps down\n\nNew York state law takes aim at personalized pricing\n\nHow OpenAI and Google see AI changing go-to-market strategies\n\nAnduril’s autonomous weapons stumble in tests and combat, WSJ reports\n\nThis Thanksgiving’s real drama may be Michael Burry versus Nvidia",
      "articleItem": {
        "title": "Amazon challenges competitors with on-premises Nvidia ‘AI Factories’",
        "url": "https://techcrunch.com/2025/12/02/amazon-challenges-competitors-with-on-premises-nvidia-ai-factories/"
      },
      "scrapedAt": "2025-12-03T21:02:10.954Z",
      "success": true,
      "origin": "techCrunch"
    }
  ]
}