{
  "runId": "run4",
  "collectedAt": "2025-12-03T21:02:06.925Z",
  "totalArticles": 4,
  "articles": [
    {
      "url": "https://apnews.com/article/new-orleans-louisiana-immigration-d0e4de8cd5bf9c7ca59ae38d803f93f2",
      "title": "Federal agents launch immigration crackdown in New Orleans",
      "excerpt": "The Department of Homeland Security is launching a new immigration crackdown in New Orleans. A Homeland Security official says the operation that got underway Wednesday targets violent criminals. The crackdown is the latest expansion of the Trump administration’s immigration sweeps that have unfolded in other U.S. cities. Immigration officials have blanketed big cities and small towns across the nation since January while carrying out President Donald Trump’s aggressive mass deportation efforts. In New Orleans, immigration lawyers say they have been inundated with calls and some businesses have posted signs barring federal agents from entry. Louisiana's Republican governor welcomes the crackdown.",
      "category": "us",
      "body": "NEW ORLEANS (AP) — Federal agents began hitting the streets of New Orleans on Wednesday in the Trump administration’s latest immigration crackdown across the U.S., looking to round up immigrants accused of violent crimes, a Homeland Security official said.\n\nThe operation is targeting immigrants who were released after arrests for crimes such as home invasion, armed robbery and rape, Homeland Security Department Assistant Secretary Tricia McLaughlin said in a statement.\n\nImmigration officials have blanketed big cities and small towns across the nation since January while carrying out Republican President Donald Trump ’s aggressive mass deportation efforts.\n\nFederal agents have launched high-profile immigration crackdowns in cities including Chicago and Charlotte, North Carolina. Another operation is expected in the coming days in Minnesota, targeting Somali immigrants. The enforcement tactics have been met with protests and lawsuits.\n\nThere are more than 200 Customs and Border Protection and U.S. Immigration and Customs Enforcement officials working on the New Orleans operation, according to a U.S. official who was not authorized to discuss the matter publicly. The objective is to make as many arrests as possible over at least 60 days.\n\nThe operation is being called “Catahoula Crunch,” continuing Homeland Security’s pattern of assigning region-specific names to the crackdowns. Planning documents obtained by the AP referred to the Louisiana operation as “Swamp Sweep.” The Catahoula leopard dog is Louisiana’s official state dog.\n\nFear and uncertainty have weighed heavy on the immigrant community in New Orleans — a one-of-a-kind American city known as the birthplace of jazz and for its Mardi Gras celebrations and rich blend of French, Spanish, African and Native American cultures.\n\nA witness saw federal agents chase down and arrest people in the parking lot of a New Orleans home improvement store Wednesday morning. “They tried to run across the street but they caught them,” said Jody Styles, who was at a gas station near the Lowe’s when authorities converged.\n\nSome businesses in heavily-Hispanic areas have shuttered, saying they will remain closed until the operation is over. Others businesses have signs on their doors barring federal immigration agents from entering.\n\nPosted on the door of Los Hondureños, a restaurant in nearby Kenner, was a handwritten note saying it was closing until further notice. It ended: “Thank you, The Hondurans.”\n\nTwenty years ago, New Orleans relied on thousands of Latino workers who helped rebuild after Hurricane Katrina. But it has not escaped the escalating tensions over immigration.\n\nEarlier this week, dozens of people took to the streets, despite rain and chilly temperatures, to protest the imminent crackdown. On Tuesday, more than 200 people filled a local church for a training on their legal rights and how to safely record federal immigration agents’ activity, including anticipated arrests.\n\nSome immigration lawyers say they have been inundated with calls from people trying to prepare for the federal crackdown.\n\nAs the operation began, residents took to social media, posting in neighborhood groups about the crackdown, including photos and addresses of possible sightings. Some desperately tried to decipher what information was accurate.\n\nLouisiana Gov. Republican Gov. Jeff Landry has singled out crimes in which the suspect’s immigration status is in question, such as the killing of a French Quarter tour guide by a group that included a Honduran man who entered the country illegally.\n\nThe Trump administration also has taken aim at the city’s immigration policies.\n\n“Sanctuary policies endanger American communities by releasing illegal criminal aliens and forcing DHS law enforcement to risk their lives to remove criminal illegal aliens that should have never been put back on the streets,” McLaughlin said.\n\nAttorney General Pam Bondi has accused New Orleans of undermining federal immigration enforcement. The Department of Justice includes New Orleans in a list of 18 cities it considers to be providing sanctuary to immigrants without legal status.\n\nNew Orleans officials deny the city’s policies thwart federal immigration enforcement. City police Chief Anne Kirkpatrick has said she considers immigration enforcement to be a civil matter outside her jurisdiction.\n\nLouisiana has been preparing for weeks for an immigration crackdown. The governor, a close Trump ally who has moved to align state policy with the White House’s enforcement agenda, said Wednesday that the crackdown will target the “worst of the worst, criminal illegal aliens that have broken the law.”\n\n“It started today and it’s going to run until we get them all off the street,” Landry said during an interview on the Walton & Johnson radio show.\n\nIn addition to the deployment of federal immigration agents, Landry said he expects National Guard members to arrive in New Orleans before Christmas to join the efforts to combat crime.\n\nThe immigration operation’s planning documents showed border agents intended to launch a monthslong crackdown in southeast Louisiana and into Mississippi.\n\nThe deployment, which aims to arrest 5,000 people, was expected to be led by the Border Patrol, whose agents have drawn scrutiny for aggressive tactics in other cities, including Chicago and Los Angeles.\n\nLouisiana State Police troopers and local FBI agents will work together to protect federal officers and stop attempts to block law enforcement actions during the crackdown, both agencies announced.\n\n___\n\nCline reported from Baton Rouge. Associated Press journalists Elliot Spagat in San Diego; John Seewer in Toledo, Ohio; and Stephen Smith in Kenner, Louisiana, contributed.\n\n___\n\nBrook is a corps member for The Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues.",
      "articleItem": {
        "title": "Federal agents launch immigration crackdown in New Orleans",
        "url": "https://apnews.com/article/new-orleans-louisiana-immigration-d0e4de8cd5bf9c7ca59ae38d803f93f2",
        "imageUrl": "https://dims.apnews.com/dims4/default/eca7b3f/2147483647/strip/true/crop/8640x5760+0+0/resize/567x378!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F9b%2F83%2F0d01f5faf177b3e183c219f66d1b%2Fdd8e8c88f3ad4a5aac40b2da4338803e"
      },
      "scrapedAt": "2025-12-03T21:02:02.634Z",
      "success": true,
      "origin": "apNewsUS"
    },
    {
      "url": "https://www.yahoo.com/news/articles/pentagon-watchdog-finds-hegseth-signal-184806181.html",
      "title": "Pentagon watchdog finds Hegseth’s use of Signal posed risk to US personnel, AP sources say",
      "excerpt": "The Pentagon’s watchdog found that Defense Secretary Pete Hegseth put U.S. personnel and their mission at risk when he used the Signal messaging app to...",
      "category": "world",
      "body": "WASHINGTON (AP) — The Pentagon’s watchdog found that Defense Secretary Pete Hegseth put U.S. personnel and their mission at risk when he used the Signal messaging app to convey sensitive information about a military strike against Yemen's Houthi militants, two people familiar with the findings said Wednesday.\n\nHegseth, however, has the ability to declassify material and the report did not find he did so improperly, according to one of the people familiar with the findings who spoke on condition of anonymity to discuss the information. That person also said the report concluded that Hegseth violated Pentagon policy by using his personal device for official business and it recommended better training for all Pentagon officials.\n\nHegseth declined to sit for an interview with the Pentagon's inspector general but provided a written statement, that person said. The defense secretary asserted that he was permitted to declassify information as he saw fit and only communicated details he thought would not endanger the mission.\n\nThe initial findings ramp up the pressure on the former Fox News Channel host after lawmakers had called for the independent inquiry into his use of the commercially available app. Lawmakers also just opened investigations into a news report that a follow-up strike on an alleged drug-smuggling boat in the Caribbean Sea in September killed survivors after Hegseth issued a verbal order to “kill everybody.\"\n\nHegseth defended the strike as emerging in the “fog of war,” saying he didn’t see any survivors but also “didn’t stick around” for the rest of the mission and that the admiral in charge “made the right call” in ordering the second strike. He also did not admit fault following the revelations that he discussed sensitive military plans on Signal, asserting that the information was unclassified.\n\nJournalist was added to a chat where sensitive plans were shared\n\nIn at least two separate Signal chats, Hegseth provided the exact timings of warplane launches and when bombs would drop — before the men and women carrying out those attacks on behalf of the United States were airborne.\n\nHegseth’s use of the app came to light when a journalist, Jeffrey Goldberg of The Atlantic, was inadvertently added to a Signal text chain by then-national security adviser Mike Waltz. It included Vice President JD Vance, Secretary of State Marco Rubio, Director of National Intelligence Tulsi Gabbard and others, brought together to discuss March 15 military operations against the Iran-backed Houthis.\n\nHegseth had created another Signal chat with 13 people that included his wife and brother where he shared similar details of the same strike, The Associated Press reported.\n\nSignal is encrypted but is not authorized for carrying classified information and is not part of the Pentagon’s secure communications network.\n\nHegseth previously has said none of the information shared in the chats was classified. Multiple current and former military officials have told the AP there was no way details with that specificity, especially before a strike took place, would have been OK to share on an unsecured device.\n\nThe review was delivered to lawmakers, who were able to review the report in a classified facility at the Capitol. A partially redacted version of the report was expected to be released publicly later this week.\n\nHegseth said he viewed the investigation as a partisan exercise and did not trust the inspector general, according to one of the people familiar with the report’s findings. The review had to rely on screenshots of the Signal chat published by the Atlantic because Hegseth could not provide more than a small handful of his Signal messages, the person said.\n\nWhen asked about the investigation in August, Pentagon press secretary Kingsley Wilson told reporters that \"we believe that this is a witch hunt and a total sham and being conducted in bad faith.”\n\nThe Pentagon did not immediately respond Wednesday to a request for comment.\n\nLawmakers had called for inspector general to investigate\n\nThe revelations sparked intense scrutiny, with Democratic lawmakers and a small number of Republicans saying Hegseth posting the information to the Signal chats before the military jets had reached their targets potentially put those pilots’ lives at risk. They said lower-ranking members of the military would have been fired for such a lapse.\n\nThe inspector general opened its investigation into Hegseth at the request of the Republican chairman of the Senate Armed Services Committee, Sen. Roger Wicker of Mississippi, and the committee’s top Democrat, Sen. Jack Reed of Rhode Island.\n\nSome veterans and military families also raised concerns, citing the strict security protocols they must follow to protect sensitive information.\n\nIt all ties back to the campaign against Yemen’s Houthis\n\nThe Houthi rebels had started launching missile and drone attacks against commercial and military ships in late 2023 in what their leadership had described as an effort to end Israel’s offensive against Hamas in the Gaza Strip. Their campaign greatly reduced the flow of trade through the Red Sea corridor, which typically sees $1 trillion of goods move through it annually.\n\nThe U.S.-led campaign against the Houthis in 2024 turned into the most intense running sea battle the Navy had faced since World War II.\n\nA ceasefire in the Israel-Hamas war had begun in January before falling apart in March. The U.S. then launched a broad assault against the Houthis that ended weeks later when Trump said they pledged to stop attacking ships. The latest Gaza ceasefire began in October.\n\nFollowing the disclosure of Hegseth’s Signal chat that included the Atlantic’s editor, the magazine released the entire thread in late March. Hegseth had posted multiple details about an impending strike, using military language and laying out when a “strike window” starts, where a “target terrorist” was located, the time elements around the attack and when various weapons and aircraft would be used in the strike. He mentioned that the U.S. was “currently clean” on operational security.\n\nHegseth told Fox News Channel in April that what he shared over Signal was “informal, unclassified coordinations, for media coordinations and other things.”\n\nDuring a congressional hearing in June, Hegseth was pressed multiple times by lawmakers over whether he shared classified information and if he should face accountability if he did.\n\nRep. Seth Moulton, a Massachusetts Democrat and Marine veteran, asked Hegseth whether he would hold himself accountable if the inspector general found that he placed classified information on Signal.\n\nHegseth would not directly say, only noting that he serves “at the pleasure of the president.”\n\n___\n\nAssociated Press writer Stephen Groves and Konstantin Toropin contributed to this report.",
      "articleItem": {
        "title": "WorldAssociated Press836Pentagon watchdog finds Hegseth’s use of Signal posed risk to US personnel, AP sources say",
        "url": "https://www.yahoo.com/news/articles/pentagon-watchdog-finds-hegseth-signal-184806181.html",
        "imageUrl": "https://s.yimg.com/lo/mysterio/api/B6FE17870C2149A2A1F7DE6AFE63C448C30D9F36455B2CDAAEBEF92F35B44784/subgraphmysterio/smartcrop_w1000_h562_faces;quality_95/https:%2F%2Fmedia.zenfs.com%2Fen%2Fap.org%2F943a14e0b1e97048687909967296a870"
      },
      "scrapedAt": "2025-12-03T21:02:06.888Z",
      "success": true,
      "origin": "yahooWorldNews"
    },
    {
      "url": "https://apnews.com/article/hegseth-signal-war-plans-inspector-general-5a315349f428e22e5bf6a424287738eb",
      "title": "Pentagon watchdog finds Hegseth’s use of Signal posed risk to US personnel, AP sources say",
      "excerpt": "The Pentagon’s watchdog has found that Defense Secretary Pete Hegseth put U.S. personnel and their mission at risk when he used the Signal messaging app to convey sensitive information about a military strike against Houthi militants in Yemen. That's according to two people familiar with the findings on Wednesday. One of the people says Hegseth, however, has the ability to declassify material and the report did not find he did so improperly. Hegseth denied posting classified information regarding plans for a military strike against Houthi militants in Yemen in March. The review by the Pentagon inspector general’s office was delivered to lawmakers, who were able to review the report in a classified facility at the Capitol.",
      "category": "politics",
      "body": "WASHINGTON (AP) — The Pentagon’s watchdog found that Defense Secretary Pete Hegseth put U.S. personnel and their mission at risk when he used the Signal messaging app to convey sensitive information about a military strike against Yemen’s Houthi militants, two people familiar with the findings said Wednesday.\n\nHegseth, however, has the ability to declassify material and the report did not find he did so improperly, according to one of the people familiar with the findings who spoke on condition of anonymity to discuss the information. That person also said the report concluded that Hegseth violated Pentagon policy by using his personal device for official business and it recommended better training for all Pentagon officials.\n\nFrom AP’s Standards and Stylebook teams: The AP is using anonymous sourcing to provide information for this story. Click here to hear Washington Bureau Chief Anna Johnson explain AP’s policy on the use of anonymous sources.\n\nHegseth declined to sit for an interview with the Pentagon’s inspector general but provided a written statement, that person said. The defense secretary asserted that he was permitted to declassify information as he saw fit and only communicated details he thought would not endanger the mission.\n\nThe initial findings ramp up the pressure on the former Fox News Channel host after lawmakers had called for the independent inquiry into his use of the commercially available app. Lawmakers also just opened investigations into a news report that a follow-up strike on an alleged drug-smuggling boat in the Caribbean Sea in September killed survivors after Hegseth issued a verbal order to “kill everybody.”\n\nHegseth defended the strike as emerging in the “fog of war,” saying he didn’t see any survivors but also “didn’t stick around” for the rest of the mission and that the admiral in charge “made the right call” in ordering the second strike. He also did not admit fault following the revelations that he discussed sensitive military plans on Signal, asserting that the information was unclassified.\n\nIn at least two separate Signal chats, Hegseth provided the exact timings of warplane launches and when bombs would drop — before the men and women carrying out those attacks on behalf of the United States were airborne.\n\nHegseth’s use of the app came to light when a journalist, Jeffrey Goldberg of The Atlantic, was inadvertently added to a Signal text chain by then-national security adviser Mike Waltz. It included Vice President JD Vance, Secretary of State Marco Rubio, Director of National Intelligence Tulsi Gabbard and others, brought together to discuss March 15 military operations against the Iran-backed Houthis.\n\nHegseth had created another Signal chat with 13 people that included his wife and brother where he shared similar details of the same strike, The Associated Press reported.\n\nSignal is encrypted but is not authorized for carrying classified information and is not part of the Pentagon’s secure communications network.\n\nHegseth previously has said none of the information shared in the chats was classified. Multiple current and former military officials have told the AP there was no way details with that specificity, especially before a strike took place, would have been OK to share on an unsecured device.\n\nThe review was delivered to lawmakers, who were able to review the report in a classified facility at the Capitol. A partially redacted version of the report was expected to be released publicly later this week.\n\nHegseth said he viewed the investigation as a partisan exercise and did not trust the inspector general, according to one of the people familiar with the report’s findings. The review had to rely on screenshots of the Signal chat published by the Atlantic because Hegseth could not provide more than a small handful of his Signal messages, the person said.\n\nWhen asked about the investigation in August, Pentagon press secretary Kingsley Wilson told reporters that “we believe that this is a witch hunt and a total sham and being conducted in bad faith.”\n\nThe Pentagon did not immediately respond Wednesday to a request for comment.\n\nThe revelations sparked intense scrutiny, with Democratic lawmakers and a small number of Republicans saying Hegseth posting the information to the Signal chats before the military jets had reached their targets potentially put those pilots’ lives at risk. They said lower-ranking members of the military would have been fired for such a lapse.\n\nThe inspector general opened its investigation into Hegseth at the request of the Republican chairman of the Senate Armed Services Committee, Sen. Roger Wicker of Mississippi, and the committee’s top Democrat, Sen. Jack Reed of Rhode Island.\n\nSome veterans and military families also raised concerns, citing the strict security protocols they must follow to protect sensitive information.\n\nThe Houthi rebels had started launching missile and drone attacks against commercial and military ships in late 2023 in what their leadership had described as an effort to end Israel’s offensive against Hamas in the Gaza Strip. Their campaign greatly reduced the flow of trade through the Red Sea corridor, which typically sees $1 trillion of goods move through it annually.\n\nThe U.S.-led campaign against the Houthis in 2024 turned into the most intense running sea battle the Navy had faced since World War II.\n\nA ceasefire in the Israel-Hamas war had begun in January before falling apart in March. The U.S. then launched a broad assault against the Houthis that ended weeks later when Trump said they pledged to stop attacking ships. The latest Gaza ceasefire began in October.\n\nFollowing the disclosure of Hegseth’s Signal chat that included the Atlantic’s editor, the magazine released the entire thread in late March. Hegseth had posted multiple details about an impending strike, using military language and laying out when a “strike window” starts, where a “target terrorist” was located, the time elements around the attack and when various weapons and aircraft would be used in the strike. He mentioned that the U.S. was “currently clean” on operational security.\n\nHegseth told Fox News Channel in April that what he shared over Signal was “informal, unclassified coordinations, for media coordinations and other things.”\n\nDuring a congressional hearing in June, Hegseth was pressed multiple times by lawmakers over whether he shared classified information and if he should face accountability if he did.\n\nRep. Seth Moulton, a Massachusetts Democrat and Marine veteran, asked Hegseth whether he would hold himself accountable if the inspector general found that he placed classified information on Signal.\n\nHegseth would not directly say, only noting that he serves “at the pleasure of the president.”\n\n___\n\nAssociated Press writer Stephen Groves and Konstantin Toropin contributed to this report.",
      "articleItem": {
        "title": "Pentagon watchdog finds Hegseth’s use of Signal posed risk to US personnel, AP sources say",
        "url": "https://apnews.com/article/hegseth-signal-war-plans-inspector-general-5a315349f428e22e5bf6a424287738eb"
      },
      "scrapedAt": "2025-12-03T21:02:06.437Z",
      "success": true,
      "origin": "apNewsPolitics"
    },
    {
      "url": "https://techcrunch.com/2025/12/02/amazon-challenges-competitors-with-on-premises-nvidia-ai-factories/",
      "title": "Amazon challenges competitors with on-premises Nvidia ‘AI Factories’",
      "excerpt": "If the product name sounds familiar, it should. It's a collab with Nvidia that combines AWS tech with the chip maker's tech.",
      "category": "tech",
      "body": "Amazon announced a new product Tuesday called “AI Factories” that allows big corporations and governments to run its AI systems in their own data centers. Or as AWS puts it: Customers supply the power and the data center, and AWS plunks in the AI system, manages it, and can tie it into other AWS cloud services.\n\nThe idea is to cater to companies and governments concerned with data sovereignty, or absolute control over their data so it can’t wind up in a competitor’s or foreign adversary’s hands. An on-prem AI Factory means not sending their data to a model maker and not even sharing the hardware.\n\nIf that product name sounds familiar, it should. That’s what Nvidia calls its hardware systems that are chock-full of tools needed to run AI, from its GPU chips to its networking tech. This AWS AI Factory is, in fact, a collaboration with Nvidia, both companies say.\n\nIn this case, the AWS Factory will use a combination of AWS and Nvidia technology. Companies that deploy these systems can opt for Nvidia’s latest Blackwell GPUs or Amazon’s new Trainium3 chip. It uses AWS’ homegrown networking, storage, databases, and security and can tap into Amazon Bedrock — the AI model selection and management service, and AWS SageMaker AI, the model building and training tool.\n\nInterestingly, AWS is far from the only giant cloud provider installing Nvidia AI Factories. In October, Microsoft showed off its first of many-to-come AI Factories rolling out into its global data centers to run OpenAI workloads. Microsoft didn’t announce at the time that these extreme machines would be available for private clouds. Instead, Microsoft highlighted how it was leaning on a host of Nvidia AI Factory data center tech to build and connect its new “AI Superfactories,” aka new state-of-the-art data centers being built in Wisconsin and Georgia.\n\nLast month, Microsoft also outlined the data centers and cloud services that would be built in local countries to address the data sovereignty issue. To be fair, its options also include “Azure Local,” Microsoft’s own managed hardware that could be installed on customer sites.\n\nStill, it is a bit ironic that AI is causing the biggest cloud providers to invest so heavily in corporate private data centers and hybrid clouds like it’s 2009 all over again.\n\nCheck out the latest reveals on everything from agentic AI and cloud infrastructure to security and much more from the flagship Amazon Web Services event in Las Vegas. This video is brought to you in partnership with AWS.\n\nTopics\n\nVenture Editor\n\nTonight! StrictlyVC concludes its 2025 series with an exclusive event featuring deep tech insights from leading backers builders such as Pat Gelsinger, Max Hodak, Nicholas Kelez, and more. Plus, opportunities for high-quality networking.Last chance to get front row access to fresh, candid insights on the future of deep tech. Don’t miss it!\n\nTonight, the future of deep tech will be explained to you at StrictlyVC Palo Alto\n\nAmazon releases an impressive new AI chip and teases an Nvidia-friendly roadmap\n\nApple just named a new AI chief with Google and Microsoft expertise, as John Giannandrea steps down\n\nNew York state law takes aim at personalized pricing\n\nHow OpenAI and Google see AI changing go-to-market strategies\n\nAnduril’s autonomous weapons stumble in tests and combat, WSJ reports\n\nThis Thanksgiving’s real drama may be Michael Burry versus Nvidia",
      "articleItem": {
        "title": "Amazon challenges competitors with on-premises Nvidia ‘AI Factories’",
        "url": "https://techcrunch.com/2025/12/02/amazon-challenges-competitors-with-on-premises-nvidia-ai-factories/"
      },
      "scrapedAt": "2025-12-03T21:02:06.922Z",
      "success": true,
      "origin": "techCrunch"
    }
  ]
}