{
  "runId": "run4",
  "processedAt": "2025-12-13T22:04:59.128Z",
  "totalArticles": 4,
  "articles": [
    {
      "original": {
        "url": "https://www.yahoo.com/entertainment/movies/article/new-movies-to-watch-this-weekend-see-dead-mans-wire-in-theaters-rent-christy-stream-influencers-on-shudder-145555667.html",
        "title": "New movies to watch this weekend: See 'Dead Man's Wire' in theaters, rent 'Christy,' stream 'Influencers' on Shudder",
        "excerpt": "Brad Pitt's \"F1\" is now on Apple TV, and Jennifer Lawrence fans can rent her latest, \"Die My Love.\"",
        "category": "entertainment",
        "body": "Hello, Yahoo readers! My name is Brett Arnold, film critic and host of Roger & Me, a weekly Siskel & Ebert-style movie review show, and I'm back with another edition of Trust Me, I Watch Everything.\n\nIn theaters this week are new films from two iconic filmmakers: Gus Van Sant's Dead Man's Wire and James L. Brooks's Ella McCay.\n\nNewly available to watch on your couch are the Sydney Sweeney vehicle Christy and Keeper, the third film in 18 months from horror filmmaker Osgood Perkins.\n\nAnd on streaming services you're likely already paying for, an absolute feast of choices, including the killer sequel Influencers and must-watch documentary Predators.\n\nRead on, because there are more, and there's always something for everyone!\n\nWhat to watch in theaters\n\nMovies newly available to rent or buy\n\nMovies newly available on streaming services you may already have\n\nWhy you should see it: Legendary independent filmmaker Gus Van Sant returns with his first film since 2018, and it's a ripped-from-the-headlines period-piece true story that is so clearly indebted to Dog Day Afternoon, Van Sant even cast Al Pacino in a supporting role. It's a throwback to crime thrillers of the 1970s, and the filmmaker really captures that vibe perfectly.\n\nOn Feb. 8, 1977, Tony Kiritsis entered the office of Richard Hall, president of the Meridian Mortgage Company, and took him hostage with a sawed-off shotgun wired with a \"dead man's wire\" from the trigger to Tony's own neck.\n\nBill Skarsgård stars as Kiritsis and delivers a very big performance, equal parts anxious and confident as he gets more and more out of his depth. Van Sant expertly captures the texture of the time period through his grainy camerawork and impeccable production design. Its craft elements are analog and retro in a way that make it feel genuine; it talks the talk and walks the walk. And it's got a killer soundtrack to boot!\n\nThe details of why Kiritsis did this evoke modern anxieties of corporate greed. He kidnaps the son of the head of a mortgage firm that he claims railroaded him into bankruptcy so it could profit from his land. He held the man at gunpoint in his apartment for days as it became a media circus all over TV and radio. It feels like an early example of how the media can turn someone into a folk hero overnight, regardless of whether they're committing a violent crime.\n\nFun fact: Dead Man's Wire is the third film this year to use Gil Scott-Heron's The Revolution Will Not Be Televised. Can you name the other two?\n\nWhat other critics are saying: It's getting great marks. The Hollywood Reporter's David Rooney writes, \"Scripted with fat-free economy by Austin Kolodney and made in the gritty, realistic style of Sidney Lumet’s ’70s thrillers, the film pays tribute to Dog Day Afternoon while carving its own identity.\" Nick Schager at the Daily Beast writes, \"In this age of Luigi Mangione, it’s a snapshot of violent anti-establishment resentment and fury that’s eerily timely — and smartly leaves its own perspective on its mayhem open for debate.\"\n\nHow to watch: Dead Man's Wire is in select theaters ahead of a wide release on Jan. 16.\n\nGet tickets\n\nWhy you should skip it: James L. Brooks has made so many classic films — Terms of Endearment, Broadcast News, As Good as It Gets — that it's easy to forget his last one was the critical and commercial bomb How Do You Know from 15 years ago. He's also well known for creating iconic sitcoms like The Mary Tyler Moore Show, Taxi and, of course, The Simpsons!\n\nAll that to say, Ella McCay is such a special type of weird and bad, it's a shock that it came from such a prolific and talented filmmaker who was once showered in Oscars.\n\nAt 34 years old, Ella McCay (Emma Mackey, if you can believe it) becomes the governor of her home state. However, navigating relationships with her husband, father and brother may just be her biggest challenge yet. The state remains unnamed throughout, and the film is pointedly set in 2008, a time in which — and I'm quoting the film's narrator, Julie Kavner aka Marge Simpson — \"when we were nice to each other.\"\n\nThe biggest problem with the film is that it feels so incredibly truncated to the point of incoherence. We're introduced to a flurry of distinct characters so haphazardly that it's impossible to understand their significance to the story, which itself is unclear due to the totally unfocused nature of it all. It's a movie that wants to be about politics but refuses to engage with politics.\n\nThe characters are underwritten and morph to fit what the narrative requires at any given moment. The lazy flashback structure doesn't really help fill in the blanks on their relationships and just makes you wonder what the whole thing is about. McCay herself is a particularly unreal creation, a Manic Pixie Dream Girl molded into a politician who truly believes in the hope, change and idealism she preaches.\n\nIt's billed as a comedy but isn't particularly funny, unless you count all the unintentional laughs, like McCay's bizarre scarf that she inexplicably wears during a sex scene.\n\nThe final product of Ella McCay is an absolute mess. It's clear there's a much longer version on the cutting room floor that would solve a lot of the problems that make the film feel like it's both overstuffed and somehow not enough, but I'm not sure I'd care to watch that one, either.\n\nWhat other critics are saying: Everybody is equally baffled. AP's Jocelyn Novek writes, \"It’s hard to understand how Ella McCay, the first original feature from writer-director Brooks in 15 years, goes so utterly haywire.\" Tim Robey at the Telegraph writes, \"Ella McCay pitches the title character as a heroine we’re going to adore. Right from the off, though — as if he can’t trust Ella to make a decent case for herself — Brooks resorts to desperate campaigning tactics.\"\n\nHow to watch: Ella McCay is now in theaters nationwide.\n\nGet tickets\n\nBut that's not all ...\n\nSilent Night, Deadly Night: This remake of the 1984 cult-classic horror film about a guy who kills people while dressed as Santa stars Rohan Campbell (Halloween Ends' Corey Cunningham) and does a lot to update the text for modern times. The end result of this new, bold reimagining is that it plays as if the original has been fused with something like Dexter or Venom. Your mileage may vary, but I found all the changes to be obnoxious and ruinous. Can't a slasher just be a slasher anymore? I didn't need the ... let's say \"supernatural\" element that comes into play, and the romance subplot didn't add much for me either. Though Ruby Modine, daughter of Matthew, shines in a supporting role. Get tickets.\n\nWhy you should see it: Sydney Sweeney gives the best performance of her budding career in Christy.\n\nBased on shocking true events, Christy Martin (Sweeney) never imagined life beyond her small-town roots in West Virginia until she discovered a knack for punching people. Fueled by grit, raw determination and an unshakable desire to win, she charges into the world of boxing under the guidance of her trainer and manager turned husband, Jim (Ben Foster). But while Christy flaunts a fiery persona in the ring, her toughest battles unfold outside it — confronting family, identity and a relationship that just might become life and death.\n\nWhat starts as a typical sports rags-to-riches drama transforms into a terrifying look at long-term domestic abuse. Foster is positively evil as Jim, who wants to control every aspect of his wife's life, including who she spends time with, which has deeper implications, given that Christy is essentially forced back into the closet by her conservative family. It all builds to an unfortunate situation that feels as inevitable as it does avoidable, though Martin's story is not without hope.\n\nThere are certainly cliché elements — Merritt Wever as the doting mother feels plucked out of an archetype catalog, and the training montage stuff is pretty routine. What it does differently from a typical boxing film is what makes it stand out, as does Sweeney's ferocious lead performance, which sells both the badass side of the character and the vulnerable one.\n\nWhat other critics are saying: The response is very mixed. Kristy Puchko at Mashable warns, \"Don't buy into the hype. This movie is a mess,\" though IndieWire's Kate Erbland was more on my side of things, writing that \"Sweeney disappears into the role, not just changing her hair color, eye color, accent and way of moving, but her general air, her overall mien, the space she takes up in a room.\"\n\nHow to watch: Christy is now available to rent or buy on Apple TV, Prime Video and other VOD platforms.\n\nRent or buy\n\nWhy you should maybe see it: The mysterious new film from Osgood Perkins is here. In it, Liz (Tatiana Maslany) and Malcolm (Rossif Sutherland) head to a secluded cabin for their anniversary weekend. When Malcolm suddenly returns to the city and Liz is alone, she is approached by an evil entity that unveils the unfamiliar dwelling's secrets.\n\nIn many ways, this is a quintessentially Perkins film. It has a basic, familiar horror setup — a couple going to a cabin in the woods — that ultimately gives way to a \"here's what's actually going on, horror-wise\" third-act reveal that some genre fans will love and others will leave asking, \"That's it?\"\n\nPerkins expertly mines your expectations to freak you out. Some of the craziest stuff in the movie is hiding in the margins, but there are some real jump-out-of-your-seat moments too. Still, the movie feels almost reticent about what kind of film it's going to be. Is this a psychological thriller about a woman on the edge who's seeing things, a head trip about a man gaslighting a woman, a spooky drama about a man and his mistress, or something else entirely? It does have answers in the end. And even if you're not down with it on a story level, the imagery is undeniably creepy and memorable, if nothing else.\n\nIt reminded me a lot of Perkins's early film I Am the Pretty Thing That Lives in the House, mixed with something like Alex Garland's Men with some of the unpredictable \"What the hell is going on?!\" quality of 2024's Cuckoo.\n\nI reference all these movies because it feels like the easiest way to suss out your interest level — if you like any of those, you'll dig this, and if you loathe them, it isn't for you.\n\nWhat other critics are saying: Very mixed reviews here. An even split! Variety's Owen Gleiberman says, \"The mood is low-key and naturalistic, yet a streak of trippy weirdness keeps intruding. And here’s the thing: The weird parts don’t add up. That’s likely by design, but that doesn’t make it good.\" Jesse Hassenger at the Guardian, however, writes, \"When Keeper finishes up, its tight confines feel satisfying, correct and unlikely to spawn a sequel.\"\n\nHow to watch: Keeper is now available to rent or buy on Apple TV, Prime Video and other VOD platforms.\n\nRent or buy\n\nBut that's not all ...\n\nDie My Love: Jennifer Lawrence and Robert Pattinson star in the latest film from Lynne Ramsay, who hasn't made a feature since 2017's You Were Never Really Here. The performances are great, but it's far from something with mainstream appeal, so much so that it earned a rare \"D+\" CinemaScore. Rent or buy.\n\nWhy you should watch it: This sequel to 2022's Influencer — in my mind the best Shudder original horror movie that the network has ever distributed — is just as good, if not better than, the under-seen original.\n\nIn the globe-trotting Influencer, social media influencer Madison meets CW, who travels with ease and shows her a more uninhibited way of living. But CW’s interest in her takes a darker turn. In the sequel, now in Southern France, a young woman’s chilling fascination with murder and identity theft sends her life into a whirlwind of chaos.\n\nThe less said about both films, the better; the first film, especially, thrives on the unpredictable nature of its storytelling and tricky characterization of who the real protagonist is here. Think The Talented Mr. Ripley for the social media generation, and you're halfway there. Both films feature a sensational star-making lead performance in Cassandra Naud and deserve praise for their on-location shooting, making the most of their minuscule budget simply by filming in exotic locations.\n\nThe original was the first truly great social media horror movie: It declared that \"online\" is fake, a facade on both ends of the interaction. Nobody cares about your posts, and your followers aren’t your friends and wouldn’t notice if you disappeared. Empty posts into the void! The sequel takes all these ideas a step further and continues its streak of not being afraid to get mean-spirited and nasty.\n\nInfluencers is a genuinely great sequel that does all the things you'd hope a follow-up to a favorite would do, in that it thoughtfully expands its scope while staying true to what made it so fun and exciting. Bring on Influencer 3! This is my new favorite horror franchise.\n\nWhat other critics are saying: It's just as well-reviewed as its predecessor! TheWrap's William Bibbiani calls it 'a sadistic delight, just like its predecessor.\" Nick Schager at the Daily Beast calls it a \"taut, tense, of-the-moment thriller with real (reel?) bite.\"\n\nHow to watch: Influencers is now streaming on Shudder.\n\nWatch on Shudder\n\nWhy you should watch it: You don't need to be familiar with the wildly popular To Catch a Predator show for this documentary to be effective, as it's a terrific look at society's obsession with true crime writ large, and ultimately a very personal film for the man behind the camera.\n\nThe doc explores the controversial NBC series that caught potential child predators in sting operations, leading to arrests, and its eventual cancellation, and expands its scope to include the YouTubers who have taken it upon themselves to do vigilante justice in the name of the program.\n\nIt's a provocative and chilling examination of our obsession with turning true crime into entertainment and the inherent moral gray area that exists in that space. It features an unbelievable interview with To Catch a Predator's iconic journalist Chris Hansen, who continues to cash in on the project, despite the series' cancellation, through his own similar projects.\n\nPredators is thought-provoking and occasionally bleakly hilarious in its depiction of our society's unhealthy relationship with true crime.\n\nWhat other critics are saying: It's one of the best-reviewed films of the year. The Guardian's Leslie Felperin writes, \"This may end up being ranked as one of the best nonfiction films of the year.\" Amy Nicholson at the L.A. Times says, \"Tonally, this steady and powerful film is everything the original program wasn’t: hesitant, sorrowful and compassionate for every human being onscreen.\"\n\nHow to watch: Predators is now streaming on Paramount+.\n\nWatch on Paramount+\n\nBut that's not all ...\n\nWake Up, Dead Man: The third Knives Out movie is here, following a brief theatrical run, and despite some critics calling it the best yet, I found it to be a slog. Read my full review. Now streaming on Netflix.\n\nThe Mastermind: The latest work from filmmaker Kelly Reichardt is a brilliant deconstruction of a heist film and a quietly political film, starring man of the hour Josh O'Connor as an art thief who maybe didn't think things through before pulling off his crime. Now streaming on Mubi.\n\nF1: The box-office smash hit starring Brad Pitt is finally streaming, and it's worth a watch, especially if you've got a killer surround-sound set-up. Read my full review. Now streaming on Apple TV.\n\nRoofman: This unlikely dark-edged charmer features terrific performances from Channing Tatum and Kirsten Dunst. Read my full review. Now streaming on Paramount+ and MGM+.\n\nSpinal Tap II: The End Continues: This 41-year-later sequel is hard to spin as anything other than a disappointment. But it's now \"free\" on streaming, which feels like the right price for fans to check it out. My full review can be found here. Now streaming on HBO Max.\n\nThat's all for this week — we'll see you next week at the movies!\n\nLooking for more recs? Find your next watch on the Yahoo 100, our daily updating list of the most popular movies of the year.",
        "scrapedAt": "2025-12-13T22:01:14.920Z",
        "success": true,
        "origin": "yahooEntertainmentNews"
      },
      "processed": {
        "title": "Weekend Movie Guide: 'Dead Man's Wire' in Theaters, 'Christy' Available for Rent, 'Influencers' Streaming on Shudder",
        "tickerTitle": "Weekend Movie Update",
        "excerpt": "Catch Brad Pitt in 'F1' on Apple TV, and rent Jennifer Lawrence's 'Die My Love' now.",
        "category": "entertainment",
        "body": "This weekend brings a selection of films from notable directors. In theaters, Gus Van Sant's \"Dead Man's Wire\" and James L. Brooks's \"Ella McCay\" make their debuts. At home, viewers can rent \"Christy,\" featuring Sydney Sweeney, and catch \"Keeper,\" directed by Osgood Perkins.\n\n\"Dead Man's Wire\" is based on a true story set in 1977, following Tony Kiritsis as he takes a mortgage company president hostage with a sawed-off shotgun while dealing with feelings of betrayal from corporate greed. With Bill Skarsgård in a standout role, the film has drawn comparisons to classic 1970s crime dramas, complimented by its authentic production design and a retro soundtrack.\n\nIn contrast, \"Ella McCay\" struggles with coherence despite its political aspirations. The film follows a young governor navigating complex familial relationships amid an unnamed state and a politically charged setting. Critics have been underwhelmed, pointing out its unclear narrative and lackluster character development, questioning its comedic value and overall execution.\n\nOn the streaming front, fans can enjoy \"Influencers,\" a sequel that continues to explore themes of identity and obsession with true crime, while \"Christy\" showcases Sweeney's impressive range as a boxer grappling with external battles and domestic struggles. Each film presents unique storytelling experiences that cater to diverse audience interests.",
        "imageKeyword": "movies",
        "tags": [
          "Economy",
          "Elections",
          "White House"
        ],
        "image": {
          "url": "https://images.pexels.com/photos/436413/pexels-photo-436413.jpeg",
          "thumbUrl": "https://images.pexels.com/photos/436413/pexels-photo-436413.jpeg?auto=compress&cs=tinysrgb&h=350",
          "width": 4928,
          "height": 3264,
          "authorName": "Nathan Engel",
          "authorUrl": "https://www.pexels.com/@nathan-engel-50858",
          "source": "pexels",
          "sourcePageUrl": "https://www.pexels.com/photo/time-lapse-photography-of-car-lights-in-front-of-cinema-436413/",
          "license": "Pexels License"
        }
      }
    },
    {
      "original": {
        "url": "https://apnews.com/article/nasa-mars-orbiter-maven-c59f534dc51b55dc5387309b93064f77",
        "title": "NASA loses contact with its Maven spacecraft orbiting Mars for the past decade",
        "excerpt": "NASA has lost contact with a spacecraft that's been orbiting Mars for more than a decade. Maven abruptly stopped communicating to ground stations over the weekend. NASA said this week that it was working fine before it went behind the red planet. When it appeared again, there was only silence. Launched in 2013, Maven has been studying the upper Martian atmosphere and its interaction with the solar wind since 2014. It also serves as a communication relay for NASA's two Mars rovers, Curiosity and Perseverance.",
        "category": "science",
        "body": "CAPE CANAVERAL, Fla. (AP) — NASA has lost contact with a spacecraft that has orbited Mars for more than a decade.\n\nMaven abruptly stopped communicating to ground stations over the weekend. NASA said this week that it was working fine before it went behind the red planet. When it reappeared, there was only silence.\n\nLaunched in 2013, Maven began studying the upper Martian atmosphere and its interaction with the solar wind once reaching the red planet the following year. Scientists ended up blaming the sun for Mars losing most of its atmosphere to space over the eons, turning it from wet and warm to the dry and cold world it is today.\n\nMaven also has served as a communication relay for NASA’s two Mars rovers, Curiosity and Perseverance.\n\nEngineering investigations are underway, according to NASA.\n\nNASA has two other spacecraft around Mars that are still active: Mars Reconnaissance Orbiter, launched in 2005, and Mars Odyssey, launched in 2001.\n\n___\n\nThe Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education and the Robert Wood Johnson Foundation. The AP is solely responsible for all content.",
        "scrapedAt": "2025-12-13T22:01:15.473Z",
        "success": true,
        "origin": "apNewsScience"
      },
      "processed": {
        "title": "NASA Loses Signal with Maven Spacecraft Orbiting Mars",
        "tickerTitle": "NASA's Maven Signal Lost",
        "excerpt": "NASA has lost contact with the Maven spacecraft, which has been orbiting Mars for over a decade. Communication was abruptly cut off over the weekend.",
        "category": "science",
        "body": "NASA has lost contact with Maven, a spacecraft that has been orbiting Mars for more than a decade. Communication was interrupted over the weekend, and although it was functioning normally prior to passing behind the planet, no signals were received upon its return to view. Launched in 2013, Maven commenced its mission to analyze the Martian atmosphere and its solar wind interactions the following year. Researchers attribute Mars' current cold and dry state to the loss of its atmosphere over time, significantly influenced by solar activity.\n\nIn addition to its scientific research, Maven has also provided communication support for NASA's rovers, Curiosity and Perseverance. NASA is currently conducting engineering assessments to understand the situation better. Meanwhile, two other active spacecraft remain in orbit around Mars: the Mars Reconnaissance Orbiter, which launched in 2005, and Mars Odyssey, launched in 2001.",
        "imageKeyword": "Maven",
        "tags": [
          "Science",
          "Mars",
          "Space"
        ],
        "image": {
          "url": "https://images.pexels.com/photos/29233013/pexels-photo-29233013.jpeg",
          "thumbUrl": "https://images.pexels.com/photos/29233013/pexels-photo-29233013.jpeg?auto=compress&cs=tinysrgb&h=350",
          "width": 4160,
          "height": 6240,
          "authorName": "Cord Allman",
          "authorUrl": "https://www.pexels.com/@cord-allman-852631891",
          "source": "pexels",
          "sourcePageUrl": "https://www.pexels.com/photo/urban-fashion-portrait-in-downtown-toronto-29233013/",
          "license": "Pexels License"
        }
      }
    },
    {
      "original": {
        "url": "https://apnews.com/article/hanukkah-judaism-jewish-festival-of-lights-020d9ba0477b4af82e9c53b098c52dd2",
        "title": "What to know about Hanukkah and how it’s celebrated",
        "excerpt": "Hanukkah is Judaism’s “festival of lights.” On eight consecutive nightfalls, Jews gather with family and friends to light one additional candle in the menorah candelabra. They commemorate the rededication of the Temple in Jerusalem nearly 2,200 years ago after a small group of Jewish fighters liberated it from occupying foreign forces. With the tiny supply of still ritually pure oil that they found in the temple, they lit the menorah. According to the Talmud, the oil miraculously lasted for eight days. The ritual of lighting a nightly candle and the emphasis on cooking foods in oil memorialize the holiday, with its theme of bringing light into the darkness.",
        "category": "lifestyle",
        "body": "Hanukkah — also spelled Chanukah or other transliterations from Hebrew — is Judaism’s “festival of lights.” On eight consecutive nightfalls, Jews gather with family and friends to light one additional candle in the menorah — a multibranched candelabra.\n\nIn Hebrew, Hanukkah means “dedication.” The holiday marks the rededication of the Temple in Jerusalem nearly 2,200 years ago after a small group of Jewish fighters liberated it from occupying foreign forces.\n\nWith the tiny supply of ritually pure oil that they found in the temple, they lit the menorah. According to the Talmud, it miraculously remained lit for eight days. The ritual of lighting a nightly candle and the emphasis on cooking foods in oil, such as potato pancakes called latkes, memorialize this holiday.\n\nHanukkah always begins on the 25th day of the Jewish month of Kislev.\n\nBut the Jewish calendar, which is based on lunar cycles, is not in sync with the commonly used Gregorian calendar. Depending on the year, Hanukkah falls at various times between late November and late December.\n\nThis year, Hanukkah starts at sundown on Sunday, Dec. 14, and lasts through Dec. 22.\n\nTraditionally, Hanukkah has not been a major holiday on the Jewish calendar, but it has taken on cultural prominence because it occurs at a time when many other people are preparing for Christmas.\n\nJews across the religious observance spectrum — from Reform to Conservative to Orthodox — focus on the same theme of bringing light into the darkness and emphasizing that even a small, against-the-odds effort can have a transforming effect.\n\nThe Talmud, an ancient compendium of commentary and teachings on Jewish law, customs and Scripture, reflects a dispute over the order of lighting. But most people start with one candle and increase the lighting by an additional candle each night while reciting or chanting special blessings.\n\nThe candles are added from right to left, but lit from left to right on the menorah, thus always starting with the newest light. The special menorah used for Hanukkah has eight branches, with a ninth place for the candle called shamash from which all others are lit.\n\nThe tradition calls for candles with a real flame, although some also use electric ones in public displays, such as in hospitals, for safety reasons.\n\nA menorah is lit in each household and traditionally is placed where it can be seen from the outside, such as a doorway or windowsill, to symbolize the spreading of God’s light to all nations.\n\nThe lighting of menorahs in city streets and parks has become more prominent in recent years in countries around the world, including in front of public landmarks.\n\nIn addition to menorah lightings, giving to charity and social works are also part of the celebration for many, reflecting the belief that the Jewish people are called by God to help make the world better for all.\n\n___\n\nAssociated Press religion coverage receives support through the AP’s collaboration with The Conversation US, with funding from Lilly Endowment Inc. The AP is solely responsible for this content.",
        "scrapedAt": "2025-12-13T22:01:16.730Z",
        "success": true,
        "origin": "apNewsLifestyle"
      },
      "processed": {
        "title": "Understanding Hanukkah and Its Observance",
        "tickerTitle": "Hanukkah Insights",
        "excerpt": "Hanukkah, known as the 'festival of lights,' spans eight nights of candle lighting. The holiday commemorates the rededication of the Temple in Jerusalem.",
        "category": "lifestyle",
        "body": "Hanukkah, also known as Chanukah, is recognized as the 'festival of lights' in Judaism and is celebrated over eight consecutive nights. Families and friends come together to light one additional candle on the menorah, a special candelabra, each evening.\n\nThe Hebrew term Hanukkah translates to 'dedication,' referring to the rededication of the Temple in Jerusalem nearly 2,200 years ago. After a small group of Jewish fighters reclaimed it from foreign occupation, they found a limited supply of ritually pure oil to light the menorah. According to Talmudic tradition, this oil lasted for eight days, which is commemorated through the lighting of candles and the cooking of foods in oil, such as the traditional potato pancakes known as latkes.\n\nHanukkah begins on the 25th day of Kislev in the Jewish calendar, which varies from the Gregorian calendar and can occur between late November and late December. In 2023, Hanukkah begins at sundown on December 14 and continues until December 22. Although traditionally less significant than other holidays, its cultural importance has grown due to its proximity to Christmas.\n\nIndividuals across various Jewish denominations celebrate Hanukkah by focusing on the theme of bringing light into darkness and the notion that even small efforts can lead to significant change. Generally, one candle is lit each night along with reciting specific blessings, with the menorah designed to have eight branches and a ninth for the shamash candle, used to light the others. While real flames are traditionally used, electric candles may be employed for safety in public displays. Menorahs are often placed where they can be seen externally to symbolize the dissemination of divine light. In addition to menorah lighting, charitable giving is a common practice among many observants during the festival.",
        "imageKeyword": "Hanukkah",
        "tags": [
          "Elections",
          "Economy",
          "White House"
        ],
        "image": {
          "url": "https://images.pexels.com/photos/4038292/pexels-photo-4038292.jpeg",
          "thumbUrl": "https://images.pexels.com/photos/4038292/pexels-photo-4038292.jpeg?auto=compress&cs=tinysrgb&h=350",
          "width": 6000,
          "height": 4000,
          "authorName": "cottonbro studio",
          "authorUrl": "https://www.pexels.com/@cottonbro",
          "source": "pexels",
          "sourcePageUrl": "https://www.pexels.com/photo/jewish-couple-with-a-menorah-4038292/",
          "license": "Pexels License"
        }
      }
    },
    {
      "original": {
        "url": "https://www.yahoo.com/news/articles/drone-strike-southern-sudan-kills-205607695.html",
        "title": "Drone strike in southern Sudan kills 6 UN peacekeepers",
        "excerpt": "Six United Nations peacekeepers from Bangladesh were killed on Saturday in a drone strike on Sudan's southern Kordofan region, the UN mission said, with...",
        "category": "world",
        "body": "Six United Nations peacekeepers from Bangladesh were killed on Saturday in a drone strike on Sudan's southern Kordofan region, the UN mission said, with Dhaka sharply condemning the attack.\n\nThe United Nations Interim Security Force for Abyei (UNISFA) said \"six troops were killed and six injured\", including four seriously, when a drone hit their camp in Kadugli, the capital of South Kordofan state.\n\nAll of the victims are from Bangladesh, it said.\n\nUN chief Antonio Guterres condemned the \"horrific\" attack, saying it \"may constitute war crimes under international law\".\n\n\"Attacks as the one today in South Kordofan against peacekeepers are unjustifiable. There will need to be accountability,\" he said in a statement.\n\nBangladesh's interim leader Muhammad Yunus in a statement said he was \"deeply saddened\" by the attack, and put the toll at six dead and eight wounded.\n\nHe asked the UN to ensure that his country's personnel were offered \"any necessary emergency support\".\n\n\"The government of Bangladesh will stand by the families in this difficult moment,\" Yunus added.\n\nDhaka's foreign ministry said it \"strongly condemned\" the attack.\n\nUN peacekeepers are deployed to Abyei, a disputed region between Sudan and South Sudan.\n\n- Fires blazing -\n\nA medical source had earlier told AFP that the strike on a United Nations facility in Kadugli killed at least six people, with witnesses saying they were UN employees.\n\n\"Six people were killed in a bombing of the UN headquarters while they were inside the building,\" the medical source at the city's hospital said.\n\nEyewitnesses said a drone had hit the UN facility.\n\nThe Sudanese army published a video on its Facebook page showing fires blazing and two columns of smoke rising from the UNISFA base.\n\nThe army-aligned government based in Port Sudan issued a statement condemning the attack and accusing the paramilitary Rapid Support Forces (RSF) of being behind it.\n\nIn a statement, the Sovereignty Council headed by army chief General Abdel Fattah al-Burhan called the attack a \"dangerous escalation\".\n\nThe RSF in a statement on Telegram said it rejected \"the claims and allegations... regarding an air attack that targeted the United Nations headquarters in Kadugli, and the accompanying false accusations against our forces of being behind it through the use of a drone\".\n\nMeanwhile, Sudanese Prime Minister Kamil Idris said that \"the terrorist rebel militia has met all the conditions to be classified as a terrorist group\", and urged the UN to \"bring the perpetrators to justice\".\n\nKadugli, where famine was declared in early November, has been besieged for a year and a half by the RSF.\n\n- Strategic position -\n\nFollowing their late-October capture of El-Fasher -- the army's last stronghold in Sudan's western Darfur region -- the RSF have pushed eastward into the oil-rich Kordofan region, divided into three states.\n\nKordofan is a vast agricultural region that lies between RSF-controlled Darfur in the west and army-held areas in the north, east and centre.\n\nIts position is important for maintaining supply lines and moving troops.\n\nThe RSF has been at war with the military since April 2023 and has deployed fighters, drones and allied militias to the fertile region.\n\nAnalysts say the RSF seek to punch through the army's defences around central Sudan, paving the way for recapturing Khartoum.\n\nLast week, strikes on a kindergarten and hospital in Kalogi in South Kordofan killed 114 people, including 63 children, according to the UN's World Health Organization.\n\nSudan's war has so far killed tens of thousands of people, displaced millions and resulted in one of the world's worst humanitarian crises.\n\nEfforts to end the war have so far failed.\n\nLast month, US President Donald Trump said he would move to end the conflict following discussions in Washington with Saudi Crown Prince Mohammed bin Salman, but the initiative has yet to materialise.\n\nab-nda-sa-ash/jsa/srm",
        "scrapedAt": "2025-12-13T22:01:18.829Z",
        "success": true,
        "origin": "yahooWorldNews"
      },
      "processed": {
        "title": "Drone strike in southern Sudan results in deaths of 6 UN peacekeepers",
        "tickerTitle": "UN peacekeepers killed",
        "excerpt": "A drone strike in South Kordofan, Sudan, led to the deaths of six Bangladeshi UN peacekeepers, prompting strong condemnation from officials.",
        "category": "world",
        "body": "On Saturday, six United Nations peacekeepers from Bangladesh lost their lives in a drone strike targeting their camp in Kadugli, South Kordofan, according to the UN mission. The United Nations Interim Security Force for Abyei (UNISFA) reported that in addition to the fatalities, six others were injured, four of whom sustained serious wounds. The UN Secretary-General, Antonio Guterres, condemned the attack, labeling it as horrific and potentially a war crime under international law, asserting the need for accountability.\n\nBangladesh's interim leader, Muhammad Yunus, expressed deep sorrow over the incident and confirmed the casualty figures, calling for emergency support for the affected personnel. The Bangladeshi foreign ministry strongly condemned the assault. Witnesses indicated that a drone strike hit the UN facility, causing chaos and destruction.\n\nIn response to the attack, the Sudanese army released footage of the incident, showing significant damage at the UNISFA site. They accused the paramilitary Rapid Support Forces (RSF) of orchestrating the strike, labeling it a dangerous escalation. The RSF, however, denied these allegations through their Telegram statement, rejecting claims of involvement in the drone assault. Sudan's Prime Minister, Kamil Idris, classified the RSF as a terrorist group, urging the UN to ensure justice for the attack.\n\nThe Bahri area, where the attack occurred, has been under siege for over a year by the RSF, as the forces continue their conflict with the military, which has intensified since April 2023. The broader conflict in Sudan has led to significant humanitarian crises, with calls for resolution remaining unfulfilled despite international diplomatic efforts.",
        "imageKeyword": "drone",
        "tags": [
          "Elections",
          "White House",
          "Ukraine / Russia War"
        ],
        "image": {
          "url": "https://images.pexels.com/photos/4418713/pexels-photo-4418713.jpeg",
          "thumbUrl": "https://images.pexels.com/photos/4418713/pexels-photo-4418713.jpeg?auto=compress&cs=tinysrgb&h=350",
          "width": 3152,
          "height": 2361,
          "authorName": "David Bartus",
          "authorUrl": "https://www.pexels.com/@david-bartus-43782",
          "source": "pexels",
          "sourcePageUrl": "https://www.pexels.com/photo/fish-scale-concrete-brick-4418713/",
          "license": "Pexels License"
        }
      }
    }
  ]
}