{
  "runId": "run1",
  "processedAt": "2025-12-12T20:36:33.216Z",
  "totalArticles": 3,
  "articles": [
    {
      "original": {
        "url": "https://apnews.com/article/poll-economy-inflation-groceries-costs-trump-affordability-d27635d279b27e5e2c19700c006ebb1d",
        "title": "This holiday season isn’t very merry for consumers, an AP-NORC poll finds",
        "excerpt": "A new AP-NORC poll finds this holiday season isn’t quite so merry for American shoppers as large shares of them are dipping into savings, scouring for bargains and feeling like the overall economy is stuck in a rut under President Donald Trump. The vast majority of U.S. adults say they’ve noticed higher than usual prices for groceries, electricity and holiday gifts. Roughly half of Americans say it’s harder than usual to afford the things they want to give as holiday gifts. It’s a sobering assessment for the Republican president, who returned to the White House in large part by promising to lower prices.",
        "category": "us",
        "body": "WASHINGTON (AP) — This holiday season isn’t quite so merry for American shoppers as large shares are dipping into savings, scouring for bargains and feeling like the overall economy is stuck in a rut under President Donald Trump, a new AP-NORC poll finds.\n\nThe vast majority of U.S. adults say they’ve noticed higher than usual prices for groceries, electricity and holiday gifts in recent months, according to the survey from The Associated Press-NORC Center for Public Affairs Research.\n\nRoughly half of Americans say it’s harder than usual to afford the things they want to give as holiday gifts, and similar numbers are delaying big purchases or cutting back on nonessential purchases more than they would normally.\n\nIt’s a sobering assessment for the Republican president, who returned to the White House in large part by promising to lower prices, only to find that inflation remains a threat to his popularity just as it did for Democrat Joe Biden’s presidency. The poll’s findings look very similar to an AP-NORC poll from December 2022, when Biden was president and the country was grappling with higher rates of inflation. Trump’s series of tariffs have added to inflationary pressures and generated anxiety about the stability of the U.S. economy, keeping prices at levels that many Americans find frustrating.\n\nThe president has insisted there is “no” inflation and the U.S. economy is booming, as he expressed frustration that the public feels differently.\n\n“When will people understand what is happening?” Trump said Thursday on Truth Social. “When will Polls reflect the Greatness of America at this point in time, and how bad it was just one year ago?”\n\nMost U.S. adults, 68%, continue to say the country’s economy is “poor,” which is unchanged from December 2024, before Trump returned to the presidency.\n\nWhite House officials plan to send Trump barnstorming across the country in hopes of bucking up people’s faith in the economy before next year’s midterm elections. But the president this week in Pennsylvania defended the price increases tied to his tariffs by suggesting that Americans should buy fewer dolls and pencils for children. His message is a jarring contrast with what respondents expressed in the poll, even among people who backed him in the 2024 election.\n\nSergio Ruiz, 44, of Tucson, Arizona, said he is using more buy now, pay later programs to spread out over time the expense of gifts for his children. He doesn’t put a huge emphasis on politics, but he voted for Trump last year and would like to see lower interest rates to help boost his real estate business. He believes that more Americans having higher incomes would help to manage any affordability issues.\n\n“Prices are up. What can you do? You need to make more money,” Ruiz said.\n\nThe poll found that when they do shop, about half of Americans are finding the lowest price more than they would normally. About 4 in 10 are dipping into their savings more than at other times.\n\nDemocrats are more likely than Republicans to say they’re cutting back on expenses or looking for low prices, but many Republicans are budgeting more than usual as well. About 4 in 10 Republicans are looking for low prices more than they usually would, while a similar share are shopping for nonessential items less than usual.\n\nPeople felt similarly dismal about holiday shopping and the economy when Biden was president in 2022. Inflation had spiked to a four-decade high that summer. Three years later, inflation has eased substantially, but it’s still running at 3%, a full percentage point above the Federal Reserve’s target as the job market appears to have entered a deep freeze.\n\nThe survey indicates that it’s the level of prices — and not just the rate of inflation — that is the point of pain for many families. Roughly 9 in 10 U.S. adults, 87%, say they’ve noticed higher than usual prices for groceries in the past few months, while about two-thirds say they’ve experienced higher prices than usual for electricity and holiday gifts. About half say they’ve seen higher than normal prices for gas recently.\n\nThe findings on groceries and holiday gifts are only slightly lower than in the 2022 poll, despite the slowdown from an inflation rate that hit a four-decade peak in the middle of that year.\n\nConsumer spending has stayed resilient despite the negative sentiments about the economy, yet Trump’s tariffs have caused changes for shoppers such as Andrew Russell.\n\nThe 33-year-old adjunct professor in Arlington Heights, Illinois, said he used to shop for unique gifts from around the globe and buy online. But with the tariffs, he got his gifts locally and “this year, I only bought things that I can pick up in person,” he said.\n\nRussell, who voted Democratic in last year’s election, said he worries about the economy for next year. He thinks the investment in artificial intelligence has become a bubble that could burst, taking down the stock market.\n\nFew people expect the situation to meaningfully improve next year — a sign that Trump has done little to instill much confidence from his mix of tariffs, income tax cuts and foreign trips to attract investments. Trump has maintained that the benefits from his policies will begin to snowball in 2026.\n\nAbout 4 in 10 U.S. adults expect next year will be economically worse for the country. Roughly 3 in 10 say conditions won’t change much. Only about 2 in 10 think things will get better, with Republicans being more optimistic.\n\nThe belief that things will get better has slipped from last year, when about 4 in 10 said that 2025 would be better than 2024.\n\nMillicent Simpson, 56, of Cleveland, Ohio, said she expects the economy to be worse for people like her who rely on Medicaid for health care and the Supplemental Nutrition Assistance Program. Simpson voted Democratic last year and blames Trump for the greater economic pressures that she faces going into the winter.\n\n“He’s making it rough for us,” she said. “He’s messing with the government assistance for everybody, young and old.”\n\n___\n\nThe AP-NORC poll of 1,146 adults was conducted Dec. 4-8 using a sample drawn from NORC’s probability-based AmeriSpeak Panel, which is designed to be representative of the U.S. population. The margin of sampling error for adults overall is plus or minus 4 percentage points.",
        "scrapedAt": "2025-12-12T20:34:00.693Z",
        "success": true,
        "origin": "apNewsUS"
      },
      "processed": {
        "title": "Poll Reveals Holiday Discontent Among American Shoppers",
        "tickerTitle": "Holiday Shopping Blues",
        "excerpt": "A recent AP-NORC poll highlights that many American consumers are feeling the pinch this holiday season, with rising prices causing concern.",
        "category": "us",
        "body": "A recent poll conducted by AP-NORC reveals a challenging holiday season for American consumers, as many report dipping into their savings, searching for bargains, and perceiving the economy as stagnant under President Donald Trump. The survey indicates that a significant majority of U.S. adults have noticed increased prices for essentials like groceries, electricity, and holiday gifts, leading roughly half to feel that affording gifts has become more difficult than usual. This situation poses a stark reminder for Trump, who returned to the presidency promising to alleviate financial burdens, only to be confronted with persistent inflation that threatens his popularity. \n\nSimilar sentiments were expressed in the survey as were found in a December 2022 AP-NORC poll during the Biden administration, when inflation was a major concern. High rates of inflation have been exacerbated by Trump's tariffs, creating apprehension about economic stability. Despite the president's claims of a booming economy, most Americans—68%—perceive the current economic situation as poor, a sentiment unchanged since late 2024. \n\nThe poll highlights that many consumers are making adjustments; roughly 40% have turned to savings to fund holiday purchases and are adopting budget-conscious habits. Democrats are more likely to report cutting back on expenses, though many Republicans are doing the same. As inflation remains higher than the Federal Reserve's target, consumer opinions on spending and the economy echo a dismal outlook. A notable 9 in 10 U.S. adults have observed rising grocery prices, alongside significant increases in costs for gas and holiday gifts. \n\nAmid this uncertainty, expectations for the economy in the coming year are low, with about 40% of respondents expecting conditions to worsen. Consumer confidence remains shaky, reflecting a lack of optimism surrounding economic recovery due to both domestic and global factors. Amidst the challenges, some individuals are finding ways to adjust their shopping habits to cope with the economic climate, occasionally favoring local options over international purchases. The overall trend suggests that many Americans are prioritizing financial prudence as the holiday season unfolds.",
        "imageKeyword": "Holiday",
        "tags": [
          "Economy",
          "White House",
          "Elections"
        ],
        "image": {
          "url": "https://images.pexels.com/photos/386000/pexels-photo-386000.jpeg",
          "thumbUrl": "https://images.pexels.com/photos/386000/pexels-photo-386000.jpeg?auto=compress&cs=tinysrgb&h=350",
          "width": 5184,
          "height": 3456,
          "authorName": "Nubia Navarro (nubikini)",
          "authorUrl": "https://www.pexels.com/@nubikini",
          "source": "pexels",
          "sourcePageUrl": "https://www.pexels.com/photo/yellow-die-cast-miniature-van-on-brown-sand-386000/",
          "license": "Pexels License"
        }
      }
    },
    {
      "original": {
        "url": "https://apnews.com/article/abrego-garcia-el-salvador-deportation-f6d3df5d2315375dea83492858dc91f5",
        "title": "Federal judge issues order to prohibit immigration officials from detaining Kilmar Abrego Garcia",
        "excerpt": "Kilmar Abrego Garcia has walked away after a scheduled appointment at an Immigration and Customs Enforcement field office after a federal judge ordered that officials could not detain him. Abrego Garcia appeared Friday for the appointment at a Maryland ICE office, some 14 hours after he was released from detention in Pennsylvania on a judge’s orders. His lawyers asked the judge to block authorities from detaining him again. The judge says officials cannot re-detain him until the court conducts a hearing on the motion for the temporary restraining order. Abrego Garcia became a flashpoint of the Trump administration’s immigration crackdown earlier this year when he was wrongly deported to a notorious prison in El Salvador.",
        "category": "us",
        "body": "BALTIMORE (AP) — A federal judge blocked U.S. immigration authorities on Friday from re-detaining Kilmar Abrego Garcia, saying she feared they might take him into custody again just hours after she had ordered his release from a detention center.\n\nThe order came as Abrego Garcia appeared at a scheduled appointment at an Immigration and Customs Enforcement field office roughly 14 hours after he walked out of immigration detention facility in Pennsylvania.\n\nHis lawyers had sent an urgent request to the judge, warning that ICE officials could immediately place him back into custody. Instead, Abrego Garcia exited the building after a short appointment, emerging to cheers from supporters who had gathered outside.\n\nSpeaking briefly to the crowd, he urged others to “stand tall” against what he described as injustices carried out by the government.\n\nAbrego Garcia became a flashpoint of the Trump administration’s immigration crackdown earlier this year when he was wrongly deported to a notorious prison in El Salvador. He was last taken into custody in August during a similar check-in.\n\nOfficials cannot re-detain him until the court conducts a hearing on the motion for the temporary restraining order, U.S. District Judge Paula Xinis in Maryland said. She wrote that Abrego Garcia is likely to succeed on the merits of any further request for relief from ICE detention.\n\n“For the public to have any faith in the orderly administration of justice, the Court’s narrowly crafted remedy cannot be so quickly and easily upended without further briefing and consideration,” she wrote.\n\nAbrego Garcia on Friday stopped at a news conference outside the building, escorted by a group of supporters chanting “We are all Kilmar!”\n\n“I stand before you a free man and I want you to remember me this way, with my head held up high,” Abrego Garcia said through a translator. “I come here today with so much hope and I thank God who has been with me since the start with my family.”\n\nHe urged people to keep fighting.\n\nAfter Abrego Garcia spoke, he went through security at the field office, escorted by supporters.\n\nWhen Abrego Garcia’s attorney, Simon Sandoval-Moshenberg, announced to the crowd assembled outside that his client would walk back out the field office’s doors again, he stressed that the legal fight was not over.\n\n“Yesterday’s order from Judge Xinis and now the temporary restraining order this morning represent a victory of law over power,” Sandoval-Moshenberg said.\n\nThe agency freed him just before 5 p.m. on Thursday in response to a ruling from Xinis, who wrote federal authorities detained him after his return to the United States without any legal basis.\n\nAbrego Garcia is a Salvadoran citizen with an American wife and child who has lived in Maryland for years. He immigrated to the U.S. illegally as a teenager to join his brother, who had become a U.S. citizen. In 2019, an immigration judge granted him protection from being deported back to his home country, where he faces danger from a gang that targeted his family.\n\nWhile he was allowed to live and work in the U.S. under ICE supervision, he was not given residency status. Earlier this year, he was mistakenly deported and held in a notoriously brutal Salvadoran prison despite having no criminal record.\n\nFacing mounting public pressure and a court order, President Donald Trump’s Republican administration brought him back to the U.S. in June, but only after issuing an arrest warrant on human smuggling charges in Tennessee. He has pleaded not guilty to those charges and asked a federal judge there to dismiss them.\n\nThe 2019 settlement found he had a “well founded fear” of danger in El Salvador if he was deported there. So instead ICE has been seeking to deport him to a series of African countries. Abrego Garcia has sued, claiming the Trump administration is illegally using the removal process to punish him for the public embarrassment caused by his deportation.\n\nIn her order releasing Abrego Garcia, Xinis wrote that federal authorities “did not just stonewall” the court, “They affirmatively misled the tribunal.” Xinis also rejected the government’s argument that she lacked jurisdiction to intervene on a final removal order for Abrego Garcia, because she found no final order had been filed.\n\nICE freed Abrego Garcia from Moshannon Valley Processing Center, about 115 miles (185 kilometers) northeast of Pittsburgh, on Thursday just before the deadline Xinis gave the government to provide an update on Abrego Garcia’s release.\n\nHe returned home to Maryland a few hours later.\n\nCheck-ins are how ICE keeps track of some people who are released by the government to pursue asylum or other immigration cases as they make their way through a backlogged court system. The appointments were once routine but many people have been detained at their check-ins since the start of Trump’s second term.\n\nThe Department of Homeland Security sharply criticized Xinis’ order and vowed to appeal, calling the ruling “naked judicial activism” by a judge appointed during the Obama administration.\n\n“This order lacks any valid legal basis, and we will continue to fight this tooth and nail in the courts,” said Tricia McLaughlin, the department’s assistant secretary.\n\nSandoval-Moshenberg said the judge made it clear that the government can’t detain someone indefinitely without legal authority.\n\nAbrego Garcia has also applied for asylum in the U.S. in immigration court.\n\nAbrego Garcia was hit with human smuggling and conspiracy to commit human smuggling charges when the U.S. government brought him back from El Salvador. Prosecutors alleged he accepted money to transport within the United States people who were in the country illegally.\n\nThe charges stem from a 2022 traffic stop in Tennessee for speeding. Body camera footage from a Tennessee Highway Patrol officer shows a calm exchange with Abrego Garcia. There were nine passengers in the car, and the officers discussed among themselves their suspicions of smuggling. However, Abrego Garcia was eventually allowed to continue driving with only a warning.\n\nA Department of Homeland Security agent testified at an earlier hearing that he did not begin investigating the traffic stop until after the U.S. Supreme Court said in April that the Trump administration must work to bring back Abrego Garcia.\n\n___\n\nAssociated Press writer Claudia Lauer in Philadelphia contributed to this report.",
        "scrapedAt": "2025-12-12T20:34:00.849Z",
        "success": true,
        "origin": "apNewsUS"
      },
      "processed": {
        "title": "Federal Judge Prevents ICE From Detaining Kilmar Abrego Garcia Again",
        "tickerTitle": "Judge Blocks ICE Detention",
        "excerpt": "A federal judge ruled that ICE cannot detain Kilmar Abrego Garcia again until a hearing is held, following his recent release from immigration detention.",
        "category": "us",
        "body": "A U.S. district judge granted a temporary order on Friday preventing immigration authorities from re-detaining Kilmar Abrego Garcia, who had just been released from a Pennsylvania facility. The ruling came shortly after Abrego Garcia attended a scheduled appointment at an Immigration and Customs Enforcement (ICE) office in Maryland. His legal team expressed concerns about the potential for immediate re-detainment and requested the court's intervention. After the appointment, supporters greeted him with enthusiasm as he emerged, encouraging him to keep fighting for justice. \n\nAbrego Garcia, who has drawn attention for his previous wrongful deportation to a violent prison in El Salvador, was last detained in August during a check-in. U.S. District Judge Paula Xinis indicated the likelihood of success for Abrego Garcia should he seek further relief from ICE actions. In her written order, she emphasized the need for due process, stating that swift detainments could undermine public faith in the justice system. Abrego Garcia, feeling hopeful, addressed gathered supporters, emphasizing the importance of standing firm against injustices. \n\nThe court's ruling follows governmental arguments contesting jurisdiction over the removal order for Abrego Garcia. The judge found the authorities had not appropriately backed their claims and had previously misled the court about his detainment. Now back in Maryland, after being held in a facility northeast of Pittsburgh, Abrego Garcia continues to navigate the complexities of his immigration status, having previously been granted protection from deportation due to threats in his home country. ICE has faced scrutiny and criticism following this case, with the Department of Homeland Security indicating plans to challenge the judge's recent order.",
        "imageKeyword": "immigration",
        "tags": [
          "Congress",
          "White House",
          "Elections"
        ],
        "image": {
          "url": "https://images.pexels.com/photos/887848/pexels-photo-887848.jpeg",
          "thumbUrl": "https://images.pexels.com/photos/887848/pexels-photo-887848.jpeg?auto=compress&cs=tinysrgb&h=350",
          "width": 3456,
          "height": 5184,
          "authorName": "Daniel Bendig",
          "authorUrl": "https://www.pexels.com/@danielbendig",
          "source": "pexels",
          "sourcePageUrl": "https://www.pexels.com/photo/statue-of-liberty-887848/",
          "license": "Pexels License"
        }
      }
    },
    {
      "original": {
        "url": "https://www.yahoo.com/news/articles/flood-stricken-towns-washington-state-202120553.html",
        "title": "Flood-stricken towns in Washington state brace for potential levee failures",
        "excerpt": "By David Ryder and Steve Gorman BURLINGTON, Washington, Dec 12 (Reuters) - Residents and emergency crews in towns along the rain-engorged Skagit River in...",
        "category": "us",
        "body": "By David Ryder and Steve Gorman\n\nBURLINGTON, Washington, Dec 12 (Reuters) - Residents and emergency crews in towns along the rain-engorged Skagit River in western Washington state braced on Friday for potential levee failures while National Guard troops assisted ​in evacuations after days of severe flooding in the Pacific Northwest.\n\nThe entire town of Burlington, a community of about ‌9,200 people near Puget Sound, was under evacuation on Friday after the river crested at an all-time high of nearly 38 feet (11.6 meters), well above major flood ‌stage, at the city of Mount Vernon just downstream.\n\n\"We haven't seen flooding like this ever,\" said Karina Shagren, a spokesperson for the state's emergency management division. So far there were no reports of casualties or missing people, she said.\n\nThe Skagit River flood plain as a whole, a rural area home to about 78,000 people north of Seattle, was already under a Level 3 evacuation notice urging residents to ⁠immediately move to higher ground. Evacuation notices ‌covered an estimated 100,000 people statewide.\n\nNational Guard troops and sheriff's deputies were going door to door to facilitate the evacuation, and some were seen paddling stranded Burlington residents to safety in inflatable river rafts ‍through muddy floodwaters.\n\nFlood control levees appeared to be holding firm immediately following the river's historic crest, testing their strength for the first time since repairs to the earthen embankments were made following the last major flood in that area in 2021, state officials said.\n\nRains were abating as of ​Friday. But the National Weather Service posted a flash-flood warning for the river basin downstream to the mouth of the Skagit, ‌where it drains into Puget Sound, citing the potential for levee failures under heavy pressure from the high water.\n\n\"Extensive flooding of streets, homes and farmland will be possible\" if levees and dikes give way, the Weather Service said.\n\nA levee failure would greatly magnify widespread flooding already occurring across much of western Washington state. Aerial footage broadcast by CNN showed communities inundated in deep, brown water with many homes submerged almost to their rooftops.\n\nThe Burlington-Mount Vernon area in Skagit County remained the epicenter of widespread flooding caused by ⁠days of torrential downpours extending from northern Oregon north through western Washington ​state and into British Columbia.\n\nSouth of Skagit County, National Guard troops also were ​dispatched to deliver food and check on stranded residents in a number of communities cut off by flooding in adjacent Snohomish County, Shagren said.\n\nThe flooding washed out or forced the closure of dozens of roads ‍throughout the region, including most of ⁠the Canadian highways leading to the British Columbia port city of Vancouver. Several lengthy stretches of the BNSF Railway, a major freight line serving the Pacific Northwest, were also shut down on Thursday.\n\nThe heavy rains were unleashed by an ⁠atmospheric river storm, a vast airborne current of dense moisture siphoned from the ocean and swept inland over the Pacific Northwest earlier in the week. Parts ‌of northern Idaho and western Montana also were hit.\n\n(Reporting by David Ryder in Burlington, Washington; Writing and additional ‌reporting by Steve Gorman in Los Angeles; Editing by Matthew Lewis)",
        "scrapedAt": "2025-12-12T20:34:02.771Z",
        "success": true,
        "origin": "yahooUSNews"
      },
      "processed": {
        "title": "Burlington, Washington Prepares for Possible Levee Failures Amid Flooding",
        "tickerTitle": "Washington Flooding",
        "excerpt": "Residents in Burlington and surrounding areas prepare for possible levee failures as flooding from the Skagit River continues.",
        "category": "us",
        "body": "Residents and emergency responders in towns along the swollen Skagit River in western Washington are preparing for potential levee failures as the community faces severe flooding. National Guard troops have been deployed to assist with evacuations after the river crested at nearly 38 feet, surpassing historic flood levels. Burlington, a town with about 9,200 residents, has issued an evacuation order for its inhabitants.\n\nKarina Shagren, representing the state's emergency management division, noted that the flooding crisis has reached unprecedented levels. While there are currently no reports of casualties or missing persons, a Level 3 evacuation notice has been issued for the Skagit River flood plain, affecting approximately 100,000 people statewide. National Guard personnel are assisting with evacuations, utilizing inflatable rafts to reach those stranded by the rising waters.\n\nFollowing the river's crest, flood control levees have so far held strong, marking their first real test since repairs were completed post-2021 flooding. However, the National Weather Service has issued a flash-flood warning for the region, indicating that levee failures are a possibility under the current conditions. A breach could lead to extensive flooding of homes and farmland.\n\nThe Burlington and Mount Vernon areas are at the heart of the flooding, which stems from days of heavy rain fueled by an atmospheric river storm impacting the Pacific Northwest. National Guard units are also attending to stranded residents in nearby Snohomish County and providing essential supplies. Major roads and railways in the vicinity have experienced closures due to the flooding, disrupting transportation throughout the region.",
        "imageKeyword": "flooding",
        "tags": [
          "Climate",
          "Economy",
          "Congress"
        ],
        "image": {
          "url": "https://images.pexels.com/photos/1739855/pexels-photo-1739855.jpeg",
          "thumbUrl": "https://images.pexels.com/photos/1739855/pexels-photo-1739855.jpeg?auto=compress&cs=tinysrgb&h=350",
          "width": 5228,
          "height": 3485,
          "authorName": "hitesh choudhary",
          "authorUrl": "https://www.pexels.com/@hiteshchoudhary",
          "source": "pexels",
          "sourcePageUrl": "https://www.pexels.com/photo/man-pouring-water-from-dipper-on-blue-and-grey-house-1739855/",
          "license": "Pexels License"
        }
      }
    }
  ]
}